---------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submit
> tion\Log\Estimation.log
  log type:  text
 opened on:  13 Feb 2019, 16:46:35

. 
. * Summary statistics
. do "$Code\ReadData.do"

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd $Inputfd

. 
. qui {

. 
end of do-file

. qui     reg ///
>                                 `commonVar' ///
>                                 `emp1' ///
>                                 , vce(r)

.                 est sto forsum

. keep if _est_forsum==1
(2,063 observations deleted)

. tabulate dsize, generate(sized)

      dsize |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,076       37.68       37.68
          1 |      1,874       22.95       60.63
          2 |      3,214       39.37      100.00
------------+-----------------------------------
      Total |      8,164      100.00

. tabulate schooling, generate(edud)

  schooling |      Freq.     Percent        Cum.
------------+-----------------------------------
          9 |        294        3.60        3.60
         12 |      3,603       44.13       47.73
         14 |        914       11.20       58.93
         16 |      3,353       41.07      100.00
------------+-----------------------------------
      Total |      8,164      100.00

. estpost sum age edud* dmarital dunion sized* dregular ///
>                                         realwage workexp emptenure

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)     e(min) 
-------------+------------------------------------------------------------------
         age |      8164       8164   45.53234   106.1635   10.30357         20 
       edud1 |      8164       8164   .0360118   .0347192   .1863308          0 
       edud2 |      8164       8164   .4413278   .2465878   .4965761          0 
       edud3 |      8164       8164   .1119549   .0994332   .3153303          0 
       edud4 |      8164       8164   .4107055   .2420561    .491992          0 
    dmarital |      8164       8164   .8375796   .1360567   .3688586          0 
      dunion |      8164       8164   .2905439   .2061534   .4540412          0 
      sized1 |      8164       8164   .3767761   .2348446   .4846077          0 
      sized2 |      8164       8164   .2295443   .1768754   .4205656          0 
      sized3 |      8164       8164   .3936796   .2387252   .4885951          0 
    dregular |      8164       8164   .8924547   .0959911   .3098243          0 
    realwage |      8164       8164   7.580954   .3069015    .553987   5.526562 
     workexp |      8164       8164   25.56088   115.7485   10.75865          0 
   emptenure |      8164       8164   14.34358   125.5714   11.20586          0 

             |    e(max)     e(sum) 
-------------+----------------------
         age |        64     371726 
       edud1 |         1        294 
       edud2 |         1       3603 
       edud3 |         1        914 
       edud4 |         1       3353 
    dmarital |         1       6838 
      dunion |         1       2372 
      sized1 |         1       3076 
      sized2 |         1       1874 
      sized3 |         1       3214 
    dregular |         1       7286 
    realwage |  10.65899   61890.91 
     workexp |        50     208679 
   emptenure |        47     117101 

. esttab using "$Output\sum.tex", ///
>         cell( ///
>                         ( ///
>                         mean(label(Mean) fmt(%5.4f)) ///
>                         sd(label(St.d) fmt(%5.4f)) ///
>                         min(label(Min)) ///
>                         max(label(Max)) ///
>                         ) ///
>                         ) ///
>         coeflabel( ///
>                                         age "Age" ///
>                                         edud1 "\quad Junior High School" ///
>                                         edud2 "\quad High School" ///
>                                         edud3 "\quad 2-year College or Vocation
> al" ///
>                                         edud4 "\quad College or More" ///
>                                         dmarital "Married" ///
>                                         dunion "Union Member" ///
>                                         sized1 "\quad Size $<100$" ///
>                                         sized2 "\quad $100\leq$ Size $<500$" //
> /
>                                         sized3 "\quad Size $\geq 500$" ///
>                                         dregular "Regular Employee" ///
>                                         realwage "Log of Real Hourly Wage" ///
>                                         workexp "Total Experience" ///
>                                         emptenure "Employer Tenure" ///
>                                         ) ///
>         replace
(output written to C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\
> Submittion\Output\sum.tex)

. 
. 
end of do-file

