---------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submit
> tion\Log\Estimation.log
  log type:  text
 opened on:  18 Dec 2018, 19:47:11

. 
. * Summary statistics
. do "$Code\ReadData.do"

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd $Inputfd

. 
. qui {

. 
end of do-file

. qui     reg ///
>                                 `commonVar' ///
>                                 `emp1' ///
>                                 , vce(r)

.                 est sto forsum

. keep if _est_forsum==1
(2,907 observations deleted)

. tabulate dsize, generate(sized)

      dsize |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,328       38.69       38.69
          1 |      1,948       22.65       61.34
          2 |      3,325       38.66      100.00
------------+-----------------------------------
      Total |      8,601      100.00

. tabulate schooling, generate(edud)

  schooling |      Freq.     Percent        Cum.
------------+-----------------------------------
          9 |        308        3.58        3.58
         12 |      3,800       44.18       47.76
         14 |        972       11.30       59.06
         16 |      3,521       40.94      100.00
------------+-----------------------------------
      Total |      8,601      100.00

. estpost sum age edud* dmarital dunion sized* dregular ///
>                                         realwage workexp emptenure

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)     e(min) 
-------------+------------------------------------------------------------------
         age |      8601       8601    45.3588    105.531   10.27283         20 
       edud1 |      8601       8601   .0358098   .0345315   .1858264          0 
       edud2 |      8601       8601   .4418091   .2466425   .4966311          0 
       edud3 |      8601       8601   .1130101   .1002505   .3166236          0 
       edud4 |      8601       8601    .409371   .2418145   .4917464          0 
    dmarital |      8601       8601   .8386234   .1353499   .3678993          0 
      dunion |      8601       8601   .2875247   .2048781   .4526346          0 
      sized1 |      8601       8601   .3869318   .2372432   .4870761          0 
      sized2 |      8601       8601   .2264853   .1752101    .418581          0 
      sized3 |      8601       8601    .386583   .2371641    .486995          0 
    dregular |      8601       8601   .8961749   .0930563   .3050513          0 
    realwage |      8601       8601   7.551957   .3173452    .563334   5.526562 
     workexp |      8601       8601   25.39402   114.9897   10.72333          0 
   emptenure |      8601       8601   14.21056   124.0376   11.13722          0 

             |    e(max)     e(sum) 
-------------+----------------------
         age |        64     390131 
       edud1 |         1        308 
       edud2 |         1       3800 
       edud3 |         1        972 
       edud4 |         1       3521 
    dmarital |         1       7213 
      dunion |         1       2473 
      sized1 |         1       3328 
      sized2 |         1       1948 
      sized3 |         1       3325 
    dregular |         1       7708 
    realwage |  10.65899   64954.39 
     workexp |        50     218414 
   emptenure |        47     122225 

. esttab using "$Output\sum.tex", ///
>         cell( ///
>                         ( ///
>                         mean(label(Mean) fmt(%5.4f)) ///
>                         sd(label(St.d) fmt(%5.4f)) ///
>                         min(label(Min)) ///
>                         max(label(Max)) ///
>                         ) ///
>                         ) ///
>         coeflabel( ///
>                                         age "Age" ///
>                                         edud1 "\quad Junior High School" ///
>                                         edud2 "\quad High School" ///
>                                         edud3 "\quad 2-year College or Vocation
> al" ///
>                                         edud4 "\quad College or More" ///
>                                         dmarital "Married" ///
>                                         dunion "Union Member" ///
>                                         sized1 "\quad Size $<100$" ///
>                                         sized2 "\quad $100\leq$ Size $<500$" //
> /
>                                         sized3 "\quad Size $\geq 500$" ///
>                                         dregular "Regular Employee" ///
>                                         realwage "Log of Real Hourly Wage" ///
>                                         workexp "Total Experience" ///
>                                         emptenure "Employer Tenure" ///
>                                         ) ///
>         replace
(output written to C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\
> Submittion\Output\sum.tex)

. 
. * 1. OLS->AS / 1-4 dimenational polynomial
. {
. ** OLS
. *** read data
. do "$Code\ReadData.do"

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd $Inputfd

. 
. qui {

. 
end of do-file
. 
. foreach ten_i of local isIncOcc{
  2.         forvalues poly_x=1/4{
  3.                 dis "/* OLS `ten_i' `poly_x'th order */"
  4.                 reg ///
>                                 `commonVar' ///
>                                 ``ten_i'`poly_x'' ///
>                                 , vce(r)
  5.                 est sto ols`ten_i'`poly_x'
  6.         }
  7. }
/* OLS emp 1th order */

Linear regression                               Number of obs     =      8,601
                                                F(49, 8551)       =      89.65
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3262
                                                Root MSE          =     .46374

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         occ |
          2  |   .0298433   .4248095     0.07   0.944     -.802886    .8625726
          3  |  -.2076717   .3912234    -0.53   0.596    -.9745639    .5592206
          4  |  -.3044627   .3929636    -0.77   0.438    -1.074766    .4658408
          5  |   .1063267   .3927505     0.27   0.787     -.663559    .8762124
          6  |  -.1316973   .3926266    -0.34   0.737    -.9013402    .6379457
          7  |  -.2622397   .3930451    -0.67   0.505    -1.032703    .5082236
          8  |  -.1984736   .3926744    -0.51   0.613    -.9682102     .571263
          9  |  -.0878245   .3930327    -0.22   0.823    -.8582635    .6826145
         10  |  -.0598358   .3928406    -0.15   0.879    -.8298983    .7102266
         11  |  -.3579745   .3936301    -0.91   0.363    -1.129585    .4136356
         12  |  -.1590405   .3990531    -0.40   0.690     -.941281       .6232
             |
         ind |
          2  |    .012021   .2478196     0.05   0.961    -.4737652    .4978072
          3  |   .3907741   .4204045     0.93   0.353    -.4333202    1.214868
          4  |    .355097   .4013861     0.88   0.376    -.4317167    1.141911
          5  |   .4169589   .4014666     1.04   0.299    -.3700126     1.20393
          6  |   .3542953   .4003735     0.88   0.376    -.4305334    1.139124
          7  |   .3493815   .4032273     0.87   0.386    -.4410414    1.139804
          8  |   .4153627   .4020235     1.03   0.302    -.3727004    1.203426
          9  |   .5067405    .404324     1.25   0.210    -.2858321    1.299313
         10  |   .3259212   .4017167     0.81   0.417    -.4615406    1.113383
         11  |   .4467693   .4020398     1.11   0.266    -.3413257    1.234864
         12  |   .4920627   .4021688     1.22   0.221    -.2962852    1.280411
         13  |   .4610662   .4028175     1.14   0.252    -.3285535    1.250686
         14  |   .3153116   .4017508     0.78   0.433     -.472217     1.10284
         15  |    .448028   .4027573     1.11   0.266    -.3414736     1.23753
         16  |   .3778826   .4012301     0.94   0.346    -.4086252     1.16439
         17  |   .2782773   .4183505     0.67   0.506    -.5417906    1.098345
         18  |   .3845863   .4065578     0.95   0.344    -.4123652    1.181538
             |
    1.dunion |   .0362543   .0125991     2.88   0.004     .0115571    .0609515
  1.dmarital |   .1577715   .0139658    11.30   0.000     .1303952    .1851478
             |
        year |
       2005  |   .1102695   .0291239     3.79   0.000     .0531796    .1673594
       2006  |   .0938675   .0282348     3.32   0.001     .0385206    .1492145
       2007  |   .0716693    .025791     2.78   0.005     .0211127     .122226
       2008  |    .068432   .0258496     2.65   0.008     .0177606    .1191035
       2009  |   .0977198   .0233914     4.18   0.000     .0518671    .1435725
       2010  |    .064362   .0238277     2.70   0.007      .017654    .1110699
       2011  |   .0767761   .0233642     3.29   0.001     .0309767    .1225756
       2012  |   .0715229   .0234207     3.05   0.002     .0256126    .1174332
       2013  |    .066243   .0247007     2.68   0.007     .0178237    .1146622
       2014  |   .1013664    .024429     4.15   0.000     .0534797    .1492531
             |
   schooling |
         12  |   .1224318   .0267831     4.57   0.000     .0699304    .1749331
         14  |    .122101   .0307231     3.97   0.000     .0618762    .1823257
         16  |   .2491474   .0289299     8.61   0.000     .1924378     .305857
             |
       dsize |
          1  |   .0737344   .0137779     5.35   0.000     .0467263    .1007424
          2  |   .2103619   .0140173    15.01   0.000     .1828846    .2378392
             |
  1.dregular |   .2878633   .0178858    16.09   0.000     .2528028    .3229238
   emptenure |   .0096817   .0006058    15.98   0.000     .0084942    .0108691
          oj |   .1036268   .0252218     4.11   0.000      .054186    .1530676
     workexp |   .0025138   .0006005     4.19   0.000     .0013366    .0036909
       _cons |   6.267301    .094755    66.14   0.000     6.081559    6.453044
------------------------------------------------------------------------------
/* OLS emp 2th order */

Linear regression                               Number of obs     =      8,601
                                                F(51, 8549)       =      88.15
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3336
                                                Root MSE          =     .46125

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         occ |
          2  |   .0073181   .4316699     0.02   0.986    -.8388592    .8534954
          3  |  -.2553092   .3741991    -0.68   0.495    -.9888299    .4782115
          4  |  -.3432263   .3759146    -0.91   0.361     -1.08011     .393657
          5  |   .0560337   .3757239     0.15   0.881    -.6804758    .7925433
          6  |  -.1793694   .3755732    -0.48   0.633    -.9155836    .5568449
          7  |  -.3087859    .375977    -0.82   0.412    -1.045792    .4282199
          8  |  -.2508939   .3755716    -0.67   0.504    -.9871049     .485317
          9  |  -.1366654   .3759748    -0.36   0.716    -.8736669     .600336
         10  |  -.1057212   .3757658    -0.28   0.778    -.8423129    .6308704
         11  |  -.3951467   .3765935    -1.05   0.294    -1.133361    .3430674
         12  |   -.214244   .3824399    -0.56   0.575    -.9639185    .5354305
             |
         ind |
          2  |   .0287989   .2362854     0.12   0.903    -.4343775    .4919753
          3  |   .3974769   .4050759     0.98   0.327    -.3965697    1.191523
          4  |   .3888868   .3852665     1.01   0.313    -.3663285    1.144102
          5  |   .4466031   .3853574     1.16   0.247    -.3087905    1.201997
          6  |   .3834056   .3843326     1.00   0.319    -.3699791     1.13679
          7  |   .3753626   .3872532     0.97   0.332    -.3837471    1.134472
          8  |   .4443837   .3859914     1.15   0.250    -.3122528     1.20102
          9  |   .5349681   .3883436     1.38   0.168    -.2262792    1.296215
         10  |   .3499001   .3856454     0.91   0.364     -.406058    1.105858
         11  |   .4760945   .3860029     1.23   0.217    -.2805644    1.232753
         12  |   .5311907   .3860441     1.38   0.169    -.2255489     1.28793
         13  |   .5081122   .3867894     1.31   0.189    -.2500885    1.266313
         14  |   .3447612   .3856714     0.89   0.371    -.4112479     1.10077
         15  |   .4847534   .3867066     1.25   0.210     -.273285    1.242792
         16  |   .4090511   .3851298     1.06   0.288    -.3458963    1.163999
         17  |   .3299905   .4017572     0.82   0.411    -.4575507    1.117532
         18  |   .4237962   .3906907     1.08   0.278    -.3420519    1.189644
             |
    1.dunion |   .0429304   .0125396     3.42   0.001     .0183497    .0675111
  1.dmarital |   .1395932   .0141004     9.90   0.000      .111953    .1672335
             |
        year |
       2005  |   .1051563   .0289393     3.63   0.000     .0484283    .1618843
       2006  |   .0846143   .0280236     3.02   0.003     .0296813    .1395473
       2007  |   .0661225     .02552     2.59   0.010     .0160972    .1161478
       2008  |    .062163   .0255797     2.43   0.015     .0120206    .1123053
       2009  |   .0925691   .0231844     3.99   0.000     .0471221    .1380161
       2010  |   .0567686   .0237177     2.39   0.017     .0102763    .1032609
       2011  |   .0672909   .0232276     2.90   0.004     .0217592    .1128227
       2012  |   .0638323   .0233065     2.74   0.006     .0181459    .1095187
       2013  |   .0560475   .0246066     2.28   0.023     .0078127    .1042824
       2014  |   .0926631    .024248     3.82   0.000     .0451311    .1401951
             |
   schooling |
         12  |   .0823595   .0268088     3.07   0.002     .0298077    .1349113
         14  |   .0839315   .0306389     2.74   0.006     .0238719    .1439912
         16  |   .2073878   .0287796     7.21   0.000     .1509729    .2638027
             |
       dsize |
          1  |   .0774864   .0137628     5.63   0.000     .0505079    .1044649
          2  |   .2132906   .0140112    15.22   0.000     .1858253    .2407559
             |
  1.dregular |   .2477924   .0180108    13.76   0.000     .2124869    .2830978
   emptenure |   .0142208   .0019051     7.46   0.000     .0104863    .0179552
             |
 c.emptenure#|
 c.emptenure |  -.0001353   .0000492    -2.75   0.006    -.0002317   -.0000389
             |
          oj |    .075954   .0266971     2.85   0.004     .0236212    .1282868
     workexp |   .0209201   .0025481     8.21   0.000     .0159251     .025915
             |
   c.workexp#|
   c.workexp |  -.0003574    .000049    -7.29   0.000    -.0004535   -.0002613
             |
       _cons |    6.18851   .0969526    63.83   0.000     5.998459    6.378561
------------------------------------------------------------------------------
/* OLS emp 3th order */

Linear regression                               Number of obs     =      8,601
                                                F(53, 8547)       =      86.37
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3345
                                                Root MSE          =     .46097

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         occ |
          2  |    .035853   .4318371     0.08   0.934     -.810652    .8823579
          3  |  -.2538667   .3691278    -0.69   0.492    -.9774463     .469713
          4  |  -.3426014    .370818    -0.92   0.356    -1.069494    .3842916
          5  |   .0542428   .3705448     0.15   0.884    -.6721144    .7806001
          6  |  -.1788311     .37041    -0.48   0.629    -.9049242    .5472621
          7  |  -.3074672   .3708532    -0.83   0.407    -1.034429    .4194948
          8  |  -.2521581   .3704169    -0.68   0.496    -.9782647    .4739485
          9  |  -.1334415   .3708716    -0.36   0.719    -.8604395    .5935564
         10  |  -.1059534   .3706364    -0.29   0.775    -.8324903    .6205836
         11  |  -.3970154   .3714657    -1.07   0.285    -1.125178    .3311471
         12  |  -.2141069   .3772725    -0.57   0.570    -.9536521    .5254384
             |
         ind |
          2  |   .0356904   .2348054     0.15   0.879    -.4245848    .4959656
          3  |   .3976255   .4009282     0.99   0.321    -.3882906    1.183542
          4  |   .3926446   .3801417     1.03   0.302     -.352525    1.137814
          5  |   .4496891   .3802469     1.18   0.237    -.2956867    1.195065
          6  |   .3854415   .3792463     1.02   0.309    -.3579729    1.128856
          7  |    .375509    .382165     0.98   0.326    -.3736268    1.124645
          8  |   .4462195   .3809259     1.17   0.241    -.3004872    1.192926
          9  |    .535498   .3831342     1.40   0.162    -.2155376    1.286534
         10  |   .3529311   .3805429     0.93   0.354     -.393025    1.098887
         11  |   .4781541   .3808906     1.26   0.209    -.2684835    1.224792
         12  |   .5350169   .3809018     1.40   0.160    -.2116426    1.281676
         13  |   .5113689   .3817277     1.34   0.180    -.2369095    1.259647
         14  |   .3471146   .3805863     0.91   0.362    -.3989265    1.093156
         15  |   .4856984   .3816627     1.27   0.203    -.2624528     1.23385
         16  |   .4121984   .3799993     1.08   0.278    -.3326919    1.157089
         17  |   .3322223    .396964     0.84   0.403     -.445923    1.110368
         18  |   .4286016   .3856436     1.11   0.266    -.3273531    1.184556
             |
    1.dunion |   .0417507   .0125323     3.33   0.001     .0171844    .0663169
  1.dmarital |   .1484919   .0143872    10.32   0.000     .1202895    .1766943
             |
        year |
       2005  |   .1075587   .0289099     3.72   0.000     .0508883    .1642292
       2006  |   .0872436   .0280074     3.12   0.002     .0323423     .142145
       2007  |   .0692244   .0255124     2.71   0.007      .019214    .1192348
       2008  |   .0653953   .0256185     2.55   0.011      .015177    .1156137
       2009  |   .0954065   .0231839     4.12   0.000     .0499604    .1408525
       2010  |   .0605038   .0237276     2.55   0.011      .013992    .1070156
       2011  |   .0716244   .0232323     3.08   0.002     .0260835    .1171653
       2012  |    .068778   .0233357     2.95   0.003     .0230345    .1145216
       2013  |   .0605591   .0246513     2.46   0.014     .0122365    .1088817
       2014  |   .0973608   .0243211     4.00   0.000     .0496855    .1450361
             |
   schooling |
         12  |   .0747428   .0269416     2.77   0.006     .0219308    .1275549
         14  |   .0722956   .0309286     2.34   0.019     .0116681    .1329232
         16  |   .1944387   .0292002     6.66   0.000     .1371992    .2516781
             |
       dsize |
          1  |   .0779685   .0137708     5.66   0.000     .0509744    .1049626
          2  |   .2138775   .0140379    15.24   0.000     .1863599    .2413952
             |
  1.dregular |   .2415793     .01814    13.32   0.000     .2060206     .277138
   emptenure |   .0119727   .0043679     2.74   0.006     .0034105    .0205348
             |
 c.emptenure#|
 c.emptenure |   .0000313   .0002602     0.12   0.904    -.0004788    .0005413
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure |  -3.11e-06   4.27e-06    -0.73   0.465    -.0000115    5.25e-06
             |
          oj |   .0879997   .0293032     3.00   0.003     .0305583    .1454411
     workexp |   .0011013   .0070038     0.16   0.875    -.0126279    .0148304
             |
   c.workexp#|
   c.workexp |    .000531   .0002988     1.78   0.076    -.0000548    .0011168
             |
   c.workexp#|
   c.workexp#|
   c.workexp |  -.0000117   3.90e-06    -3.00   0.003    -.0000193   -4.04e-06
             |
       _cons |   6.306139    .102924    61.27   0.000     6.104383    6.507895
------------------------------------------------------------------------------
/* OLS emp 4th order */

Linear regression                               Number of obs     =      8,601
                                                F(55, 8545)       =      84.12
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3350
                                                Root MSE          =     .46087

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         occ |
          2  |   .0618536   .4349325     0.14   0.887    -.7907192    .9144265
          3  |  -.2432918   .3673247    -0.66   0.508     -.963337    .4767534
          4  |  -.3309758   .3690339    -0.90   0.370    -1.054371    .3924197
          5  |   .0655165   .3687909     0.18   0.859    -.6574027    .7884358
          6  |  -.1677966   .3686378    -0.46   0.649    -.8904157    .5548225
          7  |  -.2966807   .3690969    -0.80   0.422      -1.0202    .4268383
          8  |  -.2424674   .3686365    -0.66   0.511    -.9650841    .4801493
          9  |  -.1225319   .3691185    -0.33   0.740    -.8460934    .6010296
         10  |  -.0949958   .3688641    -0.26   0.797    -.8180586    .6280671
         11  |  -.3862971   .3696763    -1.04   0.296    -1.110952    .3383577
         12  |   -.203297   .3754912    -0.54   0.588    -.9393505    .5327565
             |
         ind |
          2  |   .0320425   .2345253     0.14   0.891    -.4276837    .4917688
          3  |   .3892312   .3991222     0.98   0.329    -.3931448    1.171607
          4  |   .3827798   .3783167     1.01   0.312    -.3588124    1.124372
          5  |   .4414016   .3783922     1.17   0.243    -.3003385    1.183142
          6  |   .3761675   .3773906     1.00   0.319    -.3636093    1.115944
          7  |   .3661132   .3803409     0.96   0.336    -.3794469    1.111673
          8  |   .4368394   .3790715     1.15   0.249    -.3062324    1.179911
          9  |   .5241959   .3813545     1.37   0.169    -.2233512    1.271743
         10  |   .3426173    .378733     0.90   0.366    -.3997908    1.085025
         11  |    .469498   .3790659     1.24   0.216    -.2735627    1.212559
         12  |   .5239654   .3791412     1.38   0.167    -.2192431    1.267174
         13  |   .5017777   .3798756     1.32   0.187    -.2428703    1.246426
         14  |    .337571   .3787601     0.89   0.373    -.4048904    1.080032
         15  |   .4758025   .3797665     1.25   0.210    -.2686316    1.220237
         16  |   .4018155   .3781914     1.06   0.288     -.339531    1.143162
         17  |   .3221113   .3949964     0.82   0.415    -.4521771      1.0964
         18  |   .4174979   .3838319     1.09   0.277    -.3349054    1.169901
             |
    1.dunion |   .0404155   .0125258     3.23   0.001     .0158618    .0649691
  1.dmarital |   .1473386    .014372    10.25   0.000     .1191661    .1755111
             |
        year |
       2005  |   .1058697    .028889     3.66   0.000     .0492403    .1624991
       2006  |   .0859085   .0280095     3.07   0.002     .0310032    .1408139
       2007  |   .0688591   .0254932     2.70   0.007     .0188863    .1188319
       2008  |    .064305   .0256337     2.51   0.012     .0140567    .1145533
       2009  |   .0949521   .0231548     4.10   0.000     .0495632    .1403411
       2010  |    .060136   .0237142     2.54   0.011     .0136504    .1066216
       2011  |   .0707637   .0232056     3.05   0.002     .0252752    .1162523
       2012  |     .06833   .0233102     2.93   0.003     .0226363    .1140237
       2013  |   .0601372    .024626     2.44   0.015     .0118643    .1084101
       2014  |   .0970831   .0243064     3.99   0.000     .0494368    .1447295
             |
   schooling |
         12  |   .0747115   .0268738     2.78   0.005     .0220324    .1273906
         14  |   .0715891   .0309056     2.32   0.021     .0110067    .1321715
         16  |   .1930224   .0291813     6.61   0.000       .13582    .2502248
             |
       dsize |
          1  |   .0781103   .0137633     5.68   0.000     .0511309    .1050898
          2  |    .214707   .0140265    15.31   0.000     .1872117    .2422023
             |
  1.dregular |   .2385139    .018292    13.04   0.000     .2026572    .2743706
   emptenure |   .0156775   .0084211     1.86   0.063    -.0008299    .0321849
             |
 c.emptenure#|
 c.emptenure |  -.0003977   .0008319    -0.48   0.633    -.0020285    .0012331
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure |   .0000143   .0000301     0.48   0.635    -.0000447    .0000732
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure#|
 c.emptenure |  -2.24e-07   3.58e-07    -0.63   0.531    -9.25e-07    4.77e-07
             |
          oj |   .0786059   .0329425     2.39   0.017     .0140306    .1431811
     workexp |   .0286527   .0144831     1.98   0.048     .0002624     .057043
             |
   c.workexp#|
   c.workexp |  -.0015841   .0010463    -1.51   0.130    -.0036352    .0004669
             |
   c.workexp#|
   c.workexp#|
   c.workexp |   .0000504   .0000303     1.66   0.096    -9.01e-06    .0001098
             |
   c.workexp#|
   c.workexp#|
   c.workexp#|
   c.workexp |  -6.14e-07   3.02e-07    -2.03   0.042    -1.21e-06   -2.16e-08
             |
       _cons |   6.204579   .1114987    55.65   0.000     5.986015    6.423143
------------------------------------------------------------------------------
/* OLS empocc 1th order */

Linear regression                               Number of obs     =      8,463
                                                F(50, 8412)       =      85.54
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3234
                                                Root MSE          =     .46421

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         occ |
          2  |   .0332711   .4290397     0.08   0.938    -.8077523    .8742945
          3  |  -.2070318   .3946956    -0.52   0.600    -.9807324    .5666687
          4  |   -.303629   .3964814    -0.77   0.444     -1.08083    .4735721
          5  |   .1056717   .3962129     0.27   0.790     -.671003    .8823464
          6  |  -.1326973   .3961013    -0.34   0.738    -.9091534    .6437588
          7  |  -.2631915   .3965513    -0.66   0.507     -1.04053    .5141467
          8  |  -.2014303   .3962126    -0.51   0.611    -.9781046    .5752439
          9  |  -.0897203   .3965506    -0.23   0.821     -.867057    .6876164
         10  |   -.058538   .3963102    -0.15   0.883    -.8354035    .7183274
         11  |  -.3590717   .3970573    -0.90   0.366    -1.137402    .4192584
         12  |  -.1505925      .4027    -0.37   0.708    -.9399836    .6387986
             |
         ind |
          2  |   .0051902    .249607     0.02   0.983     -.484101    .4944813
          3  |   .3925678   .4238122     0.93   0.354    -.4382085    1.223344
          4  |   .3524107   .4047972     0.87   0.384    -.4410914    1.145913
          5  |   .4153649   .4048609     1.03   0.305    -.3782621    1.208992
          6  |   .3555599   .4037382     0.88   0.379    -.4358663    1.146986
          7  |   .3519443    .406679     0.87   0.387    -.4452467    1.149135
          8  |   .4154657   .4053595     1.02   0.305    -.3791387     1.21007
          9  |   .4898874   .4076619     1.20   0.230    -.3092302    1.289005
         10  |   .3247295   .4050976     0.80   0.423    -.4693615    1.118821
         11  |   .4447705   .4054304     1.10   0.273    -.3499727    1.239514
         12  |   .4913332   .4055716     1.21   0.226    -.3036869    1.286353
         13  |   .4620242   .4062484     1.14   0.255    -.3343226    1.258371
         14  |   .3136846   .4051484     0.77   0.439    -.4805059    1.107875
         15  |   .4440057   .4061289     1.09   0.274    -.3521068    1.240118
         16  |   .3779994   .4046285     0.93   0.350    -.4151721    1.171171
         17  |   .2763468   .4216341     0.66   0.512    -.5501598    1.102853
         18  |   .3834785     .40995     0.94   0.350    -.4201245    1.187081
             |
    1.dunion |   .0392949   .0126646     3.10   0.002     .0144691    .0641207
  1.dmarital |    .167519   .0142135    11.79   0.000      .139657     .195381
             |
        year |
       2005  |   .1132793   .0292238     3.88   0.000     .0559935    .1705651
       2006  |   .0997403   .0285483     3.49   0.000     .0437787     .155702
       2007  |   .0740257   .0260748     2.84   0.005     .0229127    .1251387
       2008  |   .0704265   .0261235     2.70   0.007      .019218     .121635
       2009  |   .0987494    .023506     4.20   0.000     .0526718     .144827
       2010  |   .0701339    .024077     2.91   0.004     .0229372    .1173307
       2011  |   .0811079   .0235597     3.44   0.001      .034925    .1272908
       2012  |   .0731622   .0236208     3.10   0.002     .0268597    .1194647
       2013  |   .0702755   .0248769     2.82   0.005     .0215106    .1190403
       2014  |   .1029653   .0247768     4.16   0.000     .0543966     .151534
             |
   schooling |
         12  |   .1284972   .0275364     4.67   0.000      .074519    .1824754
         14  |   .1305994   .0314028     4.16   0.000     .0690423    .1921566
         16  |   .2585204   .0296606     8.72   0.000     .2003782    .3166625
             |
       dsize |
          1  |   .0707143   .0138854     5.09   0.000     .0434955    .0979332
          2  |   .2088087    .014194    14.71   0.000     .1809849    .2366325
             |
  1.dregular |    .286016   .0184764    15.48   0.000     .2497978    .3222342
   emptenure |   .0090545   .0007045    12.85   0.000     .0076735    .0104355
          oj |    .110154   .0261069     4.22   0.000      .058978      .16133
     workexp |   .0026952   .0006128     4.40   0.000     .0014939    .0038966
   occtenure |   .0008798   .0005708     1.54   0.123    -.0002391    .0019987
       _cons |   6.242768   .0956361    65.28   0.000     6.055298    6.430238
------------------------------------------------------------------------------
/* OLS empocc 2th order */

Linear regression                               Number of obs     =      8,463
                                                F(53, 8409)       =      82.92
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3313
                                                Root MSE          =     .46158

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         occ |
          2  |   .0087424   .4369551     0.02   0.984    -.8477972    .8652819
          3  |  -.2574723   .3768733    -0.68   0.495    -.9962367    .4812921
          4  |   -.345561   .3786312    -0.91   0.361    -1.087771    .3966494
          5  |   .0527165   .3783882     0.14   0.889    -.6890176    .7944506
          6  |  -.1828226   .3782468    -0.48   0.629    -.9242795    .5586343
          7  |  -.3132045   .3786713    -0.83   0.408    -1.055493    .4290844
          8  |  -.2574341   .3783028    -0.68   0.496    -.9990006    .4841325
          9  |  -.1411899   .3786926    -0.37   0.709    -.8835206    .6011408
         10  |  -.1082345   .3784324    -0.29   0.775    -.8500551     .633586
         11  |  -.3966982   .3792377    -1.05   0.296    -1.140097     .346701
         12  |  -.2059583   .3853054    -0.53   0.593    -.9612516    .5493351
             |
         ind |
          2  |   .0232396   .2375029     0.10   0.922    -.4423245    .4888036
          3  |   .3996626   .4077874     0.98   0.327    -.3997011    1.199026
          4  |    .390008   .3879066     1.01   0.315    -.3703845      1.1504
          5  |   .4472584   .3879845     1.15   0.249    -.3132867    1.207804
          6  |   .3870968     .38694     1.00   0.317    -.3714009    1.145594
          7  |   .3777866   .3899729     0.97   0.333    -.3866563    1.142229
          8  |   .4467475   .3885741     1.15   0.250    -.3149534    1.208448
          9  |   .5193559   .3909078     1.33   0.184    -.2469196    1.285631
         10  |   .3515248   .3882618     0.91   0.365    -.4095638    1.112613
         11  |   .4748832   .3886399     1.22   0.222    -.2869467    1.236713
         12  |   .5347767   .3887115     1.38   0.169    -.2271935    1.296747
         13  |   .5126403   .3894453     1.32   0.188    -.2507682    1.276049
         14  |   .3424371   .3883165     0.88   0.378    -.4187588    1.103633
         15  |   .4834645    .389304     1.24   0.214    -.2796673    1.246596
         16  |   .4115896   .3877642     1.06   0.289    -.3485237    1.171703
         17  |     .33109    .404265     0.82   0.413    -.4613689    1.123549
         18  |    .426161   .3933156     1.08   0.279    -.3448344    1.197156
             |
    1.dunion |   .0467006   .0126019     3.71   0.000     .0219978    .0714035
  1.dmarital |   .1506628   .0143653    10.49   0.000     .1225034    .1788223
             |
        year |
       2005  |    .109892   .0290592     3.78   0.000     .0529289    .1668551
       2006  |   .0923062   .0285284     3.24   0.001     .0363835    .1482289
       2007  |   .0689619   .0257995     2.67   0.008     .0183886    .1195353
       2008  |   .0647718   .0258478     2.51   0.012     .0141038    .1154398
       2009  |   .0939341   .0232952     4.03   0.000     .0482699    .1395984
       2010  |   .0627652   .0239849     2.62   0.009     .0157489    .1097815
       2011  |   .0716171   .0234293     3.06   0.002     .0256899    .1175444
       2012  |   .0657184   .0235265     2.79   0.005     .0196006    .1118362
       2013  |   .0595096   .0247622     2.40   0.016     .0109697    .1080496
       2014  |   .0941617   .0246522     3.82   0.000     .0458374     .142486
             |
   schooling |
         12  |   .0875229   .0275233     3.18   0.001     .0335705    .1414754
         14  |    .091161   .0313189     2.91   0.004     .0297683    .1525537
         16  |   .2161132   .0294853     7.33   0.000     .1583148    .2739117
             |
       dsize |
          1  |   .0742277   .0138538     5.36   0.000     .0470708    .1013846
          2  |   .2114669   .0141727    14.92   0.000      .183685    .2392489
             |
  1.dregular |   .2442518   .0185858    13.14   0.000      .207819    .2806846
   emptenure |    .012967   .0021421     6.05   0.000     .0087679    .0171661
             |
 c.emptenure#|
 c.emptenure |  -.0001147   .0000568    -2.02   0.044    -.0002261   -3.29e-06
             |
          oj |   .0857777   .0277247     3.09   0.002     .0314303     .140125
     workexp |   .0220992   .0026257     8.42   0.000     .0169523    .0272462
             |
   c.workexp#|
   c.workexp |  -.0003749   .0000504    -7.44   0.000    -.0004737   -.0002761
             |
   occtenure |    .002011   .0016374     1.23   0.219    -.0011986    .0052207
             |
 c.occtenure#|
 c.occtenure |  -.0000386   .0000494    -0.78   0.435    -.0001355    .0000583
             |
       _cons |    6.14932   .0980291    62.73   0.000     5.957159    6.341481
------------------------------------------------------------------------------
/* OLS empocc 3th order */

Linear regression                               Number of obs     =      8,463
                                                F(56, 8406)       =      79.88
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3323
                                                Root MSE          =     .46131

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         occ |
          2  |    .031316   .4379306     0.07   0.943    -.8271358    .8897678
          3  |  -.2634937   .3717139    -0.71   0.478    -.9921444     .465157
          4  |  -.3503258   .3734296    -0.94   0.348     -1.08234    .3816883
          5  |   .0446935    .373118     0.12   0.905    -.6867096    .7760966
          6  |  -.1884813   .3729976    -0.51   0.613    -.9196484    .5426858
          7  |  -.3196918   .3734597    -0.86   0.392    -1.051765    .4123812
          8  |   -.265873   .3730665    -0.71   0.476    -.9971752    .4654292
          9  |  -.1456366   .3735016    -0.39   0.697    -.8777918    .5865186
         10  |  -.1149209   .3732122    -0.31   0.758    -.8465086    .6166669
         11  |  -.4059224   .3740201    -1.09   0.278    -1.139094    .3272491
         12  |   -.210038   .3800276    -0.55   0.580    -.9549857    .5349097
             |
         ind |
          2  |   .0384934   .2355052     0.16   0.870    -.4231548    .5001416
          3  |   .4056576   .4034789     1.01   0.315    -.3852604    1.196576
          4  |   .4038676   .3826361     1.06   0.291    -.3461933    1.153929
          5  |   .4609414   .3827313     1.20   0.228    -.2893063    1.211189
          6  |   .4003941   .3817096     1.05   0.294    -.3478507    1.148639
          7  |    .386721   .3847273     1.01   0.315    -.3674393    1.140881
          8  |   .4596812   .3833812     1.20   0.231    -.2918402    1.211203
          9  |    .531373   .3855751     1.38   0.168    -.2244491    1.287195
         10  |   .3654331   .3830203     0.95   0.340    -.3853811    1.116247
         11  |     .48708   .3833768     1.27   0.204    -.2644329    1.238593
         12  |   .5500992   .3834426     1.43   0.151    -.2015427    1.301741
         13  |   .5257693   .3842156     1.37   0.171     -.227388    1.278927
         14  |   .3548573   .3830833     0.93   0.354    -.3960802    1.105795
         15  |   .4940504    .384075     1.29   0.198    -.2588312    1.246932
         16  |   .4257898   .3824968     1.11   0.266    -.3239981    1.175578
         17  |   .3440103   .3993663     0.86   0.389     -.438846    1.126866
         18  |   .4428416   .3881894     1.14   0.254    -.3181052    1.203788
             |
    1.dunion |   .0456751      .0126     3.62   0.000      .020976    .0703743
  1.dmarital |   .1594271   .0146605    10.87   0.000     .1306888    .1881653
             |
        year |
       2005  |   .1139508   .0290542     3.92   0.000     .0569974    .1709041
       2006  |   .0967998   .0285494     3.39   0.001     .0408359    .1527637
       2007  |   .0731725   .0258163     2.83   0.005     .0225662    .1237787
       2008  |   .0687248   .0258992     2.65   0.008      .017956    .1194936
       2009  |   .0969058   .0233143     4.16   0.000      .051204    .1426076
       2010  |   .0672861   .0240248     2.80   0.005     .0201916    .1143806
       2011  |   .0767282   .0234574     3.27   0.001     .0307459    .1227105
       2012  |    .070907    .023575     3.01   0.003     .0246941    .1171198
       2013  |   .0642098   .0248268     2.59   0.010     .0155431    .1128764
       2014  |   .0983623   .0247533     3.97   0.000     .0498398    .1468848
             |
   schooling |
         12  |   .0797355   .0276056     2.89   0.004     .0256218    .1338492
         14  |   .0794273   .0315707     2.52   0.012     .0175411    .1413136
         16  |   .2032425    .029873     6.80   0.000     .1446841    .2618009
             |
       dsize |
          1  |   .0747342    .013863     5.39   0.000     .0475593    .1019092
          2  |   .2125926   .0141895    14.98   0.000     .1847776    .2404076
             |
  1.dregular |   .2381728   .0187298    12.72   0.000     .2014579    .2748878
   emptenure |   .0089695   .0048432     1.85   0.064    -.0005244    .0184633
             |
 c.emptenure#|
 c.emptenure |   .0001769   .0002932     0.60   0.546    -.0003979    .0007517
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure |  -5.08e-06   4.78e-06    -1.06   0.289    -.0000145    4.30e-06
             |
          oj |   .0985683   .0305997     3.22   0.001     .0385853    .1585512
     workexp |   .0027093    .007451     0.36   0.716    -.0118965    .0173151
             |
   c.workexp#|
   c.workexp |   .0004894   .0003152     1.55   0.120    -.0001283    .0011072
             |
   c.workexp#|
   c.workexp#|
   c.workexp |  -.0000113   4.08e-06    -2.77   0.006    -.0000193   -3.32e-06
             |
   occtenure |    .005875   .0031873     1.84   0.065    -.0003728    .0121228
             |
 c.occtenure#|
 c.occtenure |   -.000314   .0002062    -1.52   0.128    -.0007182    .0000901
             |
 c.occtenure#|
 c.occtenure#|
 c.occtenure |   4.48e-06   3.41e-06     1.31   0.190    -2.22e-06    .0000112
             |
       _cons |   6.257587   .1055385    59.29   0.000     6.050706    6.464469
------------------------------------------------------------------------------
/* OLS empocc 4th order */

Linear regression                               Number of obs     =      8,463
                                                F(59, 8403)       =      77.76
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3332
                                                Root MSE          =     .46107

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         occ |
          2  |    .056863   .4401328     0.13   0.897    -.8059056    .9196317
          3  |  -.2562472    .369783    -0.69   0.488    -.9811129    .4686185
          4  |  -.3406812   .3715034    -0.92   0.359    -1.068919     .387557
          5  |   .0523036   .3712429     0.14   0.888    -.6754239    .7800311
          6  |  -.1797998   .3710933    -0.48   0.628    -.9072341    .5476346
          7  |  -.3128062   .3715801    -0.84   0.400    -1.041195    .4155824
          8  |  -.2592304   .3711651    -0.70   0.485    -.9868054    .4683446
          9  |  -.1384494   .3716286    -0.37   0.709    -.8669329    .5900341
         10  |    -.10708   .3713095    -0.29   0.773    -.8349381    .6207781
         11  |  -.4018767   .3721163    -1.08   0.280    -1.131316    .3275629
         12  |  -.2002604    .378112    -0.53   0.596    -.9414531    .5409322
             |
         ind |
          2  |   .0443844   .2340386     0.19   0.850    -.4143889    .5031576
          3  |   .4014353   .4013718     1.00   0.317    -.3853524    1.188223
          4  |   .4045076   .3803844     1.06   0.288    -.3411395    1.150155
          5  |   .4632332   .3804443     1.22   0.223    -.2825312    1.208998
          6  |   .4013743   .3794097     1.06   0.290    -.3423622    1.145111
          7  |   .3864612   .3824534     1.01   0.312    -.3632416    1.136164
          8  |   .4609356   .3811011     1.21   0.227    -.2861164    1.207988
          9  |   .5310372   .3833485     1.39   0.166    -.2204203    1.282495
         10  |   .3654962   .3807786     0.96   0.337    -.3809236    1.111916
         11  |   .4868513   .3811008     1.28   0.201    -.2602002    1.233903
         12  |   .5494702   .3812344     1.44   0.150    -.1978431    1.296784
         13  |   .5258978   .3819065     1.38   0.169    -.2227329    1.274529
         14  |   .3537798    .380816     0.93   0.353    -.3927134    1.100273
         15  |   .4930938   .3817004     1.29   0.196    -.2551331    1.241321
         16  |   .4266006   .3802667     1.12   0.262    -.3188158    1.172017
         17  |   .3443586   .3970212     0.87   0.386    -.4339008    1.122618
         18  |   .4431757   .3860865     1.15   0.251    -.3136489         1.2
             |
    1.dunion |   .0444792   .0125996     3.53   0.000     .0197808    .0691775
  1.dmarital |   .1576419    .014621    10.78   0.000     .1289811    .1863026
             |
        year |
       2005  |   .1137288   .0290479     3.92   0.000     .0567878    .1706699
       2006  |   .0966575   .0285551     3.38   0.001     .0406824    .1526326
       2007  |   .0724096   .0258154     2.80   0.005     .0218051    .1230142
       2008  |   .0667275   .0259214     2.57   0.010     .0159151      .11754
       2009  |   .0959729    .023302     4.12   0.000     .0502953    .1416505
       2010  |   .0664854   .0240325     2.77   0.006     .0193758     .113595
       2011  |   .0753562   .0234489     3.21   0.001     .0293905    .1213219
       2012  |   .0695041   .0235654     2.95   0.003     .0233102    .1156981
       2013  |   .0624523   .0248114     2.52   0.012     .0138159    .1110887
       2014  |   .0978436   .0247525     3.95   0.000     .0493226    .1463646
             |
   schooling |
         12  |   .0804227   .0274358     2.93   0.003     .0266418    .1342037
         14  |   .0791028   .0314424     2.52   0.012      .017468    .1407376
         16  |   .2030654   .0297558     6.82   0.000     .1447368     .261394
             |
       dsize |
          1  |   .0741624    .013864     5.35   0.000     .0469856    .1013393
          2  |   .2136554   .0141779    15.07   0.000     .1858632    .2414476
             |
  1.dregular |   .2326812   .0188707    12.33   0.000     .1956901    .2696724
   emptenure |    .008019    .009019     0.89   0.374    -.0096604    .0256985
             |
 c.emptenure#|
 c.emptenure |   .0002675   .0008815     0.30   0.762    -.0014604    .0019954
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure |  -4.40e-06   .0000312    -0.14   0.888    -.0000655    .0000567
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure#|
 c.emptenure |  -6.70e-08   3.64e-07    -0.18   0.854    -7.81e-07    6.47e-07
             |
          oj |   .0928924   .0342239     2.71   0.007     .0258051    .1599796
     workexp |   .0363831   .0159978     2.27   0.023     .0050235    .0677427
             |
   c.workexp#|
   c.workexp |  -.0020479   .0011338    -1.81   0.071    -.0042704    .0001746
             |
   c.workexp#|
   c.workexp#|
   c.workexp |   .0000624   .0000324     1.93   0.054    -1.03e-06    .0001259
             |
   c.workexp#|
   c.workexp#|
   c.workexp#|
   c.workexp |  -7.26e-07   3.20e-07    -2.27   0.023    -1.35e-06   -9.96e-08
             |
   occtenure |   .0138225    .004998     2.77   0.006     .0040253    .0236197
             |
 c.occtenure#|
 c.occtenure |  -.0012022   .0004631    -2.60   0.009      -.00211   -.0002943
             |
 c.occtenure#|
 c.occtenure#|
 c.occtenure |   .0000328   .0000132     2.49   0.013     6.92e-06    .0000586
             |
 c.occtenure#|
 c.occtenure#|
 c.occtenure#|
 c.occtenure |  -2.60e-07   1.08e-07    -2.41   0.016    -4.71e-07   -4.86e-08
             |
       _cons |   6.116109   .1161502    52.66   0.000     5.888426    6.343792
------------------------------------------------------------------------------
. 
. ** AS
. foreach ten_i of local isIncOcc{
  2.         forvalues poly_x=1/4{
  3.                 qui {
  4.                         do "$Code\ReadData.do"
  5.                         do "$Code\ConstructIV.do"
  6.                         ivregress 2sls ///
>                                                 `commonVar' ///
>                                                 (``ten_i'`poly_x'' = ``ten_i'iv
> `poly_x'') ///
>                                                 , vce(r)
  7.                         est sto isv`ten_i'`poly_x'
  8.                         drop if _est_isv`ten_i'`poly_x'==0
  9.                         drop *iv *iv? avg*
 10.                         **** re-build iv
.                         do "$Code\ConstructIV.do"
 11.                 }
 12.                 dis "/* AS's IV `ten_i' `poly_x'th order */"
 13.                 ivregress 2sls ///
>                                 `commonVar' ///
>                                 (``ten_i'`poly_x'' = ``ten_i'iv`poly_x'') ///
>                                 , vce(r)
 14.                 est sto isv`ten_i'`poly_x'
 15.         }
 16. }
/* AS's IV emp 1th order */

Instrumental variables (2SLS) regression          Number of obs   =      8,601
                                                  Wald chi2(49)   =    3635.96
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.3030
                                                  Root MSE        =     .47029

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   emptenure |   .0006421   .0033094     0.19   0.846    -.0058441    .0071283
          oj |   .0563925   .0418876     1.35   0.178    -.0257056    .1384907
     workexp |   .0038953   .0036571     1.07   0.287    -.0032724     .011063
             |
         occ |
          2  |   .0796099   .4031722     0.20   0.843    -.7105932    .8698129
          3  |  -.1961627   .3704486    -0.53   0.596    -.9222287    .5299032
          4  |  -.3027344   .3709827    -0.82   0.414    -1.029847    .4243783
          5  |   .1846688   .3709903     0.50   0.619    -.5424588    .9117963
          6  |  -.1006417   .3710275    -0.27   0.786    -.8278422    .6265588
          7  |  -.2898244   .3709536    -0.78   0.435     -1.01688    .4372313
          8  |  -.1976278   .3715008    -0.53   0.595    -.9257559    .5305004
          9  |  -.0828768   .3727799    -0.22   0.824     -.813512    .6477584
         10  |  -.0420605   .3720607    -0.11   0.910    -.7712862    .6871651
         11  |  -.3874696   .3708845    -1.04   0.296     -1.11439    .3394507
         12  |  -.1497142   .3776739    -0.40   0.692    -.8899414     .590513
             |
         ind |
          2  |   .0663642   .2555751     0.26   0.795    -.4345537    .5672821
          3  |   .2921578   .4054458     0.72   0.471    -.5025014    1.086817
          4  |   .3570282   .3822382     0.93   0.350     -.392145    1.106201
          5  |   .4346487   .3821934     1.14   0.255    -.3144365    1.183734
          6  |   .3732678   .3811044     0.98   0.327    -.3736832    1.120219
          7  |    .324067   .3837062     0.84   0.398    -.4279834    1.076117
          8  |   .4014473   .3828526     1.05   0.294    -.3489301    1.151825
          9  |   .4699004   .3872896     1.21   0.225    -.2891733    1.228974
         10  |    .331981   .3824329     0.87   0.385    -.4175737    1.081536
         11  |   .4571558   .3826765     1.19   0.232    -.2928765    1.207188
         12  |   .4955664   .3832924     1.29   0.196     -.255673    1.246806
         13  |   .4528917   .3840834     1.18   0.238     -.299898    1.205681
         14  |   .2910897   .3824433     0.76   0.447    -.4584853    1.040665
         15  |   .4469821   .3837121     1.16   0.244    -.3050799    1.199044
         16  |   .3591144   .3826842     0.94   0.348    -.3909329    1.109162
         17  |   .2807836   .4016239     0.70   0.484    -.5063849    1.067952
         18  |   .3629518   .3888206     0.93   0.351    -.3991226    1.125026
             |
    1.dunion |   .0585641   .0164995     3.55   0.000     .0262257    .0909024
  1.dmarital |   .1889823   .0203659     9.28   0.000     .1490658    .2288987
             |
        year |
       2005  |    .106335   .0299198     3.55   0.000     .0476933    .1649767
       2006  |   .0941883   .0290273     3.24   0.001     .0372959    .1510807
       2007  |   .0740973   .0265465     2.79   0.005      .022067    .1261275
       2008  |   .0650714   .0274375     2.37   0.018      .011295    .1188478
       2009  |   .0989574   .0244797     4.04   0.000     .0509781    .1469367
       2010  |   .0654043   .0251354     2.60   0.009     .0161398    .1146688
       2011  |   .0838353   .0247637     3.39   0.001     .0352994    .1323712
       2012  |    .080966   .0251366     3.22   0.001     .0316992    .1302328
       2013  |   .0778328   .0268613     2.90   0.004     .0251855      .13048
       2014  |   .1143558   .0270109     4.23   0.000     .0614155    .1672961
             |
   schooling |
         12  |   .1072558    .037814     2.84   0.005     .0331416    .1813699
         14  |   .0936099   .0504812     1.85   0.064    -.0053314    .1925512
         16  |   .2063672   .0520345     3.97   0.000     .1043814     .308353
             |
       dsize |
          1  |   .1011715   .0172074     5.88   0.000     .0674455    .1348974
          2  |   .2589553   .0222363    11.65   0.000     .2153731    .3025376
             |
  1.dregular |   .3436371     .04131     8.32   0.000     .2626709    .4246032
       _cons |   6.303748   .1837263    34.31   0.000     5.943651    6.663844
------------------------------------------------------------------------------
Instrumented:  emptenure oj workexp
Instruments:   2.occ 3.occ 4.occ 5.occ 6.occ 7.occ 8.occ 9.occ 10.occ 11.occ
               12.occ 2.ind 3.ind 4.ind 5.ind 6.ind 7.ind 8.ind 9.ind 10.ind
               11.ind 12.ind 13.ind 14.ind 15.ind 16.ind 17.ind 18.ind
               1.dunion 1.dmarital 2005.year 2006.year 2007.year 2008.year
               2009.year 2010.year 2011.year 2012.year 2013.year 2014.year
               12.schooling 14.schooling 16.schooling 1.dsize 2.dsize
               1.dregular emptenureiv ojiv workexpiv
/* AS's IV emp 2th order */

Instrumental variables (2SLS) regression          Number of obs   =      8,601
                                                  Wald chi2(51)   =    3711.17
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.3100
                                                  Root MSE        =     .46791

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   emptenure |   .0029139   .0056507     0.52   0.606    -.0081613    .0139891
             |
 c.emptenure#|
 c.emptenure |  -.0000686   .0001497    -0.46   0.647     -.000362    .0002249
             |
          oj |   .0530937   .0437399     1.21   0.225    -.0326349    .1388224
     workexp |   .0428357   .0078788     5.44   0.000     .0273936    .0582778
             |
   c.workexp#|
   c.workexp |  -.0007302   .0001471    -4.97   0.000    -.0010185    -.000442
             |
         occ |
          2  |   .0680149   .4271334     0.16   0.873    -.7691513     .905181
          3  |  -.2695536   .3452812    -0.78   0.435    -.9462924    .4071851
          4  |  -.3641721   .3456216    -1.05   0.292    -1.041578    .3132338
          5  |   .0881589   .3462577     0.25   0.799    -.5904936    .7668115
          6  |  -.1795078    .345879    -0.52   0.604    -.8574182    .4984025
          7  |  -.3608194   .3456267    -1.04   0.297    -1.038235    .3165964
          8  |   -.277997   .3462607    -0.80   0.422    -.9566555    .4006615
          9  |  -.1518413   .3475567    -0.44   0.662    -.8330399    .5293572
         10  |  -.1101733   .3467946    -0.32   0.751    -.7898783    .5695317
         11  |  -.4470174   .3453968    -1.29   0.196    -1.123983     .229948
         12  |  -.2399108   .3531759    -0.68   0.497    -.9321228    .4523012
             |
         ind |
          2  |   .0755778   .2352475     0.32   0.748    -.3854989    .5366545
          3  |   .2831513   .3845532     0.74   0.462    -.4705592    1.036862
          4  |   .3953976   .3586377     1.10   0.270    -.3075194    1.098315
          5  |   .4610369   .3586769     1.29   0.199     -.241957    1.164031
          6  |   .4009811   .3576212     1.12   0.262    -.2999436    1.101906
          7  |   .3534606   .3603719     0.98   0.327    -.3528554    1.059777
          8  |   .4343117   .3593308     1.21   0.227    -.2699637    1.138587
          9  |   .4926244   .3638713     1.35   0.176    -.2205503    1.205799
         10  |    .350994   .3587899     0.98   0.328    -.3522213    1.054209
         11  |   .4844305    .359232     1.35   0.177    -.2196513    1.188512
         12  |   .5347352   .3599072     1.49   0.137    -.1706699     1.24014
         13  |   .5154207   .3607585     1.43   0.153    -.1916531    1.222494
         14  |   .3244008   .3588519     0.90   0.366    -.3789361    1.027738
         15  |   .4863529   .3603817     1.35   0.177    -.2199823    1.192688
         16  |   .3922978   .3590473     1.09   0.275    -.3114219    1.096018
         17  |   .3495315   .3771395     0.93   0.354    -.3896482    1.088711
         18  |   .4020524   .3656789     1.10   0.272    -.3146651     1.11877
             |
    1.dunion |   .0725972   .0165388     4.39   0.000     .0401817    .1050126
  1.dmarital |   .1439843    .021235     6.78   0.000     .1023645    .1856042
             |
        year |
       2005  |   .0999476   .0296438     3.37   0.001     .0418468    .1580484
       2006  |   .0795083   .0288446     2.76   0.006     .0229739    .1360426
       2007  |   .0637559    .026203     2.43   0.015     .0123989    .1151128
       2008  |   .0521905   .0270364     1.93   0.054    -.0007999    .1051808
       2009  |   .0885898   .0241837     3.66   0.000     .0411906    .1359891
       2010  |   .0515885   .0249532     2.07   0.039     .0026811    .1004959
       2011  |   .0660608   .0246767     2.68   0.007     .0176954    .1144262
       2012  |   .0653999   .0250121     2.61   0.009     .0163771    .1144227
       2013  |   .0563298   .0269289     2.09   0.036     .0035502    .1091095
       2014  |   .0954906   .0267883     3.56   0.000     .0429865    .1479947
             |
   schooling |
         12  |   .0438457   .0407593     1.08   0.282     -.036041    .1237324
         14  |   .0426358   .0519981     0.82   0.412    -.0592785    .1445502
         16  |    .154409   .0534838     2.89   0.004     .0495827    .2592353
             |
       dsize |
          1  |   .1092483   .0171129     6.38   0.000     .0757077    .1427889
          2  |   .2628108   .0225408    11.66   0.000     .2186317    .3069898
             |
  1.dregular |   .2859716   .0443132     6.45   0.000     .1991192     .372824
       _cons |   6.059518   .1864188    32.50   0.000     5.694144    6.424892
------------------------------------------------------------------------------
Instrumented:  emptenure c.emptenure#c.emptenure oj workexp
               c.workexp#c.workexp
Instruments:   2.occ 3.occ 4.occ 5.occ 6.occ 7.occ 8.occ 9.occ 10.occ 11.occ
               12.occ 2.ind 3.ind 4.ind 5.ind 6.ind 7.ind 8.ind 9.ind 10.ind
               11.ind 12.ind 13.ind 14.ind 15.ind 16.ind 17.ind 18.ind
               1.dunion 1.dmarital 2005.year 2006.year 2007.year 2008.year
               2009.year 2010.year 2011.year 2012.year 2013.year 2014.year
               12.schooling 14.schooling 16.schooling 1.dsize 2.dsize
               1.dregular emptenureiv emptenureiv2 ojiv workexpiv workexpiv2
/* AS's IV emp 3th order */

Instrumental variables (2SLS) regression          Number of obs   =      8,601
                                                  Wald chi2(53)   =    3721.65
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.3095
                                                  Root MSE        =     .46808

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   emptenure |   .0038207   .0091322     0.42   0.676    -.0140781    .0217195
             |
 c.emptenure#|
 c.emptenure |    -.00012   .0005832    -0.21   0.837    -.0012631    .0010231
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure |   2.56e-07   9.66e-06     0.03   0.979    -.0000187    .0000192
             |
          oj |   .0561437   .0450681     1.25   0.213    -.0321881    .1444756
     workexp |   .0142881   .0160101     0.89   0.372     -.017091    .0456673
             |
   c.workexp#|
   c.workexp |   .0005729   .0006865     0.83   0.404    -.0007727    .0019184
             |
   c.workexp#|
   c.workexp#|
   c.workexp |  -.0000169   8.97e-06    -1.89   0.059    -.0000345    6.44e-07
             |
         occ |
          2  |   .1007154   .4262679     0.24   0.813    -.7347542    .9361851
          3  |  -.2679007     .34049    -0.79   0.431    -.9352489    .3994475
          4  |  -.3662603   .3410028    -1.07   0.283    -1.034614    .3020929
          5  |   .0857085   .3409754     0.25   0.802     -.582591     .754008
          6  |  -.1795778   .3408737    -0.53   0.598     -.847678    .4885225
          7  |  -.3626045   .3411145    -1.06   0.288    -1.031177    .3059676
          8  |  -.2800989   .3414553    -0.82   0.412    -.9493389    .3891411
          9  |  -.1470529   .3427012    -0.43   0.668    -.8187349    .5246291
         10  |   -.110185   .3418486    -0.32   0.747    -.7801959    .5598258
         11  |   -.456913   .3414427    -1.34   0.181    -1.126128    .2123024
         12  |  -.2406755   .3481191    -0.69   0.489    -.9229764    .4416254
             |
         ind |
          2  |   .0948154   .2364527     0.40   0.688    -.3686234    .5582542
          3  |   .2944164   .3818246     0.77   0.441    -.4539462    1.042779
          4  |   .4079079   .3542971     1.15   0.250    -.2865016    1.102317
          5  |   .4745427   .3545599     1.34   0.181    -.2203819    1.169467
          6  |   .4134677   .3535498     1.17   0.242    -.2794773    1.106413
          7  |   .3646022   .3561633     1.02   0.306     -.333465    1.062669
          8  |   .4459831   .3551117     1.26   0.209    -.2500231    1.141989
          9  |   .4964387   .3588744     1.38   0.167    -.2069422     1.19982
         10  |    .365046   .3546635     1.03   0.303    -.3300816    1.060174
         11  |   .4970901   .3550792     1.40   0.162    -.1988524    1.193033
         12  |    .547739   .3555899     1.54   0.123    -.1492044    1.244683
         13  |   .5274847   .3565606     1.48   0.139    -.1713612    1.226331
         14  |   .3362484   .3544584     0.95   0.343    -.3584773    1.030974
         15  |   .4961049    .356048     1.39   0.164    -.2017363    1.193946
         16  |    .402723   .3545615     1.14   0.256    -.2922047    1.097651
         17  |   .3638447   .3726826     0.98   0.329    -.3665998    1.094289
         18  |   .4133155   .3610224     1.14   0.252    -.2942754    1.120906
             |
    1.dunion |   .0726721   .0167395     4.34   0.000     .0398633    .1054808
  1.dmarital |   .1540302   .0216543     7.11   0.000     .1115885    .1964719
             |
        year |
       2005  |   .1022129   .0297022     3.44   0.001     .0439978    .1604281
       2006  |   .0821702   .0289513     2.84   0.005     .0254267    .1389137
       2007  |   .0665578   .0262837     2.53   0.011     .0150426    .1180729
       2008  |   .0547602   .0271788     2.01   0.044     .0014906    .1080297
       2009  |   .0912323   .0242774     3.76   0.000     .0436495    .1388151
       2010  |   .0551258   .0250576     2.20   0.028     .0060138    .1042378
       2011  |   .0706797   .0248184     2.85   0.004     .0220365    .1193229
       2012  |   .0704161   .0251714     2.80   0.005     .0210811    .1197511
       2013  |   .0604206   .0271134     2.23   0.026     .0072793    .1135618
       2014  |   .0994762   .0269845     3.69   0.000     .0465876    .1523648
             |
   schooling |
         12  |   .0400443   .0408463     0.98   0.327     -.040013    .1201017
         14  |   .0361396   .0521079     0.69   0.488      -.06599    .1382692
         16  |   .1461923   .0537083     2.72   0.006      .040926    .2514587
             |
       dsize |
          1  |    .111703   .0175184     6.38   0.000     .0773675    .1460385
          2  |   .2666215   .0235285    11.33   0.000     .2205065    .3127365
             |
  1.dregular |   .2865746   .0448756     6.39   0.000       .19862    .3745291
       _cons |   6.198477   .1944733    31.87   0.000     5.817317    6.579638
------------------------------------------------------------------------------
Instrumented:  emptenure c.emptenure#c.emptenure
               c.emptenure#c.emptenure#c.emptenure oj workexp
               c.workexp#c.workexp c.workexp#c.workexp#c.workexp
Instruments:   2.occ 3.occ 4.occ 5.occ 6.occ 7.occ 8.occ 9.occ 10.occ 11.occ
               12.occ 2.ind 3.ind 4.ind 5.ind 6.ind 7.ind 8.ind 9.ind 10.ind
               11.ind 12.ind 13.ind 14.ind 15.ind 16.ind 17.ind 18.ind
               1.dunion 1.dmarital 2005.year 2006.year 2007.year 2008.year
               2009.year 2010.year 2011.year 2012.year 2013.year 2014.year
               12.schooling 14.schooling 16.schooling 1.dsize 2.dsize
               1.dregular emptenureiv emptenureiv2 emptenureiv3 ojiv
               workexpiv workexpiv2 workexpiv3
/* AS's IV emp 4th order */

Instrumental variables (2SLS) regression          Number of obs   =      8,601
                                                  Wald chi2(55)   =    3730.07
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.3114
                                                  Root MSE        =     .46745

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   emptenure |   .0107938   .0142124     0.76   0.448    -.0170619    .0386495
             |
 c.emptenure#|
 c.emptenure |  -.0010163   .0014887    -0.68   0.495     -.003934    .0019015
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure |   .0000379   .0000566     0.67   0.503     -.000073    .0001488
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure#|
 c.emptenure |  -4.82e-07   6.87e-07    -0.70   0.483    -1.83e-06    8.65e-07
             |
          oj |   .0450504   .0482297     0.93   0.350     -.049478    .1395789
     workexp |   .0501309   .0279507     1.79   0.073    -.0046514    .1049131
             |
   c.workexp#|
   c.workexp |  -.0021979   .0020423    -1.08   0.282    -.0062007    .0018049
             |
   c.workexp#|
   c.workexp#|
   c.workexp |   .0000636    .000059     1.08   0.281     -.000052    .0001792
             |
   c.workexp#|
   c.workexp#|
   c.workexp#|
   c.workexp |  -7.86e-07   5.84e-07    -1.35   0.179    -1.93e-06    3.59e-07
             |
         occ |
          2  |   .1425069   .4314254     0.33   0.741    -.7030715    .9880852
          3  |  -.2474505   .3397314    -0.73   0.466    -.9133117    .4184107
          4  |  -.3443307   .3403772    -1.01   0.312    -1.011458    .3227965
          5  |   .1063006   .3402534     0.31   0.755    -.5605839     .773185
          6  |  -.1584378   .3401753    -0.47   0.641    -.8251692    .5082935
          7  |  -.3411289   .3405302    -1.00   0.316    -1.008556     .326298
          8  |  -.2603872   .3407267    -0.76   0.445    -.9281992    .4074247
          9  |  -.1260398   .3419328    -0.37   0.712    -.7962158    .5441362
         10  |  -.0894391    .341094    -0.26   0.793     -.757971    .5790929
         11  |  -.4349349   .3410555    -1.28   0.202    -1.103392    .2335216
         12  |  -.2189801   .3474301    -0.63   0.529    -.8999306    .4619704
             |
         ind |
          2  |   .0831037   .2366899     0.35   0.726       -.3808    .5470073
          3  |   .2753865   .3814728     0.72   0.470    -.4722865    1.023059
          4  |   .3858769   .3539624     1.09   0.276    -.3078767     1.07963
          5  |   .4540569   .3543813     1.28   0.200    -.2405177    1.148631
          6  |   .3914591   .3534017     1.11   0.268    -.3011955    1.084114
          7  |   .3429884   .3560459     0.96   0.335    -.3548488    1.040826
          8  |   .4243055   .3548895     1.20   0.232    -.2712652    1.119876
          9  |   .4735542   .3585439     1.32   0.187     -.229179    1.176287
         10  |   .3423009   .3544803     0.97   0.334    -.3524678    1.037069
         11  |   .4761271   .3549094     1.34   0.180    -.2194827    1.171737
         12  |   .5225211   .3554683     1.47   0.142     -.174184    1.219226
         13  |   .5045609   .3562365     1.42   0.157    -.1936497    1.202772
         14  |   .3150995   .3540949     0.89   0.374    -.3789137    1.009113
         15  |   .4724418   .3559033     1.33   0.184    -.2251159    1.169999
         16  |   .3804283   .3541886     1.07   0.283    -.3137687    1.074625
         17  |   .3381173   .3725224     0.91   0.364    -.3920131    1.068248
         18  |   .3890314   .3605945     1.08   0.281    -.3177209    1.095784
             |
    1.dunion |   .0698864   .0169369     4.13   0.000     .0366907     .103082
  1.dmarital |    .153647   .0216117     7.11   0.000     .1112888    .1960052
             |
        year |
       2005  |    .100427   .0296199     3.39   0.001     .0423731     .158481
       2006  |   .0812607   .0288666     2.82   0.005     .0246832    .1378382
       2007  |   .0665315   .0262308     2.54   0.011       .01512    .1179429
       2008  |   .0536765   .0271811     1.97   0.048     .0004026    .1069504
       2009  |   .0910844   .0242135     3.76   0.000     .0436269    .1385419
       2010  |   .0552655   .0249996     2.21   0.027     .0062671    .1042638
       2011  |   .0702085   .0247327     2.84   0.005     .0217334    .1186837
       2012  |   .0702585   .0251136     2.80   0.005     .0210369    .1194802
       2013  |    .060599   .0270405     2.24   0.025     .0076006    .1135975
       2014  |   .0998145   .0269253     3.71   0.000     .0470419    .1525871
             |
   schooling |
         12  |   .0427606   .0406127     1.05   0.292    -.0368389    .1223601
         14  |   .0376508   .0518489     0.73   0.468    -.0639712    .1392728
         16  |   .1474174   .0534693     2.76   0.006     .0426195    .2522154
             |
       dsize |
          1  |   .1110487   .0175231     6.34   0.000      .076704    .1453933
          2  |   .2664646   .0235009    11.34   0.000     .2204037    .3125254
             |
  1.dregular |   .2838784   .0450381     6.30   0.000     .1956053    .3721514
       _cons |   6.068862   .2041456    29.73   0.000     5.668744     6.46898
------------------------------------------------------------------------------
Instrumented:  emptenure c.emptenure#c.emptenure
               c.emptenure#c.emptenure#c.emptenure
               c.emptenure#c.emptenure#c.emptenure#c.emptenure oj workexp
               c.workexp#c.workexp c.workexp#c.workexp#c.workexp
               c.workexp#c.workexp#c.workexp#c.workexp
Instruments:   2.occ 3.occ 4.occ 5.occ 6.occ 7.occ 8.occ 9.occ 10.occ 11.occ
               12.occ 2.ind 3.ind 4.ind 5.ind 6.ind 7.ind 8.ind 9.ind 10.ind
               11.ind 12.ind 13.ind 14.ind 15.ind 16.ind 17.ind 18.ind
               1.dunion 1.dmarital 2005.year 2006.year 2007.year 2008.year
               2009.year 2010.year 2011.year 2012.year 2013.year 2014.year
               12.schooling 14.schooling 16.schooling 1.dsize 2.dsize
               1.dregular emptenureiv emptenureiv2 emptenureiv3 emptenureiv4
               ojiv workexpiv workexpiv2 workexpiv3 workexpiv4
/* AS's IV empocc 1th order */

Instrumental variables (2SLS) regression          Number of obs   =      8,463
                                                  Wald chi2(50)   =    3504.45
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.2994
                                                  Root MSE        =     .47094

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   emptenure |   .0007174   .0033238     0.22   0.829    -.0057972    .0072319
          oj |   .0567342   .0422411     1.34   0.179    -.0260568    .1395253
     workexp |   .0039789   .0038445     1.03   0.301    -.0035562    .0115139
   occtenure |  -.0003877   .0017802    -0.22   0.828    -.0038768    .0031013
             |
         occ |
          2  |   .0801668   .4003576     0.20   0.841    -.7045196    .8648533
          3  |  -.1953843   .3696149    -0.53   0.597    -.9198163    .5290476
          4  |  -.3030386   .3703208    -0.82   0.413    -1.028854    .4227768
          5  |   .1830269   .3699305     0.49   0.621    -.5420234    .9080773
          6  |  -.1026572   .3700748    -0.28   0.781    -.8279905     .622676
          7  |  -.2889387   .3700196    -0.78   0.435    -1.014164    .4362864
          8  |  -.1976889   .3706276    -0.53   0.594    -.9241057    .5287279
          9  |  -.0844586   .3720023    -0.23   0.820    -.8135696    .6446525
         10  |  -.0422284   .3712327    -0.11   0.909     -.769831    .6853742
         11  |  -.3887253   .3697206    -1.05   0.293    -1.113364    .3359138
         12  |  -.1467526   .3773523    -0.39   0.697    -.8863496    .5928444
             |
         ind |
          2  |   .0686358   .2560876     0.27   0.789    -.4332867    .5705582
          3  |   .2925329   .4043056     0.72   0.469    -.4998916    1.084957
          4  |   .3561922   .3810143     0.93   0.350    -.3905822    1.102966
          5  |   .4373133   .3810274     1.15   0.251    -.3094866    1.184113
          6  |   .3791111   .3799549     1.00   0.318    -.3655868    1.123809
          7  |   .3345899   .3826946     0.87   0.382    -.4154777    1.084658
          8  |   .4092397    .381663     1.07   0.284    -.3388061    1.157285
          9  |   .4583482   .3864891     1.19   0.236    -.2991565    1.215853
         10  |   .3340843   .3812332     0.88   0.381    -.4131191    1.081288
         11  |   .4593798   .3815597     1.20   0.229    -.2884635    1.207223
         12  |   .4966952    .382099     1.30   0.194    -.2522051    1.245596
         13  |   .4530764   .3828244     1.18   0.237    -.2972457    1.203399
         14  |   .2952908   .3813051     0.77   0.439    -.4520534    1.042635
         15  |   .4471811   .3825654     1.17   0.242    -.3026334    1.196996
         16  |   .3622391   .3815346     0.95   0.342    -.3855548    1.110033
         17  |   .2828235    .400636     0.71   0.480    -.5024087    1.068056
         18  |   .3633213   .3877112     0.94   0.349    -.3965787    1.123221
             |
    1.dunion |   .0620612   .0168035     3.69   0.000     .0291269    .0949954
  1.dmarital |   .1971321   .0211236     9.33   0.000     .1557306    .2385336
             |
        year |
       2005  |   .1061618   .0308535     3.44   0.001     .0456901    .1666334
       2006  |   .0938158   .0308625     3.04   0.002     .0333264    .1543052
       2007  |   .0725352   .0272952     2.66   0.008     .0190376    .1260327
       2008  |    .062329   .0284503     2.19   0.028     .0065673    .1180906
       2009  |    .097139    .024883     3.90   0.000     .0483692    .1459087
       2010  |   .0672536   .0260333     2.58   0.010     .0162294    .1182778
       2011  |   .0830034    .025892     3.21   0.001      .032256    .1337507
       2012  |   .0776944   .0257961     3.01   0.003     .0271349    .1282539
       2013  |   .0757349   .0278593     2.72   0.007     .0211317    .1303382
       2014  |   .1104157   .0280688     3.93   0.000     .0554019    .1654295
             |
   schooling |
         12  |   .1070681   .0403259     2.66   0.008     .0280308    .1861054
         14  |   .0944526   .0535508     1.76   0.078    -.0105049    .1994101
         16  |   .2080379   .0563123     3.69   0.000     .0976678    .3184079
             |
       dsize |
          1  |   .0962101   .0172079     5.59   0.000     .0624832    .1299371
          2  |   .2568181   .0226365    11.35   0.000     .2124514    .3011849
             |
  1.dregular |   .3385488   .0425496     7.96   0.000      .255153    .4219445
       _cons |   6.302088   .1922815    32.78   0.000     5.925223    6.678952
------------------------------------------------------------------------------
Instrumented:  emptenure oj workexp occtenure
Instruments:   2.occ 3.occ 4.occ 5.occ 6.occ 7.occ 8.occ 9.occ 10.occ 11.occ
               12.occ 2.ind 3.ind 4.ind 5.ind 6.ind 7.ind 8.ind 9.ind 10.ind
               11.ind 12.ind 13.ind 14.ind 15.ind 16.ind 17.ind 18.ind
               1.dunion 1.dmarital 2005.year 2006.year 2007.year 2008.year
               2009.year 2010.year 2011.year 2012.year 2013.year 2014.year
               12.schooling 14.schooling 16.schooling 1.dsize 2.dsize
               1.dregular emptenureiv ojiv workexpiv occtenureiv
/* AS's IV empocc 2th order */

Instrumental variables (2SLS) regression          Number of obs   =      8,463
                                                  Wald chi2(53)   =    3572.04
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.3047
                                                  Root MSE        =     .46916

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   emptenure |   .0037253   .0060194     0.62   0.536    -.0080725    .0155232
             |
 c.emptenure#|
 c.emptenure |  -.0001091   .0001643    -0.66   0.507    -.0004311     .000213
             |
          oj |   .0556049   .0444595     1.25   0.211    -.0315342     .142744
     workexp |    .044572   .0081954     5.44   0.000     .0285093    .0606348
             |
   c.workexp#|
   c.workexp |  -.0007569   .0001499    -5.05   0.000    -.0010507   -.0004631
             |
   occtenure |  -.0053457   .0042519    -1.26   0.209    -.0136792    .0029879
             |
 c.occtenure#|
 c.occtenure |   .0001591   .0001367     1.16   0.245    -.0001089    .0004271
             |
         occ |
          2  |   .0790795   .4174315     0.19   0.850    -.7390711    .8972301
          3  |  -.2579752   .3445354    -0.75   0.454    -.9332521    .4173018
          4  |  -.3588463   .3451047    -1.04   0.298    -1.035239    .3175465
          5  |   .0926779   .3452947     0.27   0.788    -.5840873     .769443
          6  |  -.1724308   .3450356    -0.50   0.617    -.8486882    .5038266
          7  |   -.350255    .344922    -1.02   0.310     -1.02629    .3257796
          8  |  -.2678591   .3455453    -0.78   0.438    -.9451155    .4093973
          9  |  -.1411976   .3468793    -0.41   0.684    -.8210686    .5386734
         10  |  -.1033839   .3461143    -0.30   0.765    -.7817554    .5749875
         11  |  -.4421706   .3443797    -1.28   0.199    -1.117142    .2328013
         12  |  -.2352218   .3530315    -0.67   0.505    -.9271508    .4567073
             |
         ind |
          2  |   .0684732   .2375382     0.29   0.773    -.3970932    .5340396
          3  |    .271356    .383754     0.71   0.479    -.4807879      1.0235
          4  |   .3807121   .3576934     1.06   0.287     -.320354    1.081778
          5  |   .4498938   .3578598     1.26   0.209    -.2514985    1.151286
          6  |   .3912701   .3568498     1.10   0.273    -.3081427    1.090683
          7  |   .3509825    .359683     0.98   0.329    -.3539833    1.055948
          8  |   .4290164    .358417     1.20   0.231    -.2734679    1.131501
          9  |   .4615432   .3632135     1.27   0.204    -.2503422    1.173429
         10  |    .339225   .3578928     0.95   0.343    -.3622321    1.040682
         11  |   .4716196   .3584284     1.32   0.188    -.2308871    1.174126
         12  |   .5174486   .3591942     1.44   0.150    -.1865591    1.221456
         13  |   .5003527   .3598007     1.39   0.164    -.2048437    1.205549
         14  |   .3113225   .3579043     0.87   0.384    -.3901571    1.012802
         15  |   .4742116   .3595896     1.32   0.187     -.230571    1.178994
         16  |   .3805814    .358064     1.06   0.288     -.321211    1.082374
         17  |   .3366652    .376781     0.89   0.372    -.4018119    1.075142
         18  |   .3812646   .3649069     1.04   0.296    -.3339399    1.096469
             |
    1.dunion |   .0774361   .0172414     4.49   0.000     .0436435    .1112287
  1.dmarital |   .1539458    .021655     7.11   0.000     .1115028    .1963888
             |
        year |
       2005  |   .0947799   .0308998     3.07   0.002     .0342175    .1553423
       2006  |   .0724915   .0312381     2.32   0.020     .0112659    .1337171
       2007  |   .0570156   .0271574     2.10   0.036      .003788    .1102431
       2008  |   .0429173   .0283764     1.51   0.130    -.0126993    .0985339
       2009  |   .0847828   .0246976     3.43   0.001     .0363763    .1331893
       2010  |   .0479625   .0261942     1.83   0.067    -.0033771    .0993021
       2011  |   .0592985   .0261569     2.27   0.023     .0080318    .1105651
       2012  |   .0569873   .0259061     2.20   0.028     .0062124    .1077623
       2013  |   .0473439   .0282049     1.68   0.093    -.0079367    .1026246
       2014  |   .0849063   .0280975     3.02   0.003     .0298361    .1399764
             |
   schooling |
         12  |   .0458806    .042801     1.07   0.284    -.0380078    .1297689
         14  |   .0442039   .0547001     0.81   0.419    -.0630063     .151414
         16  |   .1576824   .0575186     2.74   0.006      .044948    .2704167
             |
       dsize |
          1  |   .1039258   .0171892     6.05   0.000     .0702357    .1376159
          2  |   .2607023    .023387    11.15   0.000     .2148645    .3065401
             |
  1.dregular |   .2855552   .0451361     6.33   0.000     .1970901    .3740203
       _cons |   6.052101   .1959412    30.89   0.000     5.668063    6.436139
------------------------------------------------------------------------------
Instrumented:  emptenure c.emptenure#c.emptenure oj workexp
               c.workexp#c.workexp occtenure c.occtenure#c.occtenure
Instruments:   2.occ 3.occ 4.occ 5.occ 6.occ 7.occ 8.occ 9.occ 10.occ 11.occ
               12.occ 2.ind 3.ind 4.ind 5.ind 6.ind 7.ind 8.ind 9.ind 10.ind
               11.ind 12.ind 13.ind 14.ind 15.ind 16.ind 17.ind 18.ind
               1.dunion 1.dmarital 2005.year 2006.year 2007.year 2008.year
               2009.year 2010.year 2011.year 2012.year 2013.year 2014.year
               12.schooling 14.schooling 16.schooling 1.dsize 2.dsize
               1.dregular emptenureiv emptenureiv2 ojiv workexpiv workexpiv2
               occtenureiv occtenureiv2
/* AS's IV empocc 3th order */

Instrumental variables (2SLS) regression          Number of obs   =      8,463
                                                  Wald chi2(56)   =    3527.34
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.2987
                                                  Root MSE        =     .47119

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   emptenure |   .0070542   .0099117     0.71   0.477    -.0123723    .0264808
             |
 c.emptenure#|
 c.emptenure |  -.0003029   .0006294    -0.48   0.630    -.0015366    .0009308
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure |   2.07e-06   .0000104     0.20   0.842    -.0000183    .0000225
             |
          oj |    .052248   .0461099     1.13   0.257    -.0381257    .1426217
     workexp |   .0163216   .0166744     0.98   0.328    -.0163596    .0490027
             |
   c.workexp#|
   c.workexp |   .0005637   .0007075     0.80   0.426     -.000823    .0019504
             |
   c.workexp#|
   c.workexp#|
   c.workexp |  -.0000174   9.21e-06    -1.89   0.058    -.0000355    6.10e-07
             |
   occtenure |   .0007245   .0070088     0.10   0.918    -.0130125    .0144615
             |
 c.occtenure#|
 c.occtenure |  -.0003816   .0005281    -0.72   0.470    -.0014167    .0006535
             |
 c.occtenure#|
 c.occtenure#|
 c.occtenure |   .0000105   9.93e-06     1.06   0.291    -8.97e-06    .0000299
             |
         occ |
          2  |   .0897485   .4174203     0.22   0.830    -.7283803    .9078773
          3  |  -.2878051   .3391529    -0.85   0.396    -.9525327    .3769224
          4  |  -.3891998   .3397706    -1.15   0.252    -1.055138    .2767384
          5  |   .0672433   .3392326     0.20   0.843    -.5976403     .732127
          6  |  -.1998353   .3393492    -0.59   0.556    -.8649475     .465277
          7  |  -.3866535    .339871    -1.14   0.255    -1.052788    .2794814
          8  |  -.3018901   .3401998    -0.89   0.375    -.9686694    .3648893
          9  |   -.169086   .3415312    -0.50   0.621    -.8384749    .5003029
         10  |  -.1325328    .340586    -0.39   0.697    -.8000691    .5350035
         11  |  -.4906898   .3402031    -1.44   0.149    -1.157476     .176096
         12  |  -.2625572   .3474262    -0.76   0.450       -.9435    .4183856
             |
         ind |
          2  |   .1160011   .2388784     0.49   0.627     -.352192    .5841942
          3  |   .3044921   .3806236     0.80   0.424    -.4415165    1.050501
          4  |   .4267184   .3530749     1.21   0.227    -.2652957    1.118733
          5  |   .5010447   .3536407     1.42   0.157    -.1920783    1.194168
          6  |   .4412158   .3525568     1.25   0.211    -.2497829    1.132215
          7  |   .3951223    .355091     1.11   0.266    -.3008433    1.091088
          8  |   .4773396   .3540288     1.35   0.178     -.216544    1.171223
          9  |   .4973245    .357984     1.39   0.165    -.2043112     1.19896
         10  |   .3899736   .3535697     1.10   0.270    -.3030103    1.082958
         11  |   .5207651   .3541201     1.47   0.141    -.1732975    1.214828
         12  |   .5664029   .3547073     1.60   0.110    -.1288106    1.261616
         13  |   .5471616   .3553142     1.54   0.124    -.1492414    1.243565
         14  |   .3565155   .3532425     1.01   0.313    -.3358271    1.048858
         15  |   .5182334   .3549621     1.46   0.144    -.1774795    1.213946
         16  |   .4263283   .3534405     1.21   0.228    -.2664024    1.119059
         17  |    .390562   .3725904     1.05   0.295    -.3397018    1.120826
         18  |    .425798   .3599767     1.18   0.237    -.2797433    1.131339
             |
    1.dunion |   .0792699   .0174378     4.55   0.000     .0450926    .1134473
  1.dmarital |    .164563   .0221934     7.41   0.000     .1210648    .2080613
             |
        year |
       2005  |   .0972826   .0311408     3.12   0.002     .0362477    .1583176
       2006  |   .0748086    .031544     2.37   0.018     .0129835    .1366337
       2007  |   .0593131   .0274638     2.16   0.031      .005485    .1131411
       2008  |   .0439099   .0288315     1.52   0.128    -.0125989    .1004187
       2009  |    .086603   .0249547     3.47   0.001     .0376926    .1355134
       2010  |    .050886   .0265596     1.92   0.055    -.0011699    .1029419
       2011  |   .0635378   .0265105     2.40   0.017     .0115783    .1154974
       2012  |   .0605415   .0262946     2.30   0.021     .0090051    .1120779
       2013  |   .0499314   .0286337     1.74   0.081    -.0061896    .1060525
       2014  |   .0853355   .0288003     2.96   0.003     .0288879    .1417831
             |
   schooling |
         12  |    .037833   .0431255     0.88   0.380    -.0466915    .1223575
         14  |   .0323531   .0553203     0.58   0.559    -.0760728    .1407789
         16  |   .1426035   .0583747     2.44   0.015     .0281912    .2570159
             |
       dsize |
          1  |     .10836   .0176143     6.15   0.000     .0738365    .1428834
          2  |   .2695724   .0245069    11.00   0.000     .2215398     .317605
             |
  1.dregular |   .2883737   .0461524     6.25   0.000     .1979166    .3788309
       _cons |   6.175046   .2059976    29.98   0.000     5.771298    6.578794
------------------------------------------------------------------------------
Instrumented:  emptenure c.emptenure#c.emptenure
               c.emptenure#c.emptenure#c.emptenure oj workexp
               c.workexp#c.workexp c.workexp#c.workexp#c.workexp occtenure
               c.occtenure#c.occtenure c.occtenure#c.occtenure#c.occtenure
Instruments:   2.occ 3.occ 4.occ 5.occ 6.occ 7.occ 8.occ 9.occ 10.occ 11.occ
               12.occ 2.ind 3.ind 4.ind 5.ind 6.ind 7.ind 8.ind 9.ind 10.ind
               11.ind 12.ind 13.ind 14.ind 15.ind 16.ind 17.ind 18.ind
               1.dunion 1.dmarital 2005.year 2006.year 2007.year 2008.year
               2009.year 2010.year 2011.year 2012.year 2013.year 2014.year
               12.schooling 14.schooling 16.schooling 1.dsize 2.dsize
               1.dregular emptenureiv emptenureiv2 emptenureiv3 ojiv
               workexpiv workexpiv2 workexpiv3 occtenureiv occtenureiv2
               occtenureiv3
/* AS's IV empocc 4th order */

Instrumental variables (2SLS) regression          Number of obs   =      8,463
                                                  Wald chi2(59)   =    3591.49
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.3013
                                                  Root MSE        =     .47032

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   emptenure |    .009709    .015395     0.63   0.528    -.0204647    .0398827
             |
 c.emptenure#|
 c.emptenure |  -.0005917   .0016601    -0.36   0.722    -.0038454    .0026619
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure |   .0000133   .0000656     0.20   0.839    -.0001152    .0001418
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure#|
 c.emptenure |  -1.42e-07   8.14e-07    -0.17   0.862    -1.74e-06    1.45e-06
             |
          oj |   .0471144   .0491828     0.96   0.338    -.0492821    .1435108
     workexp |   .0549337   .0294802     1.86   0.062    -.0028464    .1127138
             |
   c.workexp#|
   c.workexp |  -.0024695   .0021336    -1.16   0.247    -.0066512    .0017123
             |
   c.workexp#|
   c.workexp#|
   c.workexp |   .0000716   .0000613     1.17   0.243    -.0000486    .0001917
             |
   c.workexp#|
   c.workexp#|
   c.workexp#|
   c.workexp |  -8.75e-07   6.05e-07    -1.45   0.148    -2.06e-06    3.11e-07
             |
   occtenure |   .0023319   .0113342     0.21   0.837    -.0198827    .0245466
             |
 c.occtenure#|
 c.occtenure |  -.0007061   .0015944    -0.44   0.658    -.0038311    .0024189
             |
 c.occtenure#|
 c.occtenure#|
 c.occtenure |   .0000268   .0000672     0.40   0.690     -.000105    .0001586
             |
 c.occtenure#|
 c.occtenure#|
 c.occtenure#|
 c.occtenure |  -2.34e-07   8.49e-07    -0.28   0.783    -1.90e-06    1.43e-06
             |
         occ |
          2  |   .1300882   .4204042     0.31   0.757    -.6938889    .9540654
          3  |  -.2672158    .336025    -0.80   0.426    -.9258126    .3913811
          4  |  -.3688608   .3366638    -1.10   0.273     -1.02871    .2909882
          5  |   .0917761   .3367722     0.27   0.785    -.5682853    .7518375
          6  |  -.1783266   .3363932    -0.53   0.596    -.8376451     .480992
          7  |  -.3654974   .3368542    -1.09   0.278     -1.02572    .2947247
          8  |  -.2815792   .3370792    -0.84   0.404    -.9422423    .3790838
          9  |  -.1489112   .3383361    -0.44   0.660    -.8120377    .5142153
         10  |  -.1124172   .3373983    -0.33   0.739    -.7737058    .5488713
         11  |   -.470039   .3375127    -1.39   0.164    -1.131552    .1914737
         12  |   -.241259    .344368    -0.70   0.484    -.9162079      .43369
             |
         ind |
          2  |     .10839   .2381646     0.46   0.649    -.3584041     .575184
          3  |    .285804   .3783265     0.76   0.450    -.4557023     1.02731
          4  |   .4078795   .3503125     1.16   0.244    -.2787204    1.094479
          5  |   .4835448   .3510544     1.38   0.168    -.2045091    1.171599
          6  |   .4219435   .3500199     1.21   0.228    -.2640829     1.10797
          7  |   .3756365   .3526615     1.07   0.287    -.3155674     1.06684
          8  |   .4575157   .3514982     1.30   0.193    -.2314082     1.14644
          9  |   .4766217   .3555159     1.34   0.180    -.2201767     1.17342
         10  |   .3694372   .3510667     1.05   0.293    -.3186409    1.057515
         11  |   .5018063   .3515263     1.43   0.153    -.1871725    1.190785
         12  |   .5443368   .3522559     1.55   0.122     -.146072    1.234746
         13  |   .5262501   .3527218     1.49   0.136     -.165072    1.217572
         14  |   .3361886   .3505092     0.96   0.337    -.3507968    1.023174
         15  |   .4976998   .3524954     1.41   0.158    -.1931784    1.188578
         16  |   .4057306   .3507661     1.16   0.247    -.2817584     1.09322
         17  |   .3676234   .3704528     0.99   0.321    -.3584508    1.093698
         18  |   .4044361   .3572904     1.13   0.258    -.2958403    1.104712
             |
    1.dunion |   .0769192   .0177115     4.34   0.000     .0422052    .1116332
  1.dmarital |   .1650993   .0223162     7.40   0.000     .1213604    .2088381
             |
        year |
       2005  |   .0953701   .0310975     3.07   0.002     .0344201    .1563202
       2006  |   .0736747   .0315355     2.34   0.019     .0118662    .1354832
       2007  |   .0589255   .0274395     2.15   0.032     .0051449     .112706
       2008  |   .0428702   .0288942     1.48   0.138    -.0137613    .0995018
       2009  |    .086564   .0249146     3.47   0.001     .0377323    .1353956
       2010  |   .0510531   .0264659     1.93   0.054    -.0008192    .1029254
       2011  |   .0632477   .0264187     2.39   0.017      .011468    .1150275
       2012  |   .0610582   .0262565     2.33   0.020     .0095964    .1125201
       2013  |   .0506762   .0285912     1.77   0.076    -.0053614    .1067139
       2014  |   .0887144   .0300477     2.95   0.003      .029822    .1476068
             |
   schooling |
         12  |    .037998    .043187     0.88   0.379    -.0466469    .1226428
         14  |   .0301073   .0559352     0.54   0.590    -.0795236    .1397383
         16  |   .1396722   .0590914     2.36   0.018     .0238551    .2554893
             |
       dsize |
          1  |     .10748   .0174923     6.14   0.000     .0731957    .1417644
          2  |   .2699639   .0247127    10.92   0.000     .2215278    .3183999
             |
  1.dregular |   .2823831    .045793     6.17   0.000     .1926306    .3721357
       _cons |   6.043754   .2177852    27.75   0.000     5.616903    6.470605
------------------------------------------------------------------------------
Instrumented:  emptenure c.emptenure#c.emptenure
               c.emptenure#c.emptenure#c.emptenure
               c.emptenure#c.emptenure#c.emptenure#c.emptenure oj workexp
               c.workexp#c.workexp c.workexp#c.workexp#c.workexp
               c.workexp#c.workexp#c.workexp#c.workexp occtenure
               c.occtenure#c.occtenure c.occtenure#c.occtenure#c.occtenure
               c.occtenure#c.occtenure#c.occtenure#c.occtenure
Instruments:   2.occ 3.occ 4.occ 5.occ 6.occ 7.occ 8.occ 9.occ 10.occ 11.occ
               12.occ 2.ind 3.ind 4.ind 5.ind 6.ind 7.ind 8.ind 9.ind 10.ind
               11.ind 12.ind 13.ind 14.ind 15.ind 16.ind 17.ind 18.ind
               1.dunion 1.dmarital 2005.year 2006.year 2007.year 2008.year
               2009.year 2010.year 2011.year 2012.year 2013.year 2014.year
               12.schooling 14.schooling 16.schooling 1.dsize 2.dsize
               1.dregular emptenureiv emptenureiv2 emptenureiv3 emptenureiv4
               ojiv workexpiv workexpiv2 workexpiv3 workexpiv4 occtenureiv
               occtenureiv2 occtenureiv3 occtenureiv4
. 
. ** culc. return
. qui{
. 
. foreach ten_i of local isIncOcc{ /* loop within emp and empocc */
  2.         forvalues poly_x=1/4{ /* loop within ten_inomial */
  3.                 *** culculation
.                 dis "/* `ten_i' `poly_x'th order */"
  4.                 est res ols`ten_i'`poly_x'
  5.                 margins, exp(`culcemp`poly_x'') ///
>                 at(emptenure=(0(1)25)) noe post
  6.                 est sto ols`ten_i'r`poly_x'
  7.                 est res isv`ten_i'`poly_x'
  8.                 margins, exp(`culcemp`poly_x'') ///
>                 at(emptenure=(0(1)25)) noe post
  9.                 est sto isv`ten_i'r`poly_x'
 10.                 
.                 *** plot
.                 qui coefplot (ols`ten_i'r`poly_x', label(OLS)) (isv`ten_i'r`pol
> y_x', label(IV)), ///
>                 `comSetPlot'
 11.                 graph export "$Output\plot_as_`ten_i'_`poly_x'.pdf", replace
 12.         }
 13. }
/* emp 1th order */
(results olsemp1 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .1036268   .0252218     4.11   0.000      .054193    .1530606
          2  |   .1133085   .0250991     4.51   0.000     .0641152    .1625018
          3  |   .1229901   .0249904     4.92   0.000     .0740098    .1719705
          4  |   .1326718   .0248961     5.33   0.000     .0838764    .1814672
          5  |   .1423534   .0248161     5.74   0.000     .0937147    .1909922
          6  |   .1520351   .0247508     6.14   0.000     .1035245    .2005457
          7  |   .1617167   .0247001     6.55   0.000     .1133054     .210128
          8  |   .1713984   .0246642     6.95   0.000     .1230574    .2197393
          9  |     .18108   .0246431     7.35   0.000     .1327804    .2293797
         10  |   .1907617    .024637     7.74   0.000     .1424741    .2390492
         11  |   .2004433   .0246457     8.13   0.000     .1521387     .248748
         12  |    .210125   .0246693     8.52   0.000     .1617741    .2584759
         13  |   .2198066   .0247077     8.90   0.000     .1713804    .2682328
         14  |   .2294883   .0247609     9.27   0.000     .1809579    .2780187
         15  |   .2391699   .0248287     9.63   0.000     .1905065    .2878334
         16  |   .2488516   .0249111     9.99   0.000     .2000266    .2976765
         17  |   .2585332    .025008    10.34   0.000     .2095186    .3075479
         18  |   .2682149    .025119    10.68   0.000     .2189825    .3174472
         19  |   .2778965   .0252441    11.01   0.000      .228419    .3273741
         20  |   .2875782    .025383    11.33   0.000     .2378283     .337328
         21  |   .2972598   .0255356    11.64   0.000      .247211    .3473087
         22  |   .3069415   .0257015    11.94   0.000     .2565674    .3573156
         23  |   .3166231   .0258806    12.23   0.000     .2658981    .3673482
         24  |   .3263048   .0260725    12.52   0.000     .2752036    .3774059
         25  |   .3359864    .026277    12.79   0.000     .2844846    .3874883
         26  |   .3456681   .0264937    13.05   0.000     .2937414    .3975948
------------------------------------------------------------------------------
(results isvemp1 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0563925   .0418876     1.35   0.178    -.0257056    .1384907
          2  |   .0570346   .0408898     1.39   0.163    -.0231078    .1371771
          3  |   .0576767   .0401407     1.44   0.151    -.0209977    .1363511
          4  |   .0583188   .0396546     1.47   0.141    -.0194028    .1360405
          5  |   .0589609   .0394411     1.49   0.135    -.0183423    .1362641
          6  |    .059603   .0395047     1.51   0.131    -.0178248    .1370308
          7  |   .0602451    .039844     1.51   0.131    -.0178477    .1383379
          8  |   .0608872   .0404521     1.51   0.132    -.0183974    .1401718
          9  |   .0615293   .0413171     1.49   0.136    -.0194506    .1425093
         10  |   .0621714   .0424233     1.47   0.143    -.0209767    .1453195
         11  |   .0628135   .0437524     1.44   0.151    -.0229396    .1485666
         12  |   .0634556   .0452848     1.40   0.161     -.025301    .1522121
         13  |   .0640977   .0470006     1.36   0.173    -.0280218    .1562172
         14  |   .0647398   .0488805     1.32   0.185    -.0310643    .1605439
         15  |   .0653819   .0509064     1.28   0.199    -.0343928    .1651565
         16  |    .066024   .0530614     1.24   0.213    -.0379745    .1700225
         17  |   .0666661   .0553306     1.20   0.228    -.0417799    .1751121
         18  |   .0673082   .0577004     1.17   0.243    -.0457826     .180399
         19  |   .0679503    .060159     1.13   0.259    -.0499593    .1858598
         20  |   .0685924   .0626959     1.09   0.274    -.0542894    .1914742
         21  |   .0692345    .065302     1.06   0.289    -.0587552    .1972241
         22  |   .0698766   .0679694     1.03   0.304     -.063341    .2030941
         23  |   .0705187    .070691     1.00   0.318    -.0680332    .2090705
         24  |   .0711608   .0734609     0.97   0.333      -.07282    .2151415
         25  |   .0718029   .0762739     0.94   0.347    -.0776911    .2212969
         26  |   .0724449   .0791252     0.92   0.360    -.0826376    .2275275
------------------------------------------------------------------------------
(file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Ou
> tput\plot_as_emp_1.pdf written in PDF format)
/* emp 2th order */
(results olsemp2 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |    .075954   .0266971     2.85   0.004     .0236286    .1282794
          2  |   .0900395   .0260623     3.45   0.001     .0389583    .1411207
          3  |   .1038543   .0255673     4.06   0.000     .0537434    .1539653
          4  |   .1173986   .0252009     4.66   0.000     .0680058    .1667913
          5  |   .1306722   .0249502     5.24   0.000     .0817706    .1795737
          6  |   .1436752   .0248015     5.79   0.000     .0950652    .1922852
          7  |   .1564076   .0247402     6.32   0.000     .1079177    .2048974
          8  |   .1688693   .0247518     6.82   0.000     .1203566     .217382
          9  |   .1810605   .0248225     7.29   0.000     .1324093    .2297116
         10  |    .192981    .024939     7.74   0.000     .1441015    .2418604
         11  |   .2046309   .0250892     8.16   0.000      .155457    .2538048
         12  |   .2160102   .0252624     8.55   0.000     .1664968    .2655235
         13  |   .2271188    .025449     8.92   0.000     .1772396    .2769981
         14  |   .2379569   .0256411     9.28   0.000     .1877012    .2882126
         15  |   .2485243   .0258319     9.62   0.000     .1978948    .2991539
         16  |   .2588211   .0260159     9.95   0.000      .207831    .3098113
         17  |   .2688473    .026189    10.27   0.000     .2175179    .3201768
         18  |   .2786029   .0263482    10.57   0.000     .2269613    .3302445
         19  |   .2880879   .0264918    10.87   0.000     .2361649    .3400109
         20  |   .2973022    .026619    11.17   0.000       .24513    .3494745
         21  |    .306246   .0267302    11.46   0.000     .2538558    .3586361
         22  |   .3149191   .0268267    11.74   0.000     .2623397    .3674984
         23  |   .3233216   .0269111    12.01   0.000     .2705768    .3760663
         24  |   .3314534   .0269868    12.28   0.000     .2785603    .3843465
         25  |   .3393147   .0270582    12.54   0.000     .2862815    .3923479
         26  |   .3469053    .027131    12.79   0.000     .2937295    .4000811
------------------------------------------------------------------------------
(results isvemp2 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0530937   .0437399     1.21   0.225    -.0326349    .1388224
          2  |   .0559391   .0417785     1.34   0.181    -.0259452    .1378234
          3  |   .0586473   .0405058     1.45   0.148    -.0207426    .1380372
          4  |   .0612185   .0398951     1.53   0.125    -.0169745    .1394114
          5  |   .0636525   .0398908     1.60   0.111     -.014532     .141837
          6  |   .0659494   .0404149     1.63   0.103    -.0132624    .1451612
          7  |   .0681092   .0413776     1.65   0.100    -.0129894    .1492079
          8  |    .070132   .0426879     1.64   0.100    -.0135347    .1537986
          9  |   .0720176   .0442616     1.63   0.104    -.0147336    .1587688
         10  |   .0737661   .0460267     1.60   0.109    -.0164446    .1639768
         11  |   .0753775   .0479241     1.57   0.116    -.0185519    .1693069
         12  |   .0768518   .0499076     1.54   0.124    -.0209653    .1746689
         13  |    .078189   .0519429     1.51   0.132    -.0236173    .1799953
         14  |   .0793891   .0540055     1.47   0.142    -.0264597    .1852379
         15  |   .0804521    .056079     1.43   0.151    -.0294608     .190365
         16  |    .081378   .0581543     1.40   0.162    -.0326024    .1953584
         17  |   .0821668   .0602279     1.36   0.172    -.0358777    .2002112
         18  |   .0828184   .0623009     1.33   0.184    -.0392891     .204926
         19  |    .083333   .0643787     1.29   0.196    -.0428469    .2095129
         20  |   .0837105   .0664699     1.26   0.208    -.0465681     .213989
         21  |   .0839509    .068586     1.22   0.221    -.0504753     .218377
         22  |   .0840541    .070741     1.19   0.235    -.0545957     .222704
         23  |   .0840203   .0729508     1.15   0.249    -.0589607    .2270013
         24  |   .0838493    .075233     1.11   0.265    -.0636046    .2313032
         25  |   .0835413   .0776062     1.08   0.282     -.068564    .2356466
         26  |   .0830961   .0800901     1.04   0.299    -.0738776    .2400699
------------------------------------------------------------------------------
(file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Ou
> tput\plot_as_emp_2.pdf written in PDF format)
/* emp 3th order */
(results olsemp3 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]
               +(emptenure^3)*_b[c.emptenure#c.emptenure#c.emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0879997   .0293032     3.00   0.003     .0305664     .145433
          2  |   .1000005   .0273848     3.65   0.000     .0463274    .1536737
          3  |   .1120451   .0260969     4.29   0.000     .0608961    .1631941
          4  |   .1241149   .0253305     4.90   0.000     .0744681    .1737617
          5  |   .1361911   .0249639     5.46   0.000     .0872627    .1851194
          6  |    .148255    .024879     5.96   0.000      .099493     .197017
          7  |    .160288   .0249731     6.42   0.000     .1113417    .2092344
          8  |   .1722714   .0251648     6.85   0.000     .1229492    .2215936
          9  |   .1841865    .025395     7.25   0.000     .1344132    .2339598
         10  |   .1960145   .0256241     7.65   0.000     .1457923    .2462368
         11  |   .2077369   .0258285     8.04   0.000     .1571141    .2583598
         12  |   .2193349    .025997     8.44   0.000     .1683817    .2702881
         13  |   .2307898   .0261278     8.83   0.000     .1795803    .2819994
         14  |    .242083   .0262254     9.23   0.000     .1906822    .2934838
         15  |   .2531957   .0262985     9.63   0.000     .2016516    .3047399
         16  |   .2641093   .0263586    10.02   0.000     .2124474    .3157713
         17  |   .2748051   .0264177    10.40   0.000     .2230273    .3265829
         18  |   .2852644   .0264877    10.77   0.000     .2333495    .3371792
         19  |   .2954684   .0265785    11.12   0.000     .2433754    .3475614
         20  |   .3053986   .0266981    11.44   0.000     .2530713    .3577258
         21  |   .3150361   .0268509    11.73   0.000     .2624094    .3676629
         22  |   .3243624   .0270382    12.00   0.000     .2713686    .3773563
         23  |   .3333588   .0272578    12.23   0.000     .2799345     .386783
         24  |   .3420065   .0275043    12.43   0.000     .2880992    .3959138
         25  |   .3502869   .0277696    12.61   0.000     .2958595    .4047143
         26  |   .3581812   .0280439    12.77   0.000     .3032162    .4131462
------------------------------------------------------------------------------
(results isvemp3 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]
               +(emptenure^3)*_b[c.emptenure#c.emptenure#c.emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0561437   .0450681     1.25   0.213    -.0321881    .1444756
          2  |   .0598446    .042048     1.42   0.155    -.0225679    .1422572
          3  |    .063307   .0406375     1.56   0.119     -.016341    .1429551
          4  |   .0665325   .0404837     1.64   0.100     -.012814     .145879
          5  |   .0695225   .0411981     1.69   0.092    -.0112243    .1502694
          6  |   .0722787   .0424387     1.70   0.089    -.0108997    .1554571
          7  |   .0748025   .0439497     1.70   0.089    -.0113372    .1609423
          8  |   .0770955   .0455635     1.69   0.091    -.0122073    .1663984
          9  |   .0791593   .0471853     1.68   0.093    -.0133222    .1716408
         10  |   .0809953   .0487735     1.66   0.097    -.0145991    .1765897
         11  |   .0826051   .0503235     1.64   0.101    -.0160272    .1812375
         12  |   .0839903   .0518548     1.62   0.105    -.0176432    .1856239
         13  |   .0851524   .0534014     1.59   0.111    -.0195124    .1898171
         14  |   .0860929   .0550041     1.57   0.118    -.0217132    .1938989
         15  |   .0868133    .056705     1.53   0.126    -.0243265     .197953
         16  |   .0873152   .0585423     1.49   0.136    -.0274256    .2020561
         17  |   .0876002   .0605472     1.45   0.148    -.0310701    .2062705
         18  |   .0876697   .0627412     1.40   0.162    -.0353008    .2106402
         19  |   .0875254   .0651353     1.34   0.179    -.0401375    .2151882
         20  |   .0871687   .0677298     1.29   0.198    -.0455792    .2199166
         21  |   .0866011    .070515     1.23   0.219    -.0516058     .224808
         22  |   .0858243   .0734733     1.17   0.243    -.0581806    .2298293
         23  |   .0848398   .0765803     1.11   0.268    -.0652549    .2349345
         24  |    .083649   .0798079     1.05   0.295    -.0727716    .2400697
         25  |   .0822536   .0831254     0.99   0.322    -.0806693    .2451765
         26  |   .0806551   .0865022     0.93   0.351    -.0888862    .2501963
------------------------------------------------------------------------------
(file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Ou
> tput\plot_as_emp_3.pdf written in PDF format)
/* emp 4th order */
(results olsemp4 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]
               +(emptenure^3)*_b[c.emptenure#c.emptenure#c.emptenure]
               +(emptenure^4)*_b[c.emptenure#c.emptenure#c.emptenure#c.emptenur
               > e]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0786059   .0329425     2.39   0.017     .0140398     .143172
          2  |   .0938997   .0287045     3.27   0.001       .03764    .1501594
          3  |   .1084807   .0263392     4.12   0.000     .0568568    .1601046
          4  |   .1224265   .0253316     4.83   0.000     .0727774    .1720756
          5  |   .1358094   .0251371     5.40   0.000     .0865415    .1850773
          6  |   .1486964   .0253229     5.87   0.000     .0990644    .1983284
          7  |    .161149    .025615     6.29   0.000     .1109447    .2113534
          8  |   .1732235   .0258725     6.70   0.000     .1225144    .2239326
          9  |   .1849706   .0260438     7.10   0.000     .1339257    .2360155
         10  |   .1964357   .0261291     7.52   0.000     .1452236    .2476478
         11  |   .2076589   .0261547     7.94   0.000     .1563967    .2589211
         12  |   .2186749    .026156     8.36   0.000     .1674101    .2699398
         13  |    .229513   .0261669     8.77   0.000     .1782268    .2807993
         14  |   .2401971   .0262129     9.16   0.000     .1888207    .2915735
         15  |   .2507457   .0263082     9.53   0.000     .1991826    .3023088
         16  |   .2611721   .0264551     9.87   0.000     .2093211     .313023
         17  |    .271484    .026646    10.19   0.000     .2192588    .3237091
         18  |   .2816838   .0268666    10.48   0.000     .2290263    .3343412
         19  |   .2917685   .0270993    10.77   0.000      .238655    .3448821
         20  |   .3017299    .027327    11.04   0.000     .2481699      .35529
         21  |   .3115543   .0275363    11.31   0.000     .2575841    .3655244
         22  |   .3212224   .0277188    11.59   0.000     .2668946    .3755503
         23  |     .33071    .027873    11.86   0.000     .2760799    .3853401
         24  |    .339987   .0280041    12.14   0.000        .2851     .394874
         25  |   .3490184   .0281231    12.41   0.000     .2938981    .4041388
         26  |   .3577635   .0282456    12.67   0.000     .3024031    .4131239
------------------------------------------------------------------------------
(results isvemp4 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]
               +(emptenure^3)*_b[c.emptenure#c.emptenure#c.emptenure]
               +(emptenure^4)*_b[c.emptenure#c.emptenure#c.emptenure#c.emptenur
               > e]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0450504   .0482297     0.93   0.350     -.049478    .1395789
          2  |   .0548654   .0427293     1.28   0.199    -.0288825    .1386133
          3  |   .0628684   .0406404     1.55   0.122    -.0167854    .1425222
          4  |   .0692694   .0407454     1.70   0.089    -.0105901     .149129
          5  |    .074267   .0419362     1.77   0.077    -.0079265    .1564604
          6  |   .0780478   .0434906     1.79   0.073    -.0071923    .1632878
          7  |   .0807872   .0450472     1.79   0.073    -.0075037    .1690781
          8  |    .082649   .0464805     1.78   0.075    -.0084511     .173749
          9  |   .0837852   .0477943     1.75   0.080    -.0098899    .1774602
         10  |   .0843364   .0490524     1.72   0.086    -.0118044    .1804773
         11  |   .0844317   .0503358     1.68   0.093    -.0142246    .1830881
         12  |   .0841886   .0517182     1.63   0.104    -.0171772    .1855544
         13  |   .0837129   .0532526     1.57   0.116    -.0206603    .1880861
         14  |   .0830989   .0549669     1.51   0.131    -.0246343    .1908321
         15  |   .0824294   .0568658     1.45   0.147    -.0290256    .1938843
         16  |   .0817756   .0589366     1.39   0.165    -.0337381    .1972892
         17  |   .0811971   .0611571     1.33   0.184    -.0386686    .2010628
         18  |    .080742   .0635028     1.27   0.204    -.0437213    .2052052
         19  |   .0804467   .0659537     1.22   0.223    -.0488202    .2097137
         20  |   .0803363    .068498     1.17   0.241    -.0539172    .2145899
         21  |   .0804241   .0711344     1.13   0.258    -.0589967    .2198448
         22  |   .0807118   .0738723     1.09   0.275    -.0640753    .2254988
         23  |   .0811897   .0767303     1.06   0.290     -.069199    .2315783
         24  |   .0818364   .0797328     1.03   0.305     -.074437    .2381098
         25  |   .0826192   .0829061     1.00   0.319    -.0798737    .2451121
         26  |   .0834934   .0862737     0.97   0.333    -.0855999    .2525867
------------------------------------------------------------------------------
(file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Ou
> tput\plot_as_emp_4.pdf written in PDF format)
/* empocc 1th order */
(results olsempocc1 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |    .110154   .0261069     4.22   0.000     .0589853    .1613227
          2  |   .1192085   .0259689     4.59   0.000     .0683103    .1701067
          3  |   .1282631   .0258494     4.96   0.000     .0775991     .178927
          4  |   .1373176   .0257486     5.33   0.000     .0868512    .1877839
          5  |   .1463721   .0256668     5.70   0.000     .0960662     .196678
          6  |   .1554266    .025604     6.07   0.000     .1052437    .2056096
          7  |   .1644811   .0255606     6.43   0.000     .1143834    .2145789
          8  |   .1735357   .0255365     6.80   0.000     .1234851    .2235863
          9  |   .1825902   .0255318     7.15   0.000     .1325487    .2326317
         10  |   .1916447   .0255466     7.50   0.000     .1415743    .2417151
         11  |   .2006992   .0255808     7.85   0.000     .1505619    .2508366
         12  |   .2097538   .0256343     8.18   0.000     .1595115     .259996
         13  |   .2188083    .025707     8.51   0.000     .1684236     .269193
         14  |   .2278628   .0257987     8.83   0.000     .1772983    .2784274
         15  |   .2369173   .0259093     9.14   0.000     .1861361    .2876986
         16  |   .2459719   .0260385     9.45   0.000     .1949374    .2970063
         17  |   .2550264    .026186     9.74   0.000     .2037028    .3063499
         18  |   .2640809   .0263515    10.02   0.000      .212433    .3157289
         19  |   .2731354   .0265347    10.29   0.000     .2211284    .3251425
         20  |     .28219   .0267352    10.56   0.000       .22979      .33459
         21  |   .2912445   .0269526    10.81   0.000     .2384183    .3440707
         22  |    .300299   .0271866    11.05   0.000     .2470143    .3535837
         23  |   .3093535   .0274366    11.28   0.000     .2555787    .3631284
         24  |   .3184081   .0277024    11.49   0.000     .2641124    .3727037
         25  |   .3274626   .0279833    11.70   0.000     .2726163    .3823089
         26  |   .3365171    .028279    11.90   0.000     .2810913    .3919429
------------------------------------------------------------------------------
(results isvempocc1 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0567342   .0422411     1.34   0.179    -.0260568    .1395253
          2  |   .0574516   .0412574     1.39   0.164    -.0234114    .1383147
          3  |    .058169   .0405232     1.44   0.151     -.021255    .1375931
          4  |   .0588864   .0400523     1.47   0.141    -.0196146    .1373874
          5  |   .0596038   .0398539     1.50   0.135    -.0185084     .137716
          6  |   .0603212   .0399322     1.51   0.131    -.0179444    .1385868
          7  |   .0610386   .0402854     1.52   0.130    -.0179195    .1399966
          8  |   .0617559   .0409066     1.51   0.131    -.0184196    .1419315
          9  |   .0624733   .0417838     1.50   0.135    -.0194213     .144368
         10  |   .0631907   .0429011     1.47   0.141     -.020894    .1472754
         11  |   .0639081   .0442406     1.44   0.149    -.0228019    .1506181
         12  |   .0646255   .0457826     1.41   0.158    -.0251068    .1543577
         13  |   .0653429   .0475075     1.38   0.169      -.02777    .1584558
         14  |   .0660603    .049396     1.34   0.181    -.0307541    .1628747
         15  |   .0667777   .0514302     1.30   0.194    -.0340238    .1675791
         16  |    .067495   .0535935     1.26   0.208    -.0375464    .1725365
         17  |   .0682124   .0558709     1.22   0.222    -.0412926    .1777175
         18  |   .0689298    .058249     1.18   0.237    -.0452362    .1830959
         19  |   .0696472    .060716     1.15   0.251     -.049354    .1886484
         20  |   .0703646   .0632615     1.11   0.266    -.0536257    .1943548
         21  |    .071082   .0658763     1.08   0.281    -.0580333    .2001972
         22  |   .0717994   .0685526     1.05   0.295    -.0625613    .2061601
         23  |   .0725168   .0712835     1.02   0.309    -.0671962    .2122298
         24  |   .0732341   .0740628     0.99   0.323    -.0719262    .2183945
         25  |   .0739515   .0768853     0.96   0.336    -.0767409     .224644
         26  |   .0746689   .0797465     0.94   0.349    -.0816313    .2309692
------------------------------------------------------------------------------
(file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Ou
> tput\plot_as_empocc_1.pdf written in PDF format)
/* empocc 2th order */
(results olsempocc2 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0857777   .0277247     3.09   0.002     .0314382    .1401172
          2  |     .09863   .0270394     3.65   0.000     .0456338    .1516261
          3  |    .111253   .0265209     4.19   0.000      .059273    .1632329
          4  |   .1236466   .0261551     4.73   0.000     .0723834    .1749097
          5  |   .1358108   .0259258     5.24   0.000     .0849973    .1866244
          6  |   .1477457    .025815     5.72   0.000     .0971494    .1983421
          7  |   .1594513   .0258043     6.18   0.000     .1088758    .2100268
          8  |   .1709275   .0258755     6.61   0.000     .1202125    .2216425
          9  |   .1821744   .0260111     7.00   0.000     .1311935    .2331552
         10  |   .1931919   .0261949     7.38   0.000     .1418507     .244533
         11  |     .20398   .0264124     7.72   0.000     .1522127    .2557473
         12  |   .2145388   .0266505     8.05   0.000     .1623048    .2667728
         13  |   .2248682   .0268983     8.36   0.000     .1721485    .2775879
         14  |   .2349683   .0271466     8.66   0.000     .1817621    .2881746
         15  |   .2448391   .0273878     8.94   0.000       .19116    .2985181
         16  |   .2544805   .0276161     9.21   0.000     .2003538    .3086071
         17  |   .2638925   .0278274     9.48   0.000     .2093518    .3184332
         18  |   .2730752   .0280187     9.75   0.000     .2181594    .3279909
         19  |   .2820285   .0281889    10.00   0.000     .2267794    .3372776
         20  |   .2907525   .0283377    10.26   0.000     .2352116    .3462934
         21  |   .2992471   .0284666    10.51   0.000     .2434535    .3550407
         22  |   .3075124   .0285782    10.76   0.000     .2515001    .3635246
         23  |   .3155483   .0286763    11.00   0.000     .2593438    .3717528
         24  |   .3233548   .0287661    11.24   0.000     .2669744    .3797353
         25  |    .330932   .0288539    11.47   0.000     .2743794    .3874847
         26  |   .3382799   .0289476    11.69   0.000     .2815437    .3950161
------------------------------------------------------------------------------
(results isvempocc2 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0556049   .0444595     1.25   0.211    -.0315342     .142744
          2  |   .0592212   .0424207     1.40   0.163    -.0239219    .1423642
          3  |   .0626193   .0411497     1.52   0.128    -.0180326    .1432712
          4  |   .0657992   .0406088     1.62   0.105    -.0137926    .1453911
          5  |    .068761   .0407259     1.69   0.091    -.0110602    .1485822
          6  |   .0715047   .0414034     1.73   0.084    -.0096444    .1526538
          7  |   .0740302   .0425328     1.74   0.082    -.0093325    .1573929
          8  |   .0763375   .0440077     1.73   0.083    -.0099159     .162591
          9  |   .0784267   .0457327     1.71   0.086    -.0112077    .1680612
         10  |   .0802978    .047628     1.69   0.092    -.0130514     .173647
         11  |   .0819507   .0496301     1.65   0.099    -.0153225    .1792239
         12  |   .0833854   .0516905     1.61   0.107    -.0179261    .1846969
         13  |    .084602   .0537739     1.57   0.116    -.0207928    .1899969
         14  |   .0856005   .0558559     1.53   0.125     -.023875     .195076
         15  |   .0863808   .0579213     1.49   0.136    -.0271429    .1999044
         16  |   .0869429   .0599623     1.45   0.147    -.0305811    .2044669
         17  |   .0872869   .0619775     1.41   0.159    -.0341868    .2087606
         18  |   .0874127   .0639705     1.37   0.172    -.0379671    .2127926
         19  |   .0873204   .0659494     1.32   0.185    -.0419381    .2165789
         20  |   .0870099   .0679263     1.28   0.200    -.0461231     .220143
         21  |   .0864813   .0699162     1.24   0.216    -.0505519    .2235145
         22  |   .0857345   .0719373     1.19   0.233    -.0552599     .226729
         23  |   .0847696   .0740099     1.15   0.252    -.0602872    .2298265
         24  |   .0835866   .0761565     1.10   0.272    -.0656775    .2328506
         25  |   .0821853    .078401     1.05   0.295    -.0714777    .2358484
         26  |   .0805659   .0807681     1.00   0.319    -.0777366    .2388685
------------------------------------------------------------------------------
(file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Ou
> tput\plot_as_empocc_2.pdf written in PDF format)
/* empocc 3th order */
(results olsempocc3 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]
               +(emptenure^3)*_b[c.emptenure#c.emptenure#c.emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0985683   .0305997     3.22   0.001     .0385939    .1585426
          2  |   .1077096   .0284766     3.78   0.000     .0518965    .1635226
          3  |   .1171742    .027085     4.33   0.000     .0640886    .1702599
          4  |   .1269318   .0262965     4.83   0.000     .0753916    .1784719
          5  |   .1369517   .0259649     5.27   0.000     .0860614    .1878421
          6  |   .1472037   .0259482     5.67   0.000     .0963462    .1980612
          7  |   .1576571   .0261238     6.03   0.000     .1064554    .2088589
          8  |   .1682816   .0263968     6.38   0.000     .1165449    .2200183
          9  |   .1790467   .0266995     6.71   0.000     .1267167    .2313767
         10  |   .1899219   .0269884     7.04   0.000     .1370255    .2428182
         11  |   .2008767   .0272393     7.37   0.000     .1474887    .2542647
         12  |   .2118807   .0274422     7.72   0.000     .1580949    .2656665
         13  |   .2229034   .0275981     8.08   0.000     .1688121    .2769947
         14  |   .2339144   .0277152     8.44   0.000     .1795937    .2882351
         15  |   .2448831   .0278065     8.81   0.000     .1903834    .2993829
         16  |   .2557792   .0278879     9.17   0.000       .20112    .3104385
         17  |   .2665722   .0279757     9.53   0.000     .2117409    .3214035
         18  |   .2772315   .0280855     9.87   0.000     .2221849    .3322782
         19  |   .2877268   .0282308    10.19   0.000     .2323954    .3430582
         20  |   .2980275   .0284215    10.49   0.000     .2423225    .3537326
         21  |   .3081033   .0286634    10.75   0.000     .2519241    .3642825
         22  |   .3179236   .0289579    10.98   0.000     .2611671    .3746801
         23  |   .3274579   .0293019    11.18   0.000     .2700273    .3848886
         24  |   .3366759    .029688    11.34   0.000     .2784884    .3948634
         25  |    .345547   .0301057    11.48   0.000     .2865408    .4045532
         26  |   .3540408   .0305421    11.59   0.000     .2941795    .4139022
------------------------------------------------------------------------------
(results isvempocc3 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]
               +(emptenure^3)*_b[c.emptenure#c.emptenure#c.emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |    .052248   .0461099     1.13   0.257    -.0381257    .1426217
          2  |   .0590014   .0427583     1.38   0.168    -.0248033    .1428061
          3  |   .0651614   .0412589     1.58   0.114    -.0157045    .1460273
          4  |   .0707404   .0412056     1.72   0.086     -.010021    .1515018
          5  |   .0757508   .0421349     1.80   0.072     -.006832    .1583336
          6  |   .0802051   .0436362     1.84   0.066    -.0053202    .1657304
          7  |   .0841156   .0454056     1.85   0.064    -.0048777    .1731089
          8  |   .0874948    .047247     1.85   0.064    -.0051076    .1800971
          9  |    .090355   .0490505     1.84   0.065    -.0057822    .1864922
         10  |   .0927088   .0507683     1.83   0.068    -.0067953    .1922128
         11  |   .0945684   .0523948     1.80   0.071    -.0081235    .1972603
         12  |   .0959464   .0539517     1.78   0.075     -.009797    .2016897
         13  |    .096855   .0554776     1.75   0.081     -.011879     .205589
         14  |   .0973069   .0570196     1.71   0.088    -.0144496    .2090633
         15  |   .0973142   .0586274     1.66   0.097    -.0175933    .2122218
         16  |   .0968896   .0603474     1.61   0.108    -.0213892    .2151684
         17  |   .0960453   .0622195     1.54   0.123    -.0259026    .2179933
         18  |   .0947939   .0642737     1.47   0.140    -.0311802    .2207679
         19  |   .0931476   .0665285     1.40   0.161     -.037246    .2235412
         20  |    .091119    .068991     1.32   0.187    -.0441008    .2263388
         21  |   .0887204   .0716565     1.24   0.216    -.0517237    .2291645
         22  |   .0859642   .0745109     1.15   0.249    -.0600744    .2320028
         23  |   .0828629   .0775323     1.07   0.285    -.0690976    .2348235
         24  |   .0794289   .0806936     0.98   0.325    -.0787276    .2375854
         25  |   .0756746   .0839646     0.90   0.367    -.0888929    .2402421
         26  |   .0716124   .0873145     0.82   0.412    -.0995208    .2427456
------------------------------------------------------------------------------
(file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Ou
> tput\plot_as_empocc_3.pdf written in PDF format)
/* empocc 4th order */
(results olsempocc4 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]
               +(emptenure^3)*_b[c.emptenure#c.emptenure#c.emptenure]
               +(emptenure^4)*_b[c.emptenure#c.emptenure#c.emptenure#c.emptenur
               > e]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0928924   .0342239     2.71   0.007     .0258148    .1599699
          2  |   .1011744   .0297617     3.40   0.001     .0428425    .1595063
          3  |   .1099641     .02735     4.02   0.000     .0563591    .1635692
          4  |   .1192327   .0264184     4.51   0.000     .0674537    .1710118
          5  |   .1289498   .0263541     4.89   0.000     .0772967    .1806029
          6  |   .1390833   .0266729     5.21   0.000     .0868054    .1913613
          7  |   .1495997   .0270728     5.53   0.000     .0965379    .2026615
          8  |   .1604637   .0274023     5.86   0.000     .1067562    .2141713
          9  |   .1716385   .0276089     6.22   0.000      .117526    .2257511
         10  |   .1830857    .027698     6.61   0.000     .1287987    .2373727
         11  |   .1947651   .0277041     7.03   0.000     .1404661    .2490642
         12  |   .2066352   .0276734     7.47   0.000     .1523963    .2608741
         13  |   .2186526   .0276512     7.91   0.000     .1644574    .2728479
         14  |   .2307726   .0276742     8.34   0.000     .1765321    .2850131
         15  |   .2429485   .0277669     8.75   0.000     .1885264    .2973706
         16  |   .2551323   .0279392     9.13   0.000     .2003724    .3098922
         17  |   .2672743   .0281886     9.48   0.000     .2120257     .322523
         18  |   .2793232   .0285022     9.80   0.000       .22346    .3351864
         19  |   .2912261   .0288612    10.09   0.000     .2346592    .3477929
         20  |   .3029283   .0292448    10.36   0.000     .2456095    .3602471
         21  |   .3143738   .0296339    10.61   0.000     .2562924    .3724553
         22  |   .3255048   .0300134    10.85   0.000     .2666797    .3843299
         23  |    .336262   .0303737    11.07   0.000     .2767307    .3957933
         24  |   .3465843   .0307117    11.29   0.000     .2863905    .4067781
         25  |   .3564093   .0310302    11.49   0.000     .2955913    .4172273
         26  |   .3656726   .0313365    11.67   0.000     .3042543     .427091
------------------------------------------------------------------------------
(results isvempocc4 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]
               +(emptenure^3)*_b[c.emptenure#c.emptenure#c.emptenure]
               +(emptenure^4)*_b[c.emptenure#c.emptenure#c.emptenure#c.emptenur
               > e]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0471144   .0491828     0.96   0.338    -.0492821    .1435108
          2  |   .0562449   .0433849     1.30   0.195    -.0287879    .1412777
          3  |   .0642699   .0413967     1.55   0.121    -.0168662    .1454061
          4  |   .0712644   .0417891     1.71   0.088    -.0106407    .1531695
          5  |   .0772997   .0432907     1.79   0.074    -.0075484    .1621479
          6  |    .082444    .045109     1.83   0.068     -.005968     .170856
          7  |   .0867618   .0468702     1.85   0.064    -.0051021    .1786257
          8  |   .0903145   .0484583     1.86   0.062    -.0046619     .185291
          9  |   .0931599   .0498897     1.87   0.062     -.004622    .1909419
         10  |   .0953525   .0512365     1.86   0.063    -.0050692    .1957741
         11  |   .0969433    .052582     1.84   0.065    -.0061155    .2000021
         12  |     .09798   .0539966     1.81   0.070    -.0078514    .2038115
         13  |   .0985069   .0555272     1.77   0.076    -.0103245    .2073383
         14  |   .0985649   .0571956     1.72   0.085    -.0135364    .2106663
         15  |   .0981914   .0590034     1.66   0.096    -.0174532     .213836
         16  |   .0974206   .0609405     1.60   0.110    -.0220205    .2168617
         17  |    .096283   .0629939     1.53   0.126    -.0271828    .2197487
         18  |    .094806   .0651564     1.46   0.146    -.0328983    .2225103
         19  |   .0930135   .0674325     1.38   0.168    -.0391518    .2251789
         20  |    .090926   .0698416     1.30   0.193    -.0459611     .227813
         21  |   .0885605   .0724185     1.22   0.221    -.0533772    .2304981
         22  |   .0859307   .0752111     1.14   0.253    -.0614803    .2333418
         23  |    .083047   .0782752     1.06   0.289    -.0703696    .2364636
         24  |   .0799162   .0816676     0.98   0.328    -.0801494    .2399818
         25  |   .0765419   .0854378     0.90   0.370    -.0909132     .243997
         26  |   .0729241   .0896203     0.81   0.416    -.1027284    .2485765
------------------------------------------------------------------------------
(file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Ou
> tput\plot_as_empocc_4.pdf written in PDF format)
. 
. ** output tex all results
. {
. qui{
. }
. }

. 
. 
. 
. * 2. OLS->AS / under 60-year-old, firm size, non-specialist, regular employee
. {
. local subSample Yn Pr La Sm Rg
. foreach sub_i of local subSample{ /* loop within subsample */
  2.         do "$Code\ReadData.do"
  3.         /// criterion for making subsamples
>         if "`sub_i'"=="Yn"{ /* under 59-year-old */
  4.                 dis "/* under 59-year-old */"
  5.                 drop if age>=60
  6.                 sum age
  7.         }
  8.         else if "`sub_i'"=="Pr"{ /* non-professional */
  9.                 dis "/* non-professional */"
 10.                 drop if occ==10
 11.                 tab occ
 12.         }
 13.         else if "`sub_i'"=="La"{ /* large firm */
 14.                 dis "/* large firm */"
 15.                 keep if dsize==2
 16.                 tab dsize
 17.         }
 18.         else if "`sub_i'"=="Sm"{ /* small firm */
 19.                 dis "/* small firm */"
 20.                 drop if dsize==2
 21.                 tab dsize
 22.         }
 23.         else if "`sub_i'"=="Rg"{ /* regular employee */
 24.                 dis "/* regular employee */"
 25.                 drop if dregular==0
 26.         tab dregular
 27.         }
 28.         *** OLS
.         reg ///
>                 `commonVar' ///
>                 `emp2' ///
>                 , vce(r)
 29.                 est sto olsrob`sub_i'
 30.         
.         *** AS
.         qui {
 31.                 do "$Code\ConstructIV.do"
 32.                 ivregress 2sls ///
>                                                         `commonVar' ///
>                                                         (`emp2' = `empiv2') ///
>                                                         , vce(r)
 33.                 est sto isvrob`sub_i'
 34.                 drop if _est_isvrob`sub_i'==0
 35.                 drop *iv *iv? avg*
 36.                 **** re-build iv
.                 do "$Code\ConstructIV.do"
 37.         }
 38.         ivregress 2sls ///
>                                                 `commonVar' ///
>                                                 (`emp2' = `empiv2') ///
>                                                 , vce(r)
 39.         est sto isvrob`sub_i'
 40.         
.         *** culculation
.         est res olsrob`sub_i'
 41.         margins, exp(`culcemp2') ///
>         at(emptenure=(0(1)25)) noe post
 42.         est sto olsrobn`sub_i'
 43.         est res isvrob`sub_i'
 44.         margins, exp(`culcemp2') ///
>         at(emptenure=(0(1)25)) noe post
 45.         est sto isvrobn`sub_i'
 46. }

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd $Inputfd

. 
. qui {

. 
end of do-file
/* under 59-year-old */
(1,169 observations deleted)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     10,339    43.84418    9.274244         20         59

Linear regression                               Number of obs     =      7,754
                                                F(50, 7702)       =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3201
                                                Root MSE          =      .4616

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         occ |
          2  |  -.6991088   .1961704    -3.56   0.000    -1.083656   -.3145614
          3  |  -.6912731    .194074    -3.56   0.000    -1.071711   -.3108353
          4  |  -.7438957   .1969569    -3.78   0.000    -1.129985   -.3578066
          5  |  -.4152638   .1955108    -2.12   0.034    -.7985182   -.0320094
          6  |  -.6095831   .1953325    -3.12   0.002     -.992488   -.2266782
          7  |   -.737225    .196382    -3.75   0.000    -1.122187   -.3522628
          8  |  -.6808768   .1951173    -3.49   0.000     -1.06336   -.2983938
          9  |  -.5681242   .1963268    -2.89   0.004    -.9529782   -.1832702
         10  |  -.5421134   .1955726    -2.77   0.006    -.9254889   -.1587378
         11  |  -.8147532   .1990055    -4.09   0.000    -1.204858   -.4246483
         12  |  -.7318296   .2095819    -3.49   0.000    -1.142667   -.3209921
             |
         ind |
          2  |   .2756738   .2096651     1.31   0.189    -.1353268    .6866744
          3  |   .8980065   .2479001     3.62   0.000     .4120549    1.383958
          4  |    .892116   .2120739     4.21   0.000     .4763934    1.307839
          5  |   .9540069   .2118579     4.50   0.000     .5387078    1.369306
          6  |   .8959443   .2112651     4.24   0.000     .4818072    1.310081
          7  |   .8539964   .2166668     3.94   0.000     .4292706    1.278722
          8  |   .9453662    .213722     4.42   0.000      .526413    1.364319
          9  |   1.110679    .218987     5.07   0.000      .681405    1.539953
         10  |   .8670044   .2129153     4.07   0.000     .4496325    1.284376
         11  |   .9903916   .2135099     4.64   0.000     .5718542    1.408929
         12  |   1.051646   .2137451     4.92   0.000     .6326475    1.470644
         13  |   .9714682   .2152818     4.51   0.000     .5494574    1.393479
         14  |   .8695364   .2127229     4.09   0.000     .4525417    1.286531
         15  |    .984988   .2151409     4.58   0.000     .5632534    1.406723
         16  |   .9295018   .2119104     4.39   0.000     .5140997    1.344904
         17  |   .8291776   .2465606     3.36   0.001     .3458518    1.312503
         18  |   .9383017   .2245754     4.18   0.000     .4980727    1.378531
             |
    1.dunion |   .0366732   .0130257     2.82   0.005     .0111393    .0622072
  1.dmarital |   .1527306   .0153055     9.98   0.000     .1227276    .1827336
             |
        year |
       2005  |   .1104558   .0299085     3.69   0.000     .0518271    .1690846
       2006  |    .089196   .0288038     3.10   0.002     .0327326    .1456594
       2007  |   .0700807   .0265415     2.64   0.008     .0180522    .1221091
       2008  |   .0634323   .0266407     2.38   0.017     .0112093    .1156553
       2009  |   .0971621   .0240091     4.05   0.000     .0500977    .1442264
       2010  |   .0621183   .0248164     2.50   0.012     .0134715    .1107651
       2011  |   .0742715   .0242586     3.06   0.002      .026718    .1218249
       2012  |   .0714322   .0243405     2.93   0.003     .0237182    .1191462
       2013  |    .067048   .0259945     2.58   0.010     .0160917    .1180043
       2014  |   .1023229   .0256801     3.98   0.000     .0519829     .152663
             |
   schooling |
         12  |   .0570996   .0352564     1.62   0.105    -.0120125    .1262117
         14  |   .0508017   .0382822     1.33   0.185    -.0242419    .1258453
         16  |   .1867993   .0368208     5.07   0.000     .1146205     .258978
             |
       dsize |
          1  |   .0807461   .0146456     5.51   0.000     .0520368    .1094555
          2  |   .2188814   .0149173    14.67   0.000     .1896395    .2481233
             |
  1.dregular |   .2267013   .0221604    10.23   0.000     .1832609    .2701417
   emptenure |   .0131998   .0021444     6.16   0.000     .0089962    .0174035
             |
 c.emptenure#|
 c.emptenure |  -.0000798   .0000578    -1.38   0.167    -.0001931    .0000335
             |
          oj |   .0899099   .0300339     2.99   0.003     .0310354    .1487845
     workexp |   .0156812   .0030321     5.17   0.000     .0097374     .021625
             |
   c.workexp#|
   c.workexp |  -.0002352    .000063    -3.74   0.000    -.0003586   -.0001118
             |
       _cons |   6.172194   .0980935    62.92   0.000     5.979904    6.364484
------------------------------------------------------------------------------

Instrumental variables (2SLS) regression          Number of obs   =      7,754
                                                  Wald chi2(51)   =    4886.91
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.3042
                                                  Root MSE        =     .46538

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   emptenure |   .0015837   .0063581     0.25   0.803     -.010878    .0140453
             |
 c.emptenure#|
 c.emptenure |   .0000368    .000179     0.21   0.837     -.000314    .0003876
             |
          oj |   .0481514   .0501307     0.96   0.337    -.0501029    .1464058
     workexp |   .0357546   .0089956     3.97   0.000     .0181236    .0533857
             |
   c.workexp#|
   c.workexp |  -.0006001    .000177    -3.39   0.001    -.0009471   -.0002531
             |
         occ |
          2  |  -.6704218   .2122453    -3.16   0.002    -1.086415   -.2544287
          3  |  -.6858836   .2061311    -3.33   0.001    -1.089893   -.2818742
          4  |  -.7502027   .2076237    -3.61   0.000    -1.157138   -.3432677
          5  |  -.3637464   .2098726    -1.73   0.083    -.7750891    .0475963
          6  |   -.587543   .2075908    -2.83   0.005    -.9944134   -.1806726
          7  |  -.7570702   .2072569    -3.65   0.000    -1.163286   -.3508542
          8  |  -.6778376   .2069154    -3.28   0.001    -1.083384   -.2722909
          9  |  -.5596102   .2088617    -2.68   0.007    -.9689715   -.1502488
         10  |  -.5215949    .208238    -2.50   0.012    -.9297339   -.1134559
         11  |  -.8284153   .2086708    -3.97   0.000    -1.237403   -.4194279
         12  |  -.7317258   .2212334    -3.31   0.001    -1.165335   -.2981162
             |
         ind |
          2  |    .329976   .2243932     1.47   0.141    -.1098265    .7697784
          3  |   .7805569   .2661508     2.93   0.003     .2589109    1.302203
          4  |   .8793882   .2250464     3.91   0.000     .4383054    1.320471
          5  |   .9457827   .2251148     4.20   0.000     .5045658       1.387
          6  |   .8958353   .2242928     3.99   0.000     .4562294    1.335441
          7  |   .8316924   .2291247     3.63   0.000     .3826163    1.280768
          8  |   .9252033   .2265471     4.08   0.000     .4811791    1.369227
          9  |    1.06776   .2334181     4.57   0.000     .6102685    1.525251
         10  |    .849078   .2258175     3.76   0.000     .4064839    1.291672
         11  |   .9800603   .2264623     4.33   0.000     .5362023    1.423918
         12  |   1.037848   .2272398     4.57   0.000     .5924659     1.48323
         13  |   .9584412   .2280519     4.20   0.000     .5114676    1.405415
         14  |   .8365851   .2256959     3.71   0.000     .3942292    1.278941
         15  |   .9710766   .2280953     4.26   0.000      .524018    1.418135
         16  |   .9004691   .2252997     4.00   0.000     .4588898    1.342048
         17  |   .8278521   .2592035     3.19   0.001     .3198226    1.335882
         18  |   .9134204   .2375494     3.85   0.000     .4478322    1.379009
             |
    1.dunion |    .064152   .0176545     3.63   0.000     .0295498    .0987543
  1.dmarital |   .1516317   .0215439     7.04   0.000     .1094065    .1938569
             |
        year |
       2005  |   .1043328   .0304639     3.42   0.001     .0446245     .164041
       2006  |   .0844159   .0294433     2.87   0.004     .0267082    .1421237
       2007  |   .0657163   .0270966     2.43   0.015      .012608    .1188246
       2008  |    .054348   .0278009     1.95   0.051    -.0001408    .1088367
       2009  |   .0923352   .0247288     3.73   0.000     .0438676    .1408027
       2010  |   .0561571   .0257351     2.18   0.029     .0057173     .106597
       2011  |   .0720548   .0257195     2.80   0.005     .0216455    .1224641
       2012  |   .0704941   .0257127     2.74   0.006     .0200982      .12089
       2013  |   .0633069   .0279559     2.26   0.024     .0085143    .1180994
       2014  |   .0997373   .0278554     3.58   0.000     .0451416    .1543329
             |
   schooling |
         12  |   .0371472   .0426128     0.87   0.383    -.0463724    .1206668
         14  |   .0309309   .0497289     0.62   0.534     -.066536    .1283979
         16  |    .157623   .0500817     3.15   0.002     .0594646    .2557813
             |
       dsize |
          1  |   .1058548   .0181183     5.84   0.000     .0703436    .1413661
          2  |   .2589488   .0248958    10.40   0.000     .2101539    .3077437
             |
  1.dregular |   .2910049    .039892     7.29   0.000     .2128179    .3691918
       _cons |   6.043658   .1692709    35.70   0.000     5.711893    6.375423
------------------------------------------------------------------------------
Instrumented:  emptenure c.emptenure#c.emptenure oj workexp
               c.workexp#c.workexp
Instruments:   2.occ 3.occ 4.occ 5.occ 6.occ 7.occ 8.occ 9.occ 10.occ 11.occ
               12.occ 2.ind 3.ind 4.ind 5.ind 6.ind 7.ind 8.ind 9.ind 10.ind
               11.ind 12.ind 13.ind 14.ind 15.ind 16.ind 17.ind 18.ind
               1.dunion 1.dmarital 2005.year 2006.year 2007.year 2008.year
               2009.year 2010.year 2011.year 2012.year 2013.year 2014.year
               12.schooling 14.schooling 16.schooling 1.dsize 2.dsize
               1.dregular emptenureiv emptenureiv2 ojiv workexpiv workexpiv2
(results olsrobYn are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      7,754
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0899099   .0300339     2.99   0.003     .0310446    .1487752
          2  |   .1030299   .0293214     3.51   0.000     .0455611    .1604987
          3  |   .1159903   .0287678     4.03   0.000     .0596064    .1723742
          4  |    .128791     .02836     4.54   0.000     .0732064    .1843756
          5  |   .1414321   .0280828     5.04   0.000     .0863909    .1964733
          6  |   .1539136   .0279198     5.51   0.000     .0991917    .2086354
          7  |   .1662353   .0278545     5.97   0.000     .1116415    .2208292
          8  |   .1783975   .0278702     6.40   0.000     .1237729    .2330221
          9  |      .1904   .0279509     6.81   0.000     .1356172    .2451828
         10  |   .2022429   .0280819     7.20   0.000     .1472035    .2572823
         11  |   .2139261   .0282495     7.57   0.000     .1585582    .2692941
         12  |   .2254497   .0284418     7.93   0.000     .1697047    .2811946
         13  |   .2368136   .0286486     8.27   0.000     .1806634    .2929638
         14  |   .2480179   .0288611     8.59   0.000     .1914513    .3045846
         15  |   .2590626   .0290723     8.91   0.000      .202082    .3160432
         16  |   .2699476   .0292767     9.22   0.000     .2125664    .3273288
         17  |    .280673   .0294703     9.52   0.000     .2229123    .3384336
         18  |   .2912387   .0296506     9.82   0.000     .2331245    .3493528
         19  |   .3016448   .0298165    10.12   0.000     .2432054    .3600841
         20  |   .3118912   .0299682    10.41   0.000     .2531545    .3706279
         21  |    .321978   .0301073    10.69   0.000     .2629688    .3809872
         22  |   .3319052   .0302364    10.98   0.000     .2726429    .3911674
         23  |   .3416727   .0303597    11.25   0.000     .2821688    .4011766
         24  |   .3512805   .0304824    11.52   0.000      .291536     .411025
         25  |   .3607288   .0306112    11.78   0.000     .3007319    .4207256
         26  |   .3700174   .0307537    12.03   0.000     .3097412    .4302935
------------------------------------------------------------------------------
(results isvrobYn are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      7,754
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0481514   .0501307     0.96   0.337    -.0501029    .1464058
          2  |   .0497719   .0479757     1.04   0.300    -.0442587    .1438025
          3  |    .051466   .0465815     1.10   0.269    -.0398321     .142764
          4  |   .0532336   .0459154     1.16   0.246    -.0367588    .1432261
          5  |   .0550749   .0459153     1.20   0.230    -.0349173    .1450672
          6  |   .0569899    .046497     1.23   0.220    -.0341426    .1481223
          7  |   .0589784   .0475649     1.24   0.215    -.0342471    .1522039
          8  |   .0610405   .0490231     1.25   0.213     -.035043     .157124
          9  |   .0631763   .0507836     1.24   0.213    -.0363577    .1627102
         10  |   .0653856   .0527709     1.24   0.215    -.0380435    .1688147
         11  |   .0676686   .0549242     1.23   0.218    -.0399809    .1753181
         12  |   .0700252   .0571965     1.22   0.221     -.042078    .1821283
         13  |   .0724554   .0595536     1.22   0.224    -.0442676    .1891784
         14  |   .0749592   .0619722     1.21   0.226    -.0465042    .1964225
         15  |   .0775366   .0644382     1.20   0.229      -.04876    .2038332
         16  |   .0801876   .0669453     1.20   0.231    -.0510228    .2113981
         17  |   .0829123   .0694935     1.19   0.233    -.0532925     .219117
         18  |   .0857105    .072088     1.19   0.234    -.0555794    .2270004
         19  |   .0885824   .0747385     1.19   0.236    -.0579023    .2350671
         20  |   .0915279    .077458     1.18   0.237    -.0602871    .2433428
         21  |    .094547   .0802627     1.18   0.239     -.062765    .2518589
         22  |   .0976397   .0831706     1.17   0.240    -.0653717    .2606511
         23  |    .100806   .0862018     1.17   0.242    -.0681464    .2697583
         24  |   .1040459   .0893772     1.16   0.244    -.0711302     .279222
         25  |   .1073594   .0927185     1.16   0.247    -.0743655    .2890844
         26  |   .1107466   .0962477     1.15   0.250    -.0778955    .2993887
------------------------------------------------------------------------------

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd $Inputfd

. 
. qui {

. 
end of do-file
/* non-professional */
(1,678 observations deleted)

        occ |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         42        0.43        0.43
          2 |          3        0.03        0.46
          3 |      1,443       14.74       15.19
          4 |        724        7.39       22.59
          5 |      1,300       13.27       35.86
          6 |      1,293       13.20       49.07
          7 |      1,071       10.94       60.00
          8 |      2,980       30.43       90.43
          9 |        646        6.60       97.03
         11 |        192        1.96       98.99
         12 |         99        1.01      100.00
------------+-----------------------------------
      Total |      9,793      100.00

Linear regression                               Number of obs     =      7,337
                                                F(50, 7286)       =      79.10
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3457
                                                Root MSE          =     .45792

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         occ |
          2  |  -.0223707   .4325554    -0.05   0.959    -.8703046    .8255632
          3  |  -.2444204   .3788465    -0.65   0.519    -.9870692    .4982284
          4  |  -.3391147   .3805836    -0.89   0.373    -1.085169    .4069394
          5  |   .0707243   .3804088     0.19   0.853    -.6749872    .8164358
          6  |  -.1668841   .3802541    -0.44   0.661    -.9122922     .578524
          7  |  -.3051683    .380666    -0.80   0.423    -1.051384    .4410473
          8  |  -.2499561   .3802913    -0.66   0.511    -.9954373     .495525
          9  |   -.128727   .3806914    -0.34   0.735    -.8749923    .6175383
         11  |  -.3945679   .3811938    -1.04   0.301    -1.141818    .3526823
         12  |  -.1925276   .3869216    -0.50   0.619    -.9510059    .5659508
             |
         ind |
          2  |   .0263012   .2386645     0.11   0.912    -.4415504    .4941528
          3  |   .4234421   .4082787     1.04   0.300    -.3769025    1.223787
          4  |   .4068379   .3895612     1.04   0.296     -.356815    1.170491
          5  |   .4541267   .3896643     1.17   0.244    -.3097282    1.217982
          6  |   .3874208   .3885352     1.00   0.319    -.3742207    1.149062
          7  |   .3877328   .3914952     0.99   0.322    -.3797112    1.155177
          8  |   .4482805   .3902958     1.15   0.251    -.3168122    1.213373
          9  |     .56498   .3924392     1.44   0.150    -.2043146    1.334275
         10  |   .3590673   .3899134     0.92   0.357     -.405276    1.123411
         11  |   .4898037   .3904866     1.25   0.210    -.2756632    1.255271
         12  |   .5411718   .3904161     1.39   0.166    -.2241568      1.3065
         13  |   .4974763   .3909398     1.27   0.203    -.2688788    1.263831
         14  |    .382042   .3905626     0.98   0.328    -.3835737    1.147658
         15  |   .3710839   .3923662     0.95   0.344    -.3980676    1.140235
         16  |   .4346079   .3893838     1.12   0.264    -.3286971    1.197913
         17  |   .3840275   .4069218     0.94   0.345    -.4136571    1.181712
         18  |   .3575306   .3953218     0.90   0.366    -.4174146    1.132476
             |
    1.dunion |   .0540954   .0138257     3.91   0.000      .026993    .0811979
  1.dmarital |   .1394913   .0151401     9.21   0.000     .1098123    .1691702
             |
        year |
       2005  |   .0830102      .0308     2.70   0.007     .0226333    .1433871
       2006  |   .0571133   .0296893     1.92   0.054    -.0010863     .115313
       2007  |   .0511823   .0268021     1.91   0.056    -.0013575    .1037221
       2008  |   .0477678   .0270922     1.76   0.078    -.0053406    .1008763
       2009  |     .07899   .0241716     3.27   0.001     .0316066    .1263733
       2010  |   .0379805   .0244054     1.56   0.120    -.0098612    .0858222
       2011  |   .0506211   .0242629     2.09   0.037     .0030587    .0981835
       2012  |    .034085   .0241182     1.41   0.158    -.0131937    .0813637
       2013  |   .0254905   .0255388     1.00   0.318     -.024573     .075554
       2014  |   .0591382   .0251827     2.35   0.019     .0097729    .1085036
             |
   schooling |
         12  |   .0939253    .027415     3.43   0.001     .0401839    .1476667
         14  |    .099071   .0317735     3.12   0.002     .0367857    .1613562
         16  |   .2041859   .0296611     6.88   0.000     .1460416    .2623303
             |
       dsize |
          1  |   .0536742   .0144034     3.73   0.000     .0254393     .081909
          2  |    .203982   .0151546    13.46   0.000     .1742746    .2336894
             |
  1.dregular |   .2498186   .0185869    13.44   0.000     .2133829    .2862543
   emptenure |   .0171316   .0020291     8.44   0.000     .0131539    .0211092
             |
 c.emptenure#|
 c.emptenure |  -.0001996   .0000524    -3.81   0.000    -.0003023   -.0000968
             |
          oj |   .0546414   .0290711     1.88   0.060    -.0023464    .1116293
     workexp |   .0176914   .0027657     6.40   0.000     .0122699     .023113
             |
   c.workexp#|
   c.workexp |  -.0002965   .0000526    -5.64   0.000    -.0003995   -.0001934
             |
       _cons |   6.227171    .097068    64.15   0.000     6.036889    6.417452
------------------------------------------------------------------------------

Instrumental variables (2SLS) regression          Number of obs   =      7,337
                                                  Wald chi2(50)   =    3228.19
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.3120
                                                  Root MSE        =     .46795

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   emptenure |   .0011625   .0064098     0.18   0.856    -.0114004    .0137254
             |
 c.emptenure#|
 c.emptenure |  -.0000563   .0001618    -0.35   0.728    -.0003734    .0002608
             |
          oj |   .0398958   .0502396     0.79   0.427    -.0585721    .1383637
     workexp |   .0434282   .0087251     4.98   0.000     .0263273    .0605291
             |
   c.workexp#|
   c.workexp |   -.000709   .0001597    -4.44   0.000    -.0010221    -.000396
             |
         occ |
          2  |   .0646006   .4233602     0.15   0.879    -.7651701    .8943713
          3  |  -.2403224   .3489259    -0.69   0.491    -.9242046    .4435597
          4  |  -.3418815   .3490924    -0.98   0.327     -1.02609    .3423271
          5  |   .1212842   .3498773     0.35   0.729    -.5644627    .8070312
          6  |  -.1480072     .34948    -0.42   0.672    -.8329753    .5369609
          7  |  -.3447073    .348855    -0.99   0.323     -1.02845    .3390359
          8  |  -.2587315   .3498222    -0.74   0.460    -.9443704    .4269075
          9  |  -.1209996   .3515734    -0.34   0.731    -.8100709    .5680716
         11  |  -.4393594   .3483215    -1.26   0.207    -1.122057    .2433381
         12  |  -.2035553   .3562575    -0.57   0.568    -.9018071    .4946966
             |
         ind |
          2  |   .0737207    .240865     0.31   0.760     -.398366    .5458075
          3  |   .2740717   .3885576     0.71   0.481    -.4874871    1.035631
          4  |   .3959204    .361602     1.09   0.274    -.3128064    1.104647
          5  |   .4527051    .361563     1.25   0.211    -.2559452    1.161355
          6  |   .3911219   .3604219     1.09   0.278    -.3152921    1.097536
          7  |   .3430196   .3634255     0.94   0.345    -.3692812     1.05532
          8  |   .4189185   .3623175     1.16   0.248    -.2912108    1.129048
          9  |   .4908362   .3671153     1.34   0.181    -.2286964    1.210369
         10  |   .3403758   .3617252     0.94   0.347    -.3685926    1.049344
         11  |   .4770417   .3624791     1.32   0.188    -.2334043    1.187488
         12  |   .5174114   .3632122     1.42   0.154    -.1944715    1.229294
         13  |   .4837965   .3636351     1.33   0.183    -.2289152    1.196508
         14  |   .3292898   .3629378     0.91   0.364    -.3820552    1.040635
         15  |   .3397152   .3653149     0.93   0.352    -.3762888    1.055719
         16  |   .3890773   .3623603     1.07   0.283    -.3211359     1.09929
         17  |   .3907621   .3812512     1.02   0.305    -.3564766    1.138001
         18  |   .3134041   .3691078     0.85   0.396    -.4100339    1.036842
             |
    1.dunion |   .0894129   .0181847     4.92   0.000     .0537717    .1250542
  1.dmarital |   .1458347   .0213701     6.82   0.000       .10395    .1877193
             |
        year |
       2005  |    .075844   .0318177     2.38   0.017     .0134825    .1382055
       2006  |   .0499139   .0309117     1.61   0.106    -.0106719    .1104996
       2007  |   .0444731   .0277878     1.60   0.109      -.00999    .0989363
       2008  |   .0309928   .0293238     1.06   0.291    -.0264807    .0884663
       2009  |   .0696291   .0256246     2.72   0.007     .0194058    .1198523
       2010  |   .0276227   .0261335     1.06   0.291     -.023598    .0788434
       2011  |   .0471388   .0259768     1.81   0.070    -.0037748    .0980523
       2012  |   .0319628   .0261842     1.22   0.222    -.0193573     .083283
       2013  |   .0235144   .0282015     0.83   0.404    -.0317596    .0787883
       2014  |   .0602355   .0284104     2.12   0.034     .0045522    .1159188
             |
   schooling |
         12  |   .0606663   .0442722     1.37   0.171    -.0261057    .1474383
         14  |   .0661397    .055347     1.20   0.232    -.0423384    .1746178
         16  |   .1671586   .0579189     2.89   0.004     .0536397    .2806774
             |
       dsize |
          1  |   .0979134   .0195982     5.00   0.000     .0595017    .1363252
          2  |   .2670337   .0262892    10.16   0.000     .2155078    .3185597
             |
  1.dregular |    .313184   .0516432     6.06   0.000     .2119652    .4144029
       _cons |   6.026127   .2067599    29.15   0.000     5.620885    6.431369
------------------------------------------------------------------------------
Instrumented:  emptenure c.emptenure#c.emptenure oj workexp
               c.workexp#c.workexp
Instruments:   2.occ 3.occ 4.occ 5.occ 6.occ 7.occ 8.occ 9.occ 11.occ 12.occ
               2.ind 3.ind 4.ind 5.ind 6.ind 7.ind 8.ind 9.ind 10.ind 11.ind
               12.ind 13.ind 14.ind 15.ind 16.ind 17.ind 18.ind 1.dunion
               1.dmarital 2005.year 2006.year 2007.year 2008.year 2009.year
               2010.year 2011.year 2012.year 2013.year 2014.year
               12.schooling 14.schooling 16.schooling 1.dsize 2.dsize
               1.dregular emptenureiv emptenureiv2 ojiv workexpiv workexpiv2
(results olsrobPr are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      7,337
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0546414   .0290711     1.88   0.060    -.0023369    .1116198
          2  |   .0715734   .0284194     2.52   0.012     .0158724    .1272745
          3  |   .0881063   .0279136     3.16   0.002     .0333966    .1428159
          4  |     .10424   .0275416     3.78   0.000     .0502595    .1582204
          5  |   .1199745   .0272895     4.40   0.000      .066488     .173461
          6  |   .1353099   .0271428     4.99   0.000      .082111    .1885088
          7  |   .1502462   .0270862     5.55   0.000     .0971582    .2033341
          8  |   .1647833   .0271046     6.08   0.000     .1116592    .2179073
          9  |   .1789213   .0271835     6.58   0.000     .1256427    .2321998
         10  |   .1926601   .0273091     7.05   0.000     .1391352    .2461849
         11  |   .2059998   .0274691     7.50   0.000     .1521614    .2598381
         12  |   .2189403   .0276521     7.92   0.000     .1647431    .2731375
         13  |   .2314817   .0278485     8.31   0.000     .1768996    .2860638
         14  |    .243624   .0280499     8.69   0.000     .1886472    .2986007
         15  |   .2553671   .0282492     9.04   0.000     .1999996    .3107346
         16  |    .266711    .028441     9.38   0.000     .2109677    .3224543
         17  |   .2776558   .0286208     9.70   0.000     .2215601    .3337516
         18  |   .2882015   .0287856    10.01   0.000     .2317827    .3446203
         19  |   .2983481   .0289335    10.31   0.000     .2416394    .3550568
         20  |   .3080954   .0290638    10.60   0.000     .2511314    .3650595
         21  |   .3174437   .0291769    10.88   0.000      .260258    .3746294
         22  |   .3263928   .0292742    11.15   0.000     .2690165    .3837691
         23  |   .3349427   .0293582    11.41   0.000     .2774017    .3924838
         24  |   .3430936   .0294326    11.66   0.000     .2854067    .4007804
         25  |   .3508452    .029502    11.89   0.000     .2930223    .4086682
         26  |   .3581978   .0295723    12.11   0.000     .3002371    .4161584
------------------------------------------------------------------------------
(results isvrobPr are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      7,337
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0398958   .0502396     0.79   0.427    -.0585721    .1383637
          2  |    .041002   .0479998     0.85   0.393    -.0530759    .1350799
          3  |   .0419956   .0465383     0.90   0.367    -.0492178     .133209
          4  |   .0428766   .0458318     0.94   0.350    -.0469521    .1327054
          5  |   .0436451   .0458245     0.95   0.341    -.0461692    .1334594
          6  |    .044301   .0464337     0.95   0.340    -.0467073    .1353093
          7  |   .0448443   .0475615     0.94   0.346    -.0483745    .1380631
          8  |    .045275   .0491067     0.92   0.357    -.0509723    .1415224
          9  |   .0455932   .0509743     0.89   0.371    -.0543147     .145501
         10  |   .0457988   .0530816     0.86   0.388    -.0582392    .1498367
         11  |   .0458918   .0553599     0.83   0.407    -.0626117    .1543952
         12  |   .0458722   .0577551     0.79   0.427    -.0673257    .1590701
         13  |     .04574   .0602257     0.76   0.448    -.0723002    .1637803
         14  |   .0454953   .0627416     0.73   0.468     -.077476    .1684667
         15  |    .045138   .0652819     0.69   0.489    -.0828121    .1730882
         16  |   .0446681   .0678333     0.66   0.510    -.0882827     .177619
         17  |   .0440857    .070389     0.63   0.531    -.0938743    .1820457
         18  |   .0433907   .0729475     0.59   0.552    -.0995838    .1863652
         19  |   .0425831   .0755116     0.56   0.573    -.1054169     .190583
         20  |   .0416629   .0780876     0.53   0.594    -.1113861    .1947119
         21  |   .0406301   .0806853     0.50   0.615    -.1175101    .1987704
         22  |   .0394848   .0833166     0.47   0.636    -.1238126    .2027823
         23  |   .0382269   .0859957     0.44   0.657    -.1303216    .2067754
         24  |   .0368564   .0887387     0.42   0.678    -.1370683    .2107812
         25  |   .0353734    .091563     0.39   0.699    -.1440868    .2148336
         26  |   .0337778    .094487     0.36   0.721    -.1514134    .2189689
------------------------------------------------------------------------------

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd $Inputfd

. 
. qui {

. 
end of do-file
/* large firm */
(7,230 observations deleted)

      dsize |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |      4,278      100.00      100.00
------------+-----------------------------------
      Total |      4,278      100.00
note: 2.dsize omitted because of collinearity

Linear regression                               Number of obs     =      3,325
                                                F(44, 3280)       =      35.03
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2778
                                                Root MSE          =     .46825

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         occ |
          4  |  -.1420038   .0525868    -2.70   0.007    -.2451101   -.0388974
          5  |   .2297756   .0443838     5.18   0.000     .1427529    .3167983
          6  |   .0745772   .0394298     1.89   0.059    -.0027322    .1518867
          7  |   .0538619   .0479973     1.12   0.262    -.0402458    .1479696
          8  |   .0655736   .0395679     1.66   0.098    -.0120066    .1431539
          9  |   .1410862   .0483891     2.92   0.004     .0462104    .2359621
         10  |   .1682846   .0395621     4.25   0.000     .0907157    .2458535
         11  |    -.05099   .0578595    -0.88   0.378    -.1644344    .0624544
         12  |    .140622   .1395562     1.01   0.314     -.133004     .414248
             |
         ind |
          5  |   .0583024   .0356433     1.64   0.102    -.0115829    .1281878
          6  |   .0331575   .0485431     0.68   0.495    -.0620205    .1283354
          7  |    .012269   .0793019     0.15   0.877    -.1432172    .1677552
          8  |    .120426   .0456667     2.64   0.008     .0308878    .2099641
          9  |   .2130279   .0937377     2.27   0.023     .0292375    .3968183
         10  |  -.0518665   .0465266    -1.11   0.265    -.1430907    .0393576
         11  |   .0634569   .0539242     1.18   0.239    -.0422717    .1691855
         12  |    .126631   .0508867     2.49   0.013      .026858    .2264039
         13  |    .197865   .0715945     2.76   0.006     .0574905    .3382395
         14  |  -.0603112   .0596819    -1.01   0.312    -.1773288    .0567063
         15  |  -.0276792   .0625645    -0.44   0.658    -.1503486    .0949902
         16  |   .0323544   .0461225     0.70   0.483    -.0580775    .1227863
         17  |   .0891073    .241792     0.37   0.713    -.3849712    .5631858
         18  |   .0438744   .1315428     0.33   0.739    -.2140399    .3017886
             |
    1.dunion |    .017413   .0189233     0.92   0.358    -.0196898    .0545157
  1.dmarital |   .1072821   .0240219     4.47   0.000     .0601827    .1543815
             |
        year |
       2005  |   .0422504   .0456268     0.93   0.355    -.0472095    .1317102
       2006  |  -.0034025    .045338    -0.08   0.940    -.0922962    .0854911
       2007  |   .0271018   .0436411     0.62   0.535    -.0584647    .1126684
       2008  |   .0182956   .0432369     0.42   0.672    -.0664784    .1030695
       2009  |   .0449119   .0391913     1.15   0.252    -.0319299    .1217538
       2010  |   .0214777   .0416094     0.52   0.606    -.0601052    .1030607
       2011  |   .0159414   .0393932     0.40   0.686    -.0612964    .0931791
       2012  |   .0269791   .0410371     0.66   0.511    -.0534818      .10744
       2013  |   .0031261   .0418938     0.07   0.941    -.0790145    .0852667
       2014  |   .0605659   .0407639     1.49   0.137    -.0193594    .1404912
             |
   schooling |
         12  |   .1639416   .0831054     1.97   0.049     .0009978    .3268854
         14  |   .1378983   .0873911     1.58   0.115    -.0334483     .309245
         16  |   .2980534   .0839193     3.55   0.000     .1335139    .4625929
             |
     2.dsize |          0  (omitted)
  1.dregular |   .3263786   .0326373    10.00   0.000     .2623871    .3903702
   emptenure |   .0194593   .0035561     5.47   0.000     .0124869    .0264316
             |
 c.emptenure#|
 c.emptenure |  -.0002281   .0000858    -2.66   0.008    -.0003963   -.0000599
             |
          oj |      .0363   .0548665     0.66   0.508     -.071276    .1438761
     workexp |   .0197329   .0044269     4.46   0.000     .0110532    .0284126
             |
   c.workexp#|
   c.workexp |  -.0003057   .0000877    -3.49   0.000    -.0004777   -.0001338
             |
       _cons |    6.42471   .1097946    58.52   0.000     6.209437    6.639982
------------------------------------------------------------------------------
note: 2.dsize omitted because of collinearity

Instrumental variables (2SLS) regression          Number of obs   =      3,325
                                                  Wald chi2(44)   =    1107.25
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.2501
                                                  Root MSE        =     .47391

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   emptenure |   .0067957   .0099975     0.68   0.497    -.0127991    .0263905
             |
 c.emptenure#|
 c.emptenure |  -.0001356   .0002582    -0.53   0.599    -.0006416    .0003704
             |
          oj |   .0447196    .083424     0.54   0.592    -.1187884    .2082275
     workexp |   .0533184   .0139906     3.81   0.000     .0258974    .0807394
             |
   c.workexp#|
   c.workexp |  -.0008622    .000281    -3.07   0.002     -.001413   -.0003115
             |
         occ |
          4  |  -.1535573   .0618056    -2.48   0.013     -.274694   -.0324205
          5  |   .2488249   .0558651     4.45   0.000     .1393312    .3583186
          6  |   .0829462   .0423722     1.96   0.050    -.0001017    .1659942
          7  |   .0220179   .0581039     0.38   0.705    -.0918637    .1358996
          8  |   .0443004   .0407417     1.09   0.277    -.0355519    .1241526
          9  |   .1255638   .0487795     2.57   0.010     .0299578    .2211699
         10  |   .1710878   .0399367     4.28   0.000     .0928133    .2493624
         11  |   -.082277   .0796983    -1.03   0.302    -.2384828    .0739287
         12  |   .1139814   .1482112     0.77   0.442    -.1765072    .4044699
             |
         ind |
          5  |    .042505   .0392846     1.08   0.279    -.0344914    .1195015
          6  |   .0015247   .0509979     0.03   0.976    -.0984294    .1014788
          7  |   -.046133   .0962958    -0.48   0.632    -.2348694    .1426034
          8  |   .0680589   .0502893     1.35   0.176    -.0305063    .1666241
          9  |   .1362223   .1012141     1.35   0.178    -.0621536    .3345983
         10  |  -.0940575   .0570944    -1.65   0.099    -.2059605    .0178455
         11  |   .0604966   .0555642     1.09   0.276    -.0484072    .1694005
         12  |      .0994   .0509952     1.95   0.051    -.0005488    .1993489
         13  |   .1672111   .0743805     2.25   0.025      .021428    .3129942
         14  |  -.1094888   .0652669    -1.68   0.093    -.2374097     .018432
         15  |  -.0715518   .0661315    -1.08   0.279    -.2011671    .0580634
         16  |  -.0362335   .0538978    -0.67   0.501    -.1418712    .0694042
         17  |   .0587572   .2057441     0.29   0.775    -.3444939    .4620082
         18  |  -.0470361   .1371584    -0.34   0.732    -.3158617    .2217895
             |
    1.dunion |   .0571534   .0258046     2.21   0.027     .0065773    .1077295
  1.dmarital |   .0852135   .0509264     1.67   0.094    -.0146003    .1850274
             |
        year |
       2005  |   .0360379    .047511     0.76   0.448     -.057082    .1291578
       2006  |  -.0092437   .0469249    -0.20   0.844    -.1012147    .0827274
       2007  |   .0207945   .0455907     0.46   0.648    -.0685616    .1101505
       2008  |     .00446    .046606     0.10   0.924    -.0868862    .0958061
       2009  |   .0380653   .0436212     0.87   0.383    -.0474308    .1235613
       2010  |   .0224767   .0447251     0.50   0.615    -.0651828    .1101362
       2011  |   .0107642   .0435584     0.25   0.805    -.0746087     .096137
       2012  |   .0286587   .0458944     0.62   0.532    -.0612928    .1186101
       2013  |  -.0034096   .0473875    -0.07   0.943    -.0962874    .0894682
       2014  |   .0579803   .0465574     1.25   0.213    -.0332706    .1492311
             |
   schooling |
         12  |    .066222   .0929772     0.71   0.476      -.11601     .248454
         14  |   .0324008   .1103192     0.29   0.769    -.1838209    .2486225
         16  |   .1978072   .1182057     1.67   0.094    -.0338719    .4294862
             |
     2.dsize |          0  (omitted)
  1.dregular |   .3620001    .087391     4.14   0.000     .1907169    .5332834
       _cons |   6.275583   .2241913    27.99   0.000     5.836176     6.71499
------------------------------------------------------------------------------
Instrumented:  emptenure c.emptenure#c.emptenure oj workexp
               c.workexp#c.workexp
Instruments:   4.occ 5.occ 6.occ 7.occ 8.occ 9.occ 10.occ 11.occ 12.occ
               5.ind 6.ind 7.ind 8.ind 9.ind 10.ind 11.ind 12.ind 13.ind
               14.ind 15.ind 16.ind 17.ind 18.ind 1.dunion 1.dmarital
               2005.year 2006.year 2007.year 2008.year 2009.year 2010.year
               2011.year 2012.year 2013.year 2014.year 12.schooling
               14.schooling 16.schooling 1.dregular emptenureiv emptenureiv2
               ojiv workexpiv workexpiv2
(results olsrobLa are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      3,325
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |      .0363   .0548665     0.66   0.508    -.0712363    .1438364
          2  |   .0555312   .0539775     1.03   0.304    -.0502627     .161325
          3  |    .074306    .053325     1.39   0.163     -.030209     .178821
          4  |   .0926246   .0528874     1.75   0.080    -.0110328    .1962819
          5  |   .1104869   .0526412     2.10   0.036     .0073119    .2136618
          6  |   .1278929   .0525621     2.43   0.015      .024873    .2309127
          7  |   .1448426   .0526252     2.75   0.006     .0416991    .2479862
          8  |   .1613361   .0528064     3.06   0.002     .0578374    .2648347
          9  |   .1773733   .0530825     3.34   0.001     .0733335    .2814131
         10  |   .1929542   .0534319     3.61   0.000     .0882296    .2976788
         11  |   .2080788   .0538349     3.87   0.000     .1025644    .3135933
         12  |   .2227472   .0542737     4.10   0.000     .1163727    .3291217
         13  |   .2369593   .0547327     4.33   0.000     .1296853    .3442334
         14  |   .2507151   .0551982     4.54   0.000     .1425287    .3589016
         15  |   .2640147   .0556587     4.74   0.000     .1549256    .3731037
         16  |    .276858   .0561046     4.93   0.000     .1668949     .386821
         17  |    .289245   .0565282     5.12   0.000     .1784517    .4000383
         18  |   .3011757   .0569235     5.29   0.000     .1896076    .4127438
         19  |   .3126501   .0572862     5.46   0.000     .2003713     .424929
         20  |   .3236683   .0576135     5.62   0.000     .2107479    .4365888
         21  |   .3342302   .0579043     5.77   0.000     .2207399    .4477206
         22  |   .3443359   .0581588     5.92   0.000     .2303466    .4583251
         23  |   .3539852   .0583788     6.06   0.000     .2395648    .4684056
         24  |   .3631783   .0585674     6.20   0.000     .2483883    .4779683
         25  |   .3719151   .0587292     6.33   0.000     .2568081    .4870221
         26  |   .3801956     .05887     6.46   0.000     .2648126    .4955787
------------------------------------------------------------------------------
(results isvrobLa are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      3,325
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0447196    .083424     0.54   0.592    -.1187884    .2082275
          2  |   .0513797   .0814233     0.63   0.528     -.108207    .2109664
          3  |   .0577686   .0805448     0.72   0.473    -.1000963    .2156335
          4  |   .0638863   .0806709     0.79   0.428    -.0942259    .2219984
          5  |   .0697328   .0816545     0.85   0.393    -.0903071    .2297726
          6  |    .075308   .0833351     0.90   0.366    -.0880257    .2386417
          7  |   .0806121   .0855542     0.94   0.346    -.0870711    .2482953
          8  |   .0856449   .0881666     0.97   0.331    -.0871584    .2584482
          9  |   .0904065   .0910455     0.99   0.321    -.0880393    .2688523
         10  |   .0948969   .0940852     1.01   0.313    -.0895067    .2793005
         11  |   .0991161   .0972003     1.02   0.308    -.0913929    .2896251
         12  |   .1030641   .1003234     1.03   0.304    -.0935661    .2996942
         13  |   .1067408    .103403     1.03   0.302    -.0959253    .3094069
         14  |   .1101463   .1064011     1.04   0.301    -.0983959    .3186886
         15  |   .1132807   .1092909     1.04   0.300    -.1009256     .327487
         16  |   .1161438   .1120555     1.04   0.300     -.103481    .3357686
         17  |   .1187357    .114686     1.04   0.301    -.1060448    .3435162
         18  |   .1210563   .1171808     1.03   0.302    -.1086138    .3507265
         19  |   .1231058   .1195445     1.03   0.303    -.1111971    .3574087
         20  |    .124884   .1217877     1.03   0.305    -.1138155    .3635836
         21  |   .1263911   .1239262     1.02   0.308    -.1164999     .369282
         22  |   .1276269   .1259808     1.01   0.311     -.119291    .3745447
         23  |   .1285915    .127977     1.00   0.315    -.1222389    .3794218
         24  |   .1292849   .1299449     0.99   0.320    -.1254024    .3839721
         25  |    .129707   .1319185     0.98   0.325    -.1288486    .3882626
         26  |    .129858   .1339363     0.97   0.332    -.1326523    .3923683
------------------------------------------------------------------------------

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd $Inputfd

. 
. qui {

. 
end of do-file
/* small firm */
(4,278 observations deleted)

      dsize |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,626       63.98       63.98
          1 |      2,604       36.02      100.00
------------+-----------------------------------
      Total |      7,230      100.00

Linear regression                               Number of obs     =      5,276
                                                F(50, 5225)       =      47.06
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2902
                                                Root MSE          =     .45405

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         occ |
          2  |  -.0025355   .4259218    -0.01   0.995    -.8375204    .8324494
          3  |  -.2539452   .3643903    -0.70   0.486    -.9683027    .4604122
          4  |  -.3283804    .367285    -0.89   0.371    -1.048413    .3916518
          5  |   .1139495    .366994     0.31   0.756    -.6055121     .833411
          6  |  -.1897588   .3666763    -0.52   0.605    -.9085976      .52908
          7  |  -.3815296   .3675517    -1.04   0.299    -1.102085    .3390255
          8  |  -.2839075   .3665626    -0.77   0.439    -1.002523    .4347084
          9  |  -.1712469    .367619    -0.47   0.641    -.8919338    .5494401
         10  |   -.129813   .3670479    -0.35   0.724    -.8493803    .5897544
         11  |  -.4880582   .3691212    -1.32   0.186     -1.21169    .2355737
         12  |  -.2788895   .3769946    -0.74   0.459    -1.017956    .4601775
             |
         ind |
          2  |   .0327312   .2304739     0.14   0.887    -.4190941    .4845564
          3  |   .3960033   .3974968     1.00   0.319    -.3832566    1.175263
          4  |   .3998209   .3769512     1.06   0.289    -.3391611    1.138803
          5  |   .4552408   .3771237     1.21   0.227    -.2840793    1.194561
          6  |   .3644605   .3754086     0.97   0.332    -.3714974    1.100418
          7  |   .3628238   .3801784     0.95   0.340    -.3824847    1.108132
          8  |   .3016815   .3828258     0.79   0.431    -.4488171     1.05218
          9  |   .4912034   .3819214     1.29   0.198    -.2575222    1.239929
         10  |   .3711785    .377867     0.98   0.326    -.3695988    1.111956
         11  |   .5067639   .3783537     1.34   0.181    -.2349675    1.248495
         12  |   .5690946   .3794581     1.50   0.134     -.174802    1.312991
         13  |   .4433493   .3786835     1.17   0.242    -.2990287    1.185727
         14  |   .3501852    .377452     0.93   0.354    -.3897785    1.090149
         15  |   .5478479   .3790898     1.45   0.148    -.1953266    1.291022
         16  |   .4109281   .3767645     1.09   0.275    -.3276878    1.149544
         17  |   .3202807   .3968778     0.81   0.420    -.4577657    1.098327
         18  |   .4221635   .3840017     1.10   0.272    -.3306404    1.174967
             |
    1.dunion |   .0316009   .0177122     1.78   0.074    -.0031225    .0663242
  1.dmarital |   .1494011   .0174006     8.59   0.000     .1152887    .1835135
             |
        year |
       2005  |   .1375977   .0371814     3.70   0.000     .0647067    .2104888
       2006  |   .1373538    .035326     3.89   0.000        .0681    .2066075
       2007  |   .0837074   .0312742     2.68   0.007     .0223969     .145018
       2008  |   .0846759   .0314068     2.70   0.007     .0231054    .1462464
       2009  |   .1118239   .0288491     3.88   0.000     .0552675    .1683802
       2010  |   .0710776   .0285903     2.49   0.013     .0150286    .1271265
       2011  |   .0886424   .0287567     3.08   0.002     .0322673    .1450175
       2012  |   .0761058     .02785     2.73   0.006     .0215081    .1307034
       2013  |   .0813228   .0299599     2.71   0.007     .0225889    .1400567
       2014  |   .1057229   .0301269     3.51   0.000     .0466616    .1647842
             |
   schooling |
         12  |   .0486364   .0288147     1.69   0.091    -.0078525    .1051253
         14  |   .0636596   .0336936     1.89   0.059     -.002394    .1297132
         16  |   .1754657   .0316303     5.55   0.000     .1134571    .2374743
             |
     1.dsize |   .0824706   .0142683     5.78   0.000     .0544987    .1104424
  1.dregular |   .2071033   .0216169     9.58   0.000     .1647252    .2494815
   emptenure |   .0126564   .0023531     5.38   0.000     .0080433    .0172695
             |
 c.emptenure#|
 c.emptenure |    -.00013    .000064    -2.03   0.042    -.0002554   -4.54e-06
             |
          oj |   .0977688   .0310647     3.15   0.002      .036869    .1586686
     workexp |   .0206062   .0031722     6.50   0.000     .0143873     .026825
             |
   c.workexp#|
   c.workexp |  -.0003654   .0000602    -6.07   0.000    -.0004835   -.0002474
             |
       _cons |   6.251317   .1030972    60.64   0.000     6.049204    6.453431
------------------------------------------------------------------------------

Instrumental variables (2SLS) regression          Number of obs   =      5,276
                                                  Wald chi2(50)   =    1972.45
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.2687
                                                  Root MSE        =     .45862

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   emptenure |   .0028654   .0074205     0.39   0.699    -.0116785    .0174092
             |
 c.emptenure#|
 c.emptenure |  -.0000239   .0002046    -0.12   0.907    -.0004249     .000377
             |
          oj |   .0497158   .0530073     0.94   0.348    -.0541767    .1536083
     workexp |   .0352865   .0108313     3.26   0.001     .0140575    .0565156
             |
   c.workexp#|
   c.workexp |  -.0006987   .0001939    -3.60   0.000    -.0010788   -.0003187
             |
         occ |
          2  |   .0468079    .443608     0.11   0.916    -.8226478    .9162636
          3  |  -.3159693   .3351731    -0.94   0.346    -.9728965    .3409579
          4  |  -.3913774   .3355704    -1.17   0.243    -1.049083    .2663284
          5  |   .1162971   .3381646     0.34   0.731    -.5464933    .7790876
          6  |  -.2376488   .3371531    -0.70   0.481    -.8984567    .4231592
          7  |  -.4678696   .3354274    -1.39   0.163    -1.125295    .1895561
          8  |  -.3547117   .3368514    -1.05   0.292    -1.014928     .305505
          9  |  -.2376992   .3417783    -0.70   0.487    -.9075724     .432174
         10  |  -.1851221   .3388252    -0.55   0.585    -.8492073     .478963
         11  |  -.5647914   .3353885    -1.68   0.092    -1.222141    .0925579
         12  |  -.3465097   .3486215    -0.99   0.320    -1.029795    .3367757
             |
         ind |
          2  |   .0695729   .2271391     0.31   0.759    -.3756116    .5147573
          3  |   .2890386    .373404     0.77   0.439    -.4428198    1.020897
          4  |   .4153628   .3486452     1.19   0.234    -.2679693    1.098695
          5  |   .4783093   .3487426     1.37   0.170    -.2052136    1.161832
          6  |   .3930532   .3468715     1.13   0.257    -.2868025    1.072909
          7  |   .3540829   .3518623     1.01   0.314    -.3355546     1.04372
          8  |   .3430875   .3560644     0.96   0.335    -.3547858    1.040961
          9  |   .4886863    .358914     1.36   0.173    -.2147723    1.192145
         10  |   .3922852   .3497873     1.12   0.262    -.2932854    1.077856
         11  |   .5074603   .3500687     1.45   0.147    -.1786618    1.193582
         12  |   .5792977   .3517229     1.65   0.100    -.1100664    1.268662
         13  |   .4753418   .3518921     1.35   0.177     -.214354    1.165038
         14  |   .3419438   .3489524     0.98   0.327    -.3419903    1.025878
         15  |   .5664955   .3511337     1.61   0.107    -.1217138    1.254705
         16  |   .4255029   .3498695     1.22   0.224    -.2602287    1.111234
         17  |   .3535997    .373536     0.95   0.344    -.3785174    1.085717
         18  |   .4514473   .3594296     1.26   0.209    -.2530217    1.155916
             |
    1.dunion |     .04665   .0249921     1.87   0.062    -.0023337    .0956337
  1.dmarital |   .1640632   .0221102     7.42   0.000      .120728    .2073984
             |
        year |
       2005  |   .1297255   .0376433     3.45   0.001     .0559461     .203505
       2006  |   .1302702    .036141     3.60   0.000     .0594352    .2011053
       2007  |   .0826433   .0317636     2.60   0.009     .0203878    .1448987
       2008  |    .079816   .0328485     2.43   0.015     .0154341     .144198
       2009  |   .1078473   .0295806     3.65   0.000     .0498704    .1658243
       2010  |   .0655044   .0303907     2.16   0.031     .0059396    .1250691
       2011  |   .0883209   .0298629     2.96   0.003     .0297906    .1468512
       2012  |   .0801243   .0293601     2.73   0.006     .0225796    .1376689
       2013  |   .0865313   .0321504     2.69   0.007     .0235177    .1495448
       2014  |   .1134726   .0326433     3.48   0.001      .049493    .1774523
             |
   schooling |
         12  |  -.0234787   .0571777    -0.41   0.681     -.135545    .0885876
         14  |  -.0193466   .0723756    -0.27   0.789    -.1612001    .1225069
         16  |   .0811652   .0695162     1.17   0.243    -.0550841    .2174145
             |
     1.dsize |    .103677   .0224553     4.62   0.000     .0596654    .1476887
  1.dregular |   .2073745   .0644713     3.22   0.001      .081013     .333736
       _cons |   6.367894   .2643668    24.09   0.000     5.849744    6.886043
------------------------------------------------------------------------------
Instrumented:  emptenure c.emptenure#c.emptenure oj workexp
               c.workexp#c.workexp
Instruments:   2.occ 3.occ 4.occ 5.occ 6.occ 7.occ 8.occ 9.occ 10.occ 11.occ
               12.occ 2.ind 3.ind 4.ind 5.ind 6.ind 7.ind 8.ind 9.ind 10.ind
               11.ind 12.ind 13.ind 14.ind 15.ind 16.ind 17.ind 18.ind
               1.dunion 1.dmarital 2005.year 2006.year 2007.year 2008.year
               2009.year 2010.year 2011.year 2012.year 2013.year 2014.year
               12.schooling 14.schooling 16.schooling 1.dsize 1.dregular
               emptenureiv emptenureiv2 ojiv workexpiv workexpiv2
(results olsrobSm are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      5,276
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0977688   .0310647     3.15   0.002     .0368831    .1586545
          2  |   .1102952   .0302321     3.65   0.000     .0510413    .1695491
          3  |   .1225617   .0295814     4.14   0.000     .0645831    .1805402
          4  |   .1345682   .0290978     4.62   0.000     .0775376    .1915987
          5  |   .1463147    .028764     5.09   0.000     .0899384    .2026911
          6  |   .1578013   .0285612     5.53   0.000     .1018224    .2137803
          7  |    .169028   .0284699     5.94   0.000      .113228    .2248279
          8  |   .1799946   .0284704     6.32   0.000     .1241937    .2357956
          9  |   .1907014   .0285438     6.68   0.000     .1347566    .2466462
         10  |   .2011482   .0286724     7.02   0.000     .1449512    .2573451
         11  |    .211335   .0288402     7.33   0.000     .1548092    .2678608
         12  |   .2212619    .029033     7.62   0.000     .1643583    .2781654
         13  |   .2309288   .0292384     7.90   0.000     .1736225     .288235
         14  |   .2403357   .0294464     8.16   0.000     .1826219    .2980495
         15  |   .2494828   .0296484     8.41   0.000     .1913729    .3075926
         16  |   .2583698   .0298381     8.66   0.000     .1998881    .3168515
         17  |   .2669969   .0300109     8.90   0.000     .2081767    .3258172
         18  |   .2753641   .0301637     9.13   0.000     .2162443    .3344838
         19  |   .2834712   .0302952     9.36   0.000     .2240937    .3428488
         20  |   .2913185   .0304058     9.58   0.000     .2317243    .3509127
         21  |   .2989058   .0304972     9.80   0.000     .2391323    .3586792
         22  |   .3062331   .0305729    10.02   0.000     .2463113    .3661549
         23  |   .3133005   .0306378    10.23   0.000     .2532514    .3733495
         24  |   .3201079   .0306984    10.43   0.000     .2599401    .3802757
         25  |   .3266554   .0307628    10.62   0.000     .2663615    .3869493
         26  |   .3329429   .0308403    10.80   0.000     .2724969    .3933888
------------------------------------------------------------------------------
(results isvrobSm are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      5,276
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0497158   .0530073     0.94   0.348    -.0541767    .1536083
          2  |   .0525572   .0504102     1.04   0.297    -.0462449    .1513593
          3  |   .0553508   .0488093     1.13   0.257    -.0403136    .1510152
          4  |   .0580964   .0481905     1.21   0.228    -.0363551     .152548
          5  |   .0607942   .0484889     1.25   0.210    -.0342423    .1558307
          6  |   .0634441   .0495981     1.28   0.201    -.0337664    .1606546
          7  |   .0660461   .0513886     1.29   0.199    -.0346737    .1667659
          8  |   .0686002    .053728     1.28   0.202    -.0367047    .1739051
          9  |   .0711064   .0564959     1.26   0.208    -.0396234    .1818363
         10  |   .0735648   .0595913     1.23   0.217    -.0432321    .1903616
         11  |   .0759752   .0629351     1.21   0.227    -.0473753    .1993256
         12  |   .0783378   .0664677     1.18   0.239    -.0519366    .2086121
         13  |   .0806524   .0701473     1.15   0.250    -.0568337    .2181386
         14  |   .0829192   .0739457     1.12   0.262    -.0620117    .2278501
         15  |   .0851381   .0778463     1.09   0.274    -.0674378     .237714
         16  |   .0873091   .0818412     1.07   0.286    -.0730967    .2477149
         17  |   .0894322   .0859296     1.04   0.298    -.0789868    .2578512
         18  |   .0915074   .0901161     1.02   0.310     -.085117    .2681318
         19  |   .0935348   .0944095     0.99   0.322    -.0915045     .278574
         20  |   .0955142   .0988218     0.97   0.334     -.098173    .2892014
         21  |   .0974458   .1033674     0.94   0.346    -.1051507    .3000422
         22  |   .0993295   .1080626     0.92   0.358    -.1124694    .3111283
         23  |   .1011652   .1129247     0.90   0.370    -.1201631    .3224936
         24  |   .1029531   .1179719     0.87   0.383    -.1282675    .3341737
         25  |   .1046931   .1232225     0.85   0.396    -.1368186    .3462049
         26  |   .1063853   .1286952     0.83   0.408    -.1458526    .3586231
------------------------------------------------------------------------------

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd $Inputfd

. 
. qui {

. 
end of do-file
/* regular employee */
(1,248 observations deleted)

   dregular |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     10,134      100.00      100.00
------------+-----------------------------------
      Total |     10,134      100.00
note: 1.dregular omitted because of collinearity

Linear regression                               Number of obs     =      7,708
                                                F(50, 7657)       =      60.74
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2922
                                                Root MSE          =     .46616

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         occ |
          2  |   .2069745   .4260781     0.49   0.627    -.6282553    1.042204
          3  |  -.0613774   .3679911    -0.17   0.868    -.7827407    .6599859
          4  |  -.1251521    .370321    -0.34   0.735    -.8510828    .6007785
          5  |   .2280833   .3693345     0.62   0.537    -.4959135      .95208
          6  |   .0068774   .3692573     0.02   0.985    -.7169681    .7307229
          7  |  -.1079643   .3698745    -0.29   0.770    -.8330196     .617091
          8  |  -.0525777   .3692665    -0.14   0.887    -.7764412    .6712859
          9  |    .055214   .3697253     0.15   0.881    -.6695489    .7799769
         10  |   .0753987   .3694364     0.20   0.838    -.6487978    .7995952
         11  |   -.176026   .3708528    -0.47   0.635    -.9029991    .5509471
         12  |  -.0927698   .3786432    -0.25   0.806    -.8350141    .6494746
             |
         ind |
          2  |  -.1970157   .2602321    -0.76   0.449    -.7071418    .3131104
          3  |   .2305987   .4004903     0.58   0.565    -.5544719    1.015669
          4  |   .1939936   .3795823     0.51   0.609    -.5500916    .9380787
          5  |   .2551429   .3796597     0.67   0.502    -.4890941    .9993798
          6  |   .2020052    .378791     0.53   0.594    -.5405289    .9445392
          7  |   .1565929    .382426     0.41   0.682    -.5930668    .9062526
          8  |   .2283449   .3804548     0.60   0.548    -.5174508    .9741405
          9  |   .3914676   .3830351     1.02   0.307     -.359386    1.142321
         10  |    .148734   .3801086     0.39   0.696     -.596383     .893851
         11  |    .270096   .3804234     0.71   0.478    -.4756381     1.01583
         12  |   .3528419   .3805718     0.93   0.354     -.393183    1.098867
         13  |   .3207979   .3812329     0.84   0.400    -.4265229    1.068119
         14  |    .173612   .3801149     0.46   0.648    -.5715173    .9187413
         15  |   .2978878    .381206     0.78   0.435    -.4493803    1.045156
         16  |    .226847   .3794984     0.60   0.550    -.5170738    .9707679
         17  |    .132274   .3996678     0.33   0.741    -.6511843    .9157323
         18  |   .2520338   .3855382     0.65   0.513    -.5037266    1.007794
             |
    1.dunion |   .0404066    .013093     3.09   0.002     .0147407    .0660725
  1.dmarital |   .1484898   .0160168     9.27   0.000     .1170925    .1798872
             |
        year |
       2005  |    .104308   .0303597     3.44   0.001     .0447945    .1638214
       2006  |   .0897635   .0301544     2.98   0.003     .0306528    .1488743
       2007  |   .0649737   .0272303     2.39   0.017     .0115949    .1183525
       2008  |   .0695369   .0274527     2.53   0.011     .0157222    .1233517
       2009  |   .0889169   .0246374     3.61   0.000     .0406208    .1372131
       2010  |   .0565978   .0253654     2.23   0.026     .0068747    .1063209
       2011  |    .067646   .0247688     2.73   0.006     .0190924    .1161996
       2012  |   .0696785   .0249354     2.79   0.005     .0207983    .1185588
       2013  |   .0653297   .0262625     2.49   0.013      .013848    .1168115
       2014  |   .1033122   .0257904     4.01   0.000     .0527559    .1538684
             |
   schooling |
         12  |   .1181606   .0325577     3.63   0.000     .0543384    .1819827
         14  |   .1233957    .036224     3.41   0.001     .0523867    .1944047
         16  |   .2534528   .0344507     7.36   0.000       .18592    .3209855
             |
       dsize |
          1  |   .0839249    .014869     5.64   0.000     .0547776    .1130723
          2  |   .2260572   .0152656    14.81   0.000     .1961326    .2559819
             |
  1.dregular |          0  (omitted)
   emptenure |   .0138003    .002132     6.47   0.000      .009621    .0179797
             |
 c.emptenure#|
 c.emptenure |  -.0001107   .0000557    -1.99   0.047      -.00022   -1.44e-06
             |
          oj |   .0882717   .0340055     2.60   0.009     .0216115    .1549318
     workexp |   .0212954   .0029841     7.14   0.000     .0154457    .0271451
             |
   c.workexp#|
   c.workexp |  -.0003571   .0000588    -6.07   0.000    -.0004724   -.0002418
             |
       _cons |   6.356878   .1021557    62.23   0.000     6.156625    6.557132
------------------------------------------------------------------------------
note: 1.dregular omitted because of collinearity

Instrumental variables (2SLS) regression          Number of obs   =      7,708
                                                  Wald chi2(50)   =    2359.98
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.2670
                                                  Root MSE        =     .47281

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   emptenure |   .0024639   .0062336     0.40   0.693    -.0097537    .0146815
             |
 c.emptenure#|
 c.emptenure |  -.0000723   .0001659    -0.44   0.663    -.0003975    .0002529
             |
          oj |   .0548646   .0577796     0.95   0.342    -.0583814    .1681106
     workexp |   .0397693   .0087378     4.55   0.000     .0226436     .056895
             |
   c.workexp#|
   c.workexp |  -.0006309   .0001589    -3.97   0.000    -.0009423   -.0003195
             |
         occ |
          2  |   .2418681   .4190194     0.58   0.564     -.579395    1.063131
          3  |  -.0787304   .3544042    -0.22   0.824    -.7733498    .6158891
          4  |  -.1586152   .3555905    -0.45   0.656    -.8555599    .5383294
          5  |   .2586556   .3549605     0.73   0.466    -.4370541    .9543653
          6  |   .0026689   .3548554     0.01   0.994    -.6928348    .6981726
          7  |   -.170529   .3552299    -0.48   0.631    -.8667669    .5257088
          8  |  -.0801719    .355418    -0.23   0.822    -.7767784    .6164347
          9  |   .0398562   .3564531     0.11   0.911    -.6587791    .7384914
         10  |   .0694901   .3556525     0.20   0.845    -.6275759    .7665561
         11  |  -.2450008   .3554168    -0.69   0.491    -.9416049    .4516033
         12  |   -.112861   .3650844    -0.31   0.757    -.8284133    .6026914
             |
         ind |
          2  |  -.1004213   .2777901    -0.36   0.718    -.6448798    .4440372
          3  |   .1620661    .394003     0.41   0.681    -.6101655    .9342977
          4  |   .2305561    .367594     0.63   0.531    -.4899148     .951027
          5  |   .3033108   .3678371     0.82   0.410    -.4176366    1.024258
          6  |   .2563113    .367067     0.70   0.485    -.4631268    .9757494
          7  |    .173945   .3700742     0.47   0.638    -.5513871    .8992772
          8  |   .2609733   .3682179     0.71   0.478    -.4607205    .9826672
          9  |   .3794621   .3723914     1.02   0.308    -.3504116    1.109336
         10  |   .1825038   .3680466     0.50   0.620    -.5388544    .9038619
         11  |   .3123006   .3684601     0.85   0.397    -.4098679    1.034469
         12  |   .3900261   .3692069     1.06   0.291    -.3336062    1.113658
         13  |   .3528881   .3696092     0.95   0.340    -.3715326    1.077309
         14  |   .1865208   .3676938     0.51   0.612    -.5341458    .9071874
         15  |   .3322489   .3694797     0.90   0.369    -.3919181    1.056416
         16  |    .238466   .3675356     0.65   0.516    -.4818904    .9588225
         17  |   .1931154   .3895726     0.50   0.620    -.5704328    .9566637
         18  |   .2593645    .374361     0.69   0.488    -.4743696    .9930986
             |
    1.dunion |   .0720238    .017679     4.07   0.000     .0373736     .106674
  1.dmarital |    .152319   .0220776     6.90   0.000     .1090477    .1955902
             |
        year |
       2005  |   .1002829   .0311678     3.22   0.001     .0391951    .1613707
       2006  |   .0882906   .0308687     2.86   0.004     .0277891    .1487921
       2007  |   .0623515   .0278847     2.24   0.025     .0076984    .1170045
       2008  |   .0590861    .029098     2.03   0.042      .002055    .1161172
       2009  |   .0841697   .0255972     3.29   0.001         .034    .1343393
       2010  |   .0503845    .026514     1.90   0.057     -.001582    .1023509
       2011  |   .0675652   .0261478     2.58   0.010     .0163164     .118814
       2012  |    .069717   .0265102     2.63   0.009      .017758    .1216761
       2013  |   .0648566   .0283681     2.29   0.022     .0092562    .1204569
       2014  |   .1055116   .0282229     3.74   0.000     .0501957    .1608276
             |
   schooling |
         12  |   .1192432   .0485571     2.46   0.014     .0240731    .2144133
         14  |   .1237324    .058134     2.13   0.033     .0097919    .2376729
         16  |   .2407073   .0585591     4.11   0.000     .1259336     .355481
             |
       dsize |
          1  |   .1163892   .0190465     6.11   0.000     .0790587    .1537196
          2  |   .2795549   .0258078    10.83   0.000     .2289725    .3301373
             |
  1.dregular |          0  (omitted)
       _cons |   6.230331   .1828265    34.08   0.000     5.871998    6.588664
------------------------------------------------------------------------------
Instrumented:  emptenure c.emptenure#c.emptenure oj workexp
               c.workexp#c.workexp
Instruments:   2.occ 3.occ 4.occ 5.occ 6.occ 7.occ 8.occ 9.occ 10.occ 11.occ
               12.occ 2.ind 3.ind 4.ind 5.ind 6.ind 7.ind 8.ind 9.ind 10.ind
               11.ind 12.ind 13.ind 14.ind 15.ind 16.ind 17.ind 18.ind
               1.dunion 1.dmarital 2005.year 2006.year 2007.year 2008.year
               2009.year 2010.year 2011.year 2012.year 2013.year 2014.year
               12.schooling 14.schooling 16.schooling 1.dsize 2.dsize
               emptenureiv emptenureiv2 ojiv workexpiv workexpiv2
(results olsrobRg are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      7,708
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0882717   .0340055     2.60   0.009     .0216221    .1549213
          2  |   .1019613   .0332676     3.06   0.002      .036758    .1671646
          3  |   .1154296   .0326706     3.53   0.000     .0513963    .1794628
          4  |   .1286764   .0322032     4.00   0.000     .0655594    .1917935
          5  |   .1417019   .0318526     4.45   0.000      .079272    .2041318
          6  |    .154506   .0316055     4.89   0.000     .0925605    .2164516
          7  |   .1670887   .0314481     5.31   0.000     .1054516    .2287258
          8  |     .17945   .0313667     5.72   0.000     .1179724    .2409277
          9  |   .1915899   .0313481     6.11   0.000     .1301487    .2530312
         10  |   .2035085   .0313798     6.49   0.000     .1420052    .2650117
         11  |   .2152056   .0314501     6.84   0.000     .1535646    .2768466
         12  |   .2266814   .0315485     7.19   0.000     .1648475    .2885153
         13  |   .2379357   .0316657     7.51   0.000      .175872    .2999995
         14  |   .2489687   .0317939     7.83   0.000     .1866539    .3112835
         15  |   .2597803   .0319261     8.14   0.000     .1972064    .3223542
         16  |   .2703705   .0320569     8.43   0.000     .2075401    .3332009
         17  |   .2807393   .0321822     8.72   0.000     .2176633    .3438152
         18  |   .2908867   .0322989     9.01   0.000     .2275821    .3541914
         19  |   .3008127   .0324052     9.28   0.000     .2372998    .3643257
         20  |   .3105174   .0325004     9.55   0.000     .2468178     .374217
         21  |   .3200006    .032585     9.82   0.000     .2561351    .3838661
         22  |   .3292625   .0326607    10.08   0.000     .2652486    .3932764
         23  |   .3383029   .0327302    10.34   0.000     .2741529     .402453
         24  |    .347122   .0327973    10.58   0.000     .2828405    .4114035
         25  |   .3557197   .0328669    10.82   0.000     .2913017    .4201377
         26  |    .364096   .0329451    11.05   0.000     .2995248    .4286672
------------------------------------------------------------------------------
(results isvrobRg are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      7,708
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0548646   .0577796     0.95   0.342    -.0583814    .1681106
          2  |   .0572562    .055689     1.03   0.304    -.0518923    .1664047
          3  |   .0595032   .0542229     1.10   0.272    -.0467717    .1657782
          4  |   .0616057   .0533507     1.15   0.248    -.0429597    .1661711
          5  |   .0635635   .0530252     1.20   0.231     -.040364    .1674911
          6  |   .0653768   .0531867     1.23   0.219    -.0388673    .1696208
          7  |   .0670454   .0537677     1.25   0.212    -.0383374    .1724282
          8  |   .0685694    .054699     1.25   0.210    -.0386387    .1757776
          9  |   .0699489   .0559144     1.25   0.211    -.0396413     .179539
         10  |   .0711837   .0573539     1.24   0.215    -.0412278    .1835952
         11  |   .0722739   .0589661     1.23   0.220    -.0432975    .1878454
         12  |   .0732196   .0607087     1.21   0.228    -.0457672    .1922064
         13  |   .0740206   .0625482     1.18   0.237    -.0485716    .1966128
         14  |    .074677   .0644597     1.16   0.247    -.0516617    .2010157
         15  |   .0751889   .0664257     1.13   0.258    -.0550032    .2053809
         16  |   .0755561   .0684355     1.10   0.270     -.058575    .2096872
         17  |   .0757787    .070484     1.08   0.282    -.0623674    .2139249
         18  |   .0758568   .0725715     1.05   0.296    -.0663807    .2180942
         19  |   .0757902   .0747022     1.01   0.310    -.0706234    .2222038
         20  |    .075579   .0768844     0.98   0.326    -.0751117    .2262698
         21  |   .0752233   .0791295     0.95   0.342    -.0798678    .2303143
         22  |   .0747229   .0814515     0.92   0.359    -.0849192     .234365
         23  |   .0740779   .0838667     0.88   0.377    -.0902977    .2384536
         24  |   .0732884   .0863929     0.85   0.396    -.0960386    .2426153
         25  |   .0723542   .0890495     0.81   0.416    -.1021796     .246888
         26  |   .0712754   .0918566     0.78   0.438    -.1087602    .2513111
------------------------------------------------------------------------------
. *** plot
. qui coefplot (olsrobnYn, label(OLS)) (isvrobnYn, label(IV)), bylabel(Under 60-y
> ear-old) ///
> || (olsrobnRg, label(OLS)) (isvrobnRg, label(IV)), bylabel(Regular Employee) //
> /
> || (olsrobnPr, label(OLS)) (isvrobnPr, label(IV)), bylabel(Non-Professional) //
> /
> || (olsrobnLa, label(OLS)) (isvrobnLa, label(IV)), bylabel(Large Firm (Size>=50
> 0)) ///
> || (olsrobnSm, label(OLS)) (isvrobnSm, label(IV)), bylabel(Small Firm (Size<500
> )) ///
> ||, `comSetPlot'
. graph export "$Output\plot_as_emp_rob.pdf", replace
(file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Ou
> tput\plot_as_emp_rob.pdf written in PDF format)
. 
. 
. ** output tex all results
. qui{
. }

. 
. 
. 
. * 3. OLS->AS / tenure as dummy
. {
. ** tenure>=1, >=3, >=5, >=10, >=15
. *** simple dummy
. do "$Code\ReadData.do"

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd $Inputfd

. 
. qui {

. 
end of do-file
. sort empid year
. replace emptenure=40 if emptenure>=40
(1,216 real changes made)
. est sto olsrobRg
. dis " /* simple dummy */ "
 /* simple dummy */ 
. reg ///
>         `commonVar' ///
>         i.emptenure c.workexp##c.workexp ///
>         , vce(r)

Linear regression                               Number of obs     =      9,437
                                                F(88, 9348)       =      59.30
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3356
                                                Root MSE          =     .46371

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         occ |
          2  |   .0067561   .3347556     0.02   0.984    -.6494378    .6629501
          3  |  -.1048954   .2871873    -0.37   0.715    -.6678451    .4580544
          4  |  -.1841494   .2885428    -0.64   0.523    -.7497562    .3814574
          5  |    .209758   .2881397     0.73   0.467    -.3550585    .7745745
          6  |  -.0122998   .2879788    -0.04   0.966     -.576801    .5522014
          7  |  -.1518679   .2885277    -0.53   0.599    -.7174451    .4137092
          8  |  -.0900741   .2878509    -0.31   0.754    -.6543246    .4741764
          9  |   .0194617   .2886912     0.07   0.946    -.5464358    .5853593
         10  |   .0462789    .288096     0.16   0.872     -.518452    .6110098
         11  |  -.2474241   .2895596    -0.85   0.393     -.815024    .3201758
         12  |  -.0508389   .2950813    -0.17   0.863    -.6292625    .5275848
             |
         ind |
          2  |   .0216278    .218721     0.10   0.921    -.4071131    .4503686
          3  |   .2882358   .3238039     0.89   0.373    -.3464904    .9229619
          4  |   .2850115   .3025245     0.94   0.346    -.3080023    .8780254
          5  |   .3481828   .3028784     1.15   0.250    -.2455248    .9418904
          6  |   .2793371   .3024659     0.92   0.356     -.313562    .8722362
          7  |   .2512836   .3053312     0.82   0.411     -.347232    .8497992
          8  |   .3518624   .3039628     1.16   0.247     -.243971    .9476957
          9  |   .4240774   .3064522     1.38   0.166    -.1766357     1.02479
         10  |    .246082   .3033735     0.81   0.417     -.348596    .8407601
         11  |   .3722785   .3037682     1.23   0.220    -.2231733    .9677303
         12  |   .4278823    .303933     1.41   0.159    -.1678925    1.023657
         13  |   .3912156    .304747     1.28   0.199    -.2061549     .988586
         14  |   .2453363   .3032876     0.81   0.419    -.3491735     .839846
         15  |   .3816679   .3043748     1.25   0.210    -.2149729    .9783087
         16  |   .2971675    .302756     0.98   0.326    -.2963002    .8906352
         17  |   .2484002   .3226498     0.77   0.441    -.3840636     .880864
         18  |   .3569745   .3090804     1.15   0.248    -.2488903    .9628393
             |
    1.dunion |   .0415008   .0119818     3.46   0.001     .0180138    .0649878
  1.dmarital |   .1442453   .0137361    10.50   0.000     .1173196    .1711711
             |
        year |
       2005  |   .0792358    .027313     2.90   0.004     .0256965    .1327752
       2006  |   .0720926   .0267673     2.69   0.007     .0196228    .1245623
       2007  |   .0447561   .0242544     1.85   0.065    -.0027879       .0923
       2008  |   .0441879   .0246642     1.79   0.073    -.0041594    .0925351
       2009  |     .08357   .0222408     3.76   0.000     .0399731    .1271668
       2010  |   .0442549   .0227194     1.95   0.051    -.0002801    .0887898
       2011  |   .0583558   .0224617     2.60   0.009     .0143259    .1023857
       2012  |   .0463826   .0221779     2.09   0.037     .0029092    .0898561
       2013  |   .0381595   .0235369     1.62   0.105    -.0079779    .0842969
       2014  |   .0764109   .0232667     3.28   0.001     .0308031    .1220187
             |
   schooling |
         12  |    .111793   .0242466     4.61   0.000     .0642643    .1593216
         14  |   .1257121   .0283494     4.43   0.000      .070141    .1812832
         16  |   .2415514   .0263605     9.16   0.000      .189879    .2932237
             |
       dsize |
          1  |    .090492    .013398     6.75   0.000     .0642291    .1167549
          2  |   .2245397   .0133727    16.79   0.000     .1983263    .2507532
             |
  1.dregular |   .2754437   .0173641    15.86   0.000     .2414062    .3094812
             |
   emptenure |
          1  |  -.0064277   .0334882    -0.19   0.848    -.0720719    .0592165
          2  |   .0015987   .0325814     0.05   0.961     -.062268    .0654654
          3  |   .0837656   .0353497     2.37   0.018     .0144726    .1530587
          4  |   .0706555   .0341492     2.07   0.039     .0037157    .1375953
          5  |   .0961401   .0336674     2.86   0.004     .0301447    .1621355
          6  |   .0607942   .0370165     1.64   0.101    -.0117662    .1333547
          7  |   .0982003   .0370276     2.65   0.008     .0256182    .1707824
          8  |    .073104   .0361651     2.02   0.043     .0022126    .1439954
          9  |   .1283496   .0382957     3.35   0.001     .0532817    .2034174
         10  |   .1467953   .0384994     3.81   0.000     .0713282    .2222625
         11  |   .1788159   .0394169     4.54   0.000     .1015503    .2560816
         12  |   .2260323   .0410686     5.50   0.000     .1455288    .3065357
         13  |   .1838519   .0407442     4.51   0.000     .1039843    .2637194
         14  |   .1773431   .0398986     4.44   0.000     .0991332     .255553
         15  |   .1988892   .0399277     4.98   0.000     .1206223    .2771561
         16  |   .1540794   .0385301     4.00   0.000      .078552    .2296067
         17  |   .2081891   .0373538     5.57   0.000     .1349675    .2814107
         18  |    .220414   .0387719     5.68   0.000     .1444126    .2964155
         19  |   .2550156   .0414471     6.15   0.000     .1737703    .3362609
         20  |    .243829   .0425166     5.73   0.000     .1604873    .3271708
         21  |   .2315611   .0409183     5.66   0.000     .1513524    .3117698
         22  |   .1963707   .0405023     4.85   0.000     .1169773     .275764
         23  |    .202733   .0417824     4.85   0.000     .1208304    .2846355
         24  |   .2176798   .0408114     5.33   0.000     .1376806     .297679
         25  |   .2809234   .0477366     5.88   0.000     .1873493    .3744975
         26  |   .3402681   .0464648     7.32   0.000     .2491869    .4313493
         27  |   .2813999   .0491341     5.73   0.000     .1850864    .3777134
         28  |   .3076828    .051257     6.00   0.000     .2072079    .4081576
         29  |   .3661836   .0531637     6.89   0.000     .2619711     .470396
         30  |   .3223041   .0458776     7.03   0.000     .2323739    .4122342
         31  |   .3370082   .0437398     7.70   0.000     .2512687    .4227476
         32  |   .3621852   .0458022     7.91   0.000     .2724028    .4519675
         33  |   .2850237   .0567551     5.02   0.000     .1737713    .3962761
         34  |   .3306486   .0482635     6.85   0.000     .2360417    .4252556
         35  |   .2667043   .0597468     4.46   0.000     .1495875     .383821
         36  |   .4168587   .0487941     8.54   0.000     .3212115    .5125058
         37  |   .4220115   .0498033     8.47   0.000     .3243862    .5196368
         38  |   .3086499   .0640101     4.82   0.000     .1831762    .4341236
         39  |   .3521811    .063569     5.54   0.000     .2275719    .4767902
         40  |   .2364457   .0296365     7.98   0.000     .1783517    .2945396
             |
     workexp |   .0190403   .0024047     7.92   0.000     .0143266    .0237539
             |
   c.workexp#|
   c.workexp |  -.0003015    .000046    -6.55   0.000    -.0003917   -.0002114
             |
       _cons |   6.154832   .1027834    59.88   0.000     5.953354     6.35631
------------------------------------------------------------------------------
. est sto Dm
. 
. *** same equation as AS
. do "$Code\ReadData.do"

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd $Inputfd

. 
. qui {

. 
end of do-file
. sort empid year
. numlist "1 2 5 10 15 20 25 30"
. local tendm "`r(numlist)'"
. **** make emptenure dummy
. foreach i of local tendm {
  2.         gen emp`i'=1 if emptenure>=`i'
  3.         replace emp`i'=0 if emp`i'==.
  4. }
(694 missing values generated)
(694 real changes made)
(1,287 missing values generated)
(1,287 real changes made)
(2,738 missing values generated)
(2,738 real changes made)
(4,582 missing values generated)
(4,582 real changes made)
(5,948 missing values generated)
(5,948 real changes made)
(7,241 missing values generated)
(7,241 real changes made)
(8,413 missing values generated)
(8,413 real changes made)
(9,221 missing values generated)
(9,221 real changes made)
. dis " /* OLS dummy */ "
 /* OLS dummy */ 
. reg ///
>         `commonVar' ///
>         emp1 emp2 emp5 emp10 emp15 emp20 emp25 emp30 ///
>         c.workexp##c.workexp ///
>         , vce(r)

Linear regression                               Number of obs     =      9,437
                                                F(56, 9380)       =      88.64
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3318
                                                Root MSE          =     .46424

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         occ |
          2  |  -.0048006   .3521388    -0.01   0.989    -.6950691     .685468
          3  |  -.1179552   .2956548    -0.40   0.690    -.6975027    .4615922
          4  |  -.2016047   .2969947    -0.68   0.497    -.7837788    .3805694
          5  |   .2029619   .2965354     0.68   0.494    -.3783118    .7842355
          6  |   -.026391    .296475    -0.09   0.929    -.6075463    .5547644
          7  |  -.1702126   .2970294    -0.57   0.567    -.7524547    .4120295
          8  |    -.10475   .2963344    -0.35   0.724    -.6856296    .4761296
          9  |   .0087698    .297105     0.03   0.976    -.5736205      .59116
         10  |   .0320044   .2965582     0.11   0.914     -.549314    .6133228
         11  |  -.2636694   .2980151    -0.88   0.376    -.8478436    .3205048
         12  |  -.0690878   .3034021    -0.23   0.820    -.6638217     .525646
             |
         ind |
          2  |   .0363793   .2247389     0.16   0.871    -.4041576    .4769162
          3  |   .3025307   .3342485     0.91   0.365    -.3526689    .9577302
          4  |    .303638   .3113246     0.98   0.329    -.3066256    .9139017
          5  |   .3659211   .3116398     1.17   0.240    -.2449605    .9768028
          6  |   .2995804   .3111555     0.96   0.336    -.3103519    .9095128
          7  |   .2712994   .3139843     0.86   0.388    -.3441779    .8867766
          8  |   .3711706   .3125904     1.19   0.235    -.2415744    .9839156
          9  |   .4331102   .3149338     1.38   0.169    -.1842284    1.050449
         10  |    .266501   .3121502     0.85   0.393    -.3453811    .8783831
         11  |   .3920499   .3125037     1.25   0.210    -.2205252    1.004625
         12  |   .4475752   .3126943     1.43   0.152    -.1653735    1.060524
         13  |   .4147394    .313504     1.32   0.186    -.1997963    1.029275
         14  |   .2617203   .3120283     0.84   0.402    -.3499228    .8733634
         15  |   .4060996   .3131239     1.30   0.195    -.2076911     1.01989
         16  |   .3144613   .3115094     1.01   0.313    -.2961647    .9250872
         17  |   .2790456   .3309287     0.84   0.399    -.3696465    .9277378
         18  |   .3750551    .317404     1.18   0.237    -.2471256    .9972357
             |
    1.dunion |   .0442956   .0119851     3.70   0.000     .0208022     .067789
  1.dmarital |   .1435199   .0137579    10.43   0.000     .1165514    .1704884
             |
        year |
       2005  |   .0775965   .0273425     2.84   0.005     .0239993    .1311938
       2006  |    .072611   .0267528     2.71   0.007     .0201698    .1250522
       2007  |   .0446012   .0243243     1.83   0.067    -.0030797     .092282
       2008  |   .0446717   .0246678     1.81   0.070    -.0036825     .093026
       2009  |   .0820189   .0222175     3.69   0.000     .0384678    .1255699
       2010  |   .0436193   .0227284     1.92   0.055    -.0009333     .088172
       2011  |   .0561855   .0224364     2.50   0.012     .0122052    .1001657
       2012  |   .0454616   .0222139     2.05   0.041     .0019176    .0890056
       2013  |   .0372115   .0235942     1.58   0.115    -.0090383    .0834612
       2014  |   .0779281   .0232889     3.35   0.001     .0322768    .1235793
             |
   schooling |
         12  |   .1183648   .0242396     4.88   0.000       .07085    .1658797
         14  |    .132508     .02831     4.68   0.000     .0770142    .1880018
         16  |   .2471687   .0263697     9.37   0.000     .1954784    .2988591
             |
       dsize |
          1  |   .0929708     .01338     6.95   0.000      .066743    .1191985
          2  |    .228941   .0133923    17.09   0.000     .2026892    .2551929
             |
  1.dregular |   .2835524   .0173042    16.39   0.000     .2496323    .3174725
        emp1 |  -.0076257   .0334741    -0.23   0.820    -.0732422    .0579908
        emp2 |   .0567248    .026857     2.11   0.035     .0040793    .1093703
        emp5 |   .0400632   .0183095     2.19   0.029     .0041726    .0759539
       emp10 |   .0890931   .0183201     4.86   0.000     .0531816    .1250045
       emp15 |   .0215969   .0192228     1.12   0.261     -.016084    .0592778
       emp20 |   .0104341   .0195519     0.53   0.594    -.0278919    .0487601
       emp25 |    .091916   .0235182     3.91   0.000     .0458152    .1380168
       emp30 |  -.0289319   .0217384    -1.33   0.183    -.0715438      .01368
     workexp |     .02018   .0023684     8.52   0.000     .0155374    .0248225
             |
   c.workexp#|
   c.workexp |  -.0003138   .0000455    -6.90   0.000     -.000403   -.0002246
             |
       _cons |   6.120385   .1045292    58.55   0.000     5.915485    6.325285
------------------------------------------------------------------------------
. est sto olsempD
. 
. *** AS
. qui {
. dis " /* AS's IV dummy */ "
 /* AS's IV dummy */ 
. ivregress 2sls ///
>                 `commonVar' ///
>                 (emp1 emp2 emp5 emp10 emp15 emp20 emp25 emp30 ///
>                 c.workexp##c.workexp = ///
>                 empiv1 empiv2 empiv5 empiv10 empiv15 empiv20 empiv25 empiv30 //
> /
>                 workexpiv workexpiv2) ///
>                 , vce(r)

Instrumental variables (2SLS) regression          Number of obs   =      9,437
                                                  Wald chi2(56)   =    4281.04
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.3176
                                                  Root MSE        =     .46771

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        emp1 |   .0207086   .0421726     0.49   0.623    -.0619482    .1033654
        emp2 |   .0060281   .0305055     0.20   0.843    -.0537616    .0658178
        emp5 |   .0395408   .0255489     1.55   0.122    -.0105341    .0896156
       emp10 |   .0079775   .0266197     0.30   0.764    -.0441962    .0601512
       emp15 |  -.0012686   .0298645    -0.04   0.966    -.0598019    .0572648
       emp20 |   .0008205   .0294548     0.03   0.978    -.0569098    .0585508
       emp25 |   .0457938   .0343704     1.33   0.183    -.0215709    .1131585
       emp30 |    .037137   .0371213     1.00   0.317    -.0356195    .1098935
     workexp |   .0434168   .0072158     6.02   0.000     .0292741    .0575594
             |
   c.workexp#|
   c.workexp |  -.0007808   .0001293    -6.04   0.000    -.0010342   -.0005274
             |
         occ |
          2  |   .0018803   .3849038     0.00   0.996    -.7525174     .756278
          3  |  -.1476225   .2799944    -0.53   0.598    -.6964015    .4011566
          4  |  -.2280954   .2810511    -0.81   0.417    -.7789455    .3227547
          5  |   .1981974   .2798622     0.71   0.479    -.3503225    .7467173
          6  |  -.0461661   .2802449    -0.16   0.869    -.5954361    .5031039
          7  |  -.2152848   .2816473    -0.76   0.445    -.7673034    .3367338
          8  |  -.1412193   .2807557    -0.50   0.615    -.6914903    .4090518
          9  |  -.0262091    .282025    -0.09   0.926    -.5789678    .5265497
         10  |   .0102078   .2808792     0.04   0.971    -.5403052    .5607209
         11  |  -.3050792   .2829131    -1.08   0.281    -.8595788    .2494204
         12  |  -.1041129   .2881006    -0.36   0.718    -.6687797    .4605539
             |
         ind |
          2  |   .0428533   .2214705     0.19   0.847    -.3912209    .4769274
          3  |   .1868074   .3246177     0.58   0.565    -.4494316    .8230463
          4  |   .2942429   .3013314     0.98   0.329    -.2963557    .8848416
          5  |   .3551208   .3021551     1.18   0.240    -.2370923    .9473339
          6  |   .2907846   .3015799     0.96   0.335    -.3003012    .8818703
          7  |   .2322952   .3038363     0.76   0.445    -.3632131    .8278035
          8  |   .3497589   .3025778     1.16   0.248    -.2432826    .9428005
          9  |   .4041158   .3056567     1.32   0.186    -.1949604    1.003192
         10  |   .2453709    .302324     0.81   0.417    -.3471733    .8379152
         11  |   .3775148   .3027319     1.25   0.212    -.2158289    .9708586
         12  |   .4314082   .3030992     1.42   0.155    -.1626553    1.025472
         13  |   .4036616   .3037426     1.33   0.184    -.1916629     .998986
         14  |   .2322915   .3017256     0.77   0.441    -.3590797    .8236627
         15  |   .3890358    .303338     1.28   0.200    -.2054958    .9835673
         16  |   .2954303   .3013333     0.98   0.327    -.2951721    .8860328
         17  |   .2675018   .3228324     0.83   0.407    -.3652381    .9002418
         18  |   .3483384   .3079439     1.13   0.258    -.2552206    .9518974
             |
    1.dunion |   .0603382     .01447     4.17   0.000     .0319774    .0886989
  1.dmarital |   .1441001   .0210348     6.85   0.000     .1028727    .1853275
             |
        year |
       2005  |   .0735859   .0277233     2.65   0.008     .0192491    .1279226
       2006  |   .0645787    .027385     2.36   0.018      .010905    .1182524
       2007  |   .0398373   .0248551     1.60   0.109    -.0088778    .0885524
       2008  |    .036773    .025808     1.42   0.154    -.0138097    .0873557
       2009  |   .0796255   .0230924     3.45   0.001     .0343652    .1248859
       2010  |   .0398824    .023791     1.68   0.094    -.0067471    .0865118
       2011  |   .0539021   .0237201     2.27   0.023     .0074115    .1003926
       2012  |   .0454718     .02354     1.93   0.053    -.0006657    .0916093
       2013  |   .0357731   .0256996     1.39   0.164    -.0145972    .0861434
       2014  |   .0783289   .0254864     3.07   0.002     .0283765    .1282814
             |
   schooling |
         12  |   .0503533   .0354445     1.42   0.155    -.0191165    .1198232
         14  |   .0575591   .0465552     1.24   0.216    -.0336875    .1488056
         16  |    .166786   .0483184     3.45   0.001     .0720838    .2614882
             |
       dsize |
          1  |   .1103434   .0153472     7.19   0.000     .0802634    .1404234
          2  |   .2529014   .0178539    14.17   0.000     .2179084    .2878944
             |
  1.dregular |   .2731573   .0350107     7.80   0.000     .2045376     .341777
       _cons |   6.077014   .1694285    35.87   0.000      5.74494    6.409088
------------------------------------------------------------------------------
Instrumented:  emp1 emp2 emp5 emp10 emp15 emp20 emp25 emp30 workexp
               c.workexp#c.workexp
Instruments:   2.occ 3.occ 4.occ 5.occ 6.occ 7.occ 8.occ 9.occ 10.occ 11.occ
               12.occ 2.ind 3.ind 4.ind 5.ind 6.ind 7.ind 8.ind 9.ind 10.ind
               11.ind 12.ind 13.ind 14.ind 15.ind 16.ind 17.ind 18.ind
               1.dunion 1.dmarital 2005.year 2006.year 2007.year 2008.year
               2009.year 2010.year 2011.year 2012.year 2013.year 2014.year
               12.schooling 14.schooling 16.schooling 1.dsize 2.dsize
               1.dregular empiv1 empiv2 empiv5 empiv10 empiv15 empiv20
               empiv25 empiv30 workexpiv workexpiv2
. est sto isvempD
.  
. *** output tex all results
. qui{
. }

. 
. 
. * 4. Topel / 1-4 dimenational polynomial
. cap log close /* close any log files that accidentally have been left open. */
