---------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submit
> tion\Log\Estimation.log
  log type:  text
 opened on:  14 Dec 2018, 18:25:16

. 
. * Summary statistics
. do "$Code\ReadData.do"

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Su
> bmittion\Input"

. 
. qui {

. 
end of do-file

. qui     reg ///
>                                 `commonVar' ///
>                                 `emp1' ///
>                                 , vce(r)

.                 est sto forsum

. keep if _est_forsum==1
(2,907 observations deleted)

. tabulate dsize, generate(sized)

      dsize |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,328       38.69       38.69
          1 |      1,948       22.65       61.34
          2 |      3,325       38.66      100.00
------------+-----------------------------------
      Total |      8,601      100.00

. tabulate schooling, generate(edud)

  schooling |      Freq.     Percent        Cum.
------------+-----------------------------------
          9 |        308        3.58        3.58
         12 |      3,800       44.18       47.76
         14 |        972       11.30       59.06
         16 |      3,521       40.94      100.00
------------+-----------------------------------
      Total |      8,601      100.00

. estpost sum age edud* dmarital dunion sized* dregular ///
>                                         realwage workexp emptenure

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)     e(min) 
-------------+------------------------------------------------------------------
         age |      8601       8601    45.3588    105.531   10.27283         20 
       edud1 |      8601       8601   .0358098   .0345315   .1858264          0 
       edud2 |      8601       8601   .4418091   .2466425   .4966311          0 
       edud3 |      8601       8601   .1130101   .1002505   .3166236          0 
       edud4 |      8601       8601    .409371   .2418145   .4917464          0 
    dmarital |      8601       8601   .8386234   .1353499   .3678993          0 
      dunion |      8601       8601   .2875247   .2048781   .4526346          0 
      sized1 |      8601       8601   .3869318   .2372432   .4870761          0 
      sized2 |      8601       8601   .2264853   .1752101    .418581          0 
      sized3 |      8601       8601    .386583   .2371641    .486995          0 
    dregular |      8601       8601   .8961749   .0930563   .3050513          0 
    realwage |      8601       8601   7.551957   .3173452    .563334   5.526562 
     workexp |      8601       8601   25.39402   114.9897   10.72333          0 
   emptenure |      8601       8601   14.21056   124.0376   11.13722          0 

             |    e(max)     e(sum) 
-------------+----------------------
         age |        64     390131 
       edud1 |         1        308 
       edud2 |         1       3800 
       edud3 |         1        972 
       edud4 |         1       3521 
    dmarital |         1       7213 
      dunion |         1       2473 
      sized1 |         1       3328 
      sized2 |         1       1948 
      sized3 |         1       3325 
    dregular |         1       7708 
    realwage |  10.65899   64954.39 
     workexp |        50     218414 
   emptenure |        47     122225 

. esttab using "$Output\sum.tex", ///
>         cell( ///
>                         ( ///
>                         mean(label(Mean) fmt(%5.4f)) ///
>                         sd(label(St.d) fmt(%5.4f)) ///
>                         min(label(Min)) ///
>                         max(label(Max)) ///
>                         ) ///
>                         ) ///
>         coeflabel( ///
>                                         age "Age" ///
>                                         edud1 "\quad Junior High School" ///
>                                         edud2 "\quad High School" ///
>                                         edud3 "\quad 2-year College or Vocation
> al" ///
>                                         edud4 "\quad College or More" ///
>                                         dmarital "Married" ///
>                                         dunion "Union Member" ///
>                                         sized1 "\quad Size $<100$" ///
>                                         sized2 "\quad $100\leq$ Size $<500$" //
> /
>                                         sized3 "\quad Size $\geq 500$" ///
>                                         dregular "Regular Employee" ///
>                                         realwage "Log of Real Hourly Wage" ///
>                                         workexp "Total Experience" ///
>                                         emptenure "Employer Tenure" ///
>                                         ) ///
>         replace
(output written to C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\
> Submittion\Output\sum.tex)

. 
. * 1. OLS->AS / 1-4 dimenational polynomial
. {
. ** OLS
. *** read data
. do "$Code\ReadData.do"

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Su
> bmittion\Input"

. 
. qui {

. 
end of do-file
. 
. foreach ten_i of local isIncOcc{
  2.         forvalues poly_x=1/4{
  3.                 dis "/* OLS `ten_i' `poly_x'th order */"
  4.                 reg ///
>                                 `commonVar' ///
>                                 ``ten_i'`poly_x'' ///
>                                 , vce(r)
  5.                 est sto ols`ten_i'`poly_x'
  6.         }
  7. }
/* OLS emp 1th order */

Linear regression                               Number of obs     =      8,601
                                                F(49, 8551)       =      89.65
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3262
                                                Root MSE          =     .46374

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         occ |
          2  |   .0298433   .4248095     0.07   0.944     -.802886    .8625726
          3  |  -.2076717   .3912234    -0.53   0.596    -.9745639    .5592206
          4  |  -.3044627   .3929636    -0.77   0.438    -1.074766    .4658408
          5  |   .1063267   .3927505     0.27   0.787     -.663559    .8762124
          6  |  -.1316973   .3926266    -0.34   0.737    -.9013402    .6379457
          7  |  -.2622397   .3930451    -0.67   0.505    -1.032703    .5082236
          8  |  -.1984736   .3926744    -0.51   0.613    -.9682102     .571263
          9  |  -.0878245   .3930327    -0.22   0.823    -.8582635    .6826145
         10  |  -.0598358   .3928406    -0.15   0.879    -.8298983    .7102266
         11  |  -.3579745   .3936301    -0.91   0.363    -1.129585    .4136356
         12  |  -.1590405   .3990531    -0.40   0.690     -.941281       .6232
             |
         ind |
          2  |    .012021   .2478196     0.05   0.961    -.4737652    .4978072
          3  |   .3907741   .4204045     0.93   0.353    -.4333202    1.214868
          4  |    .355097   .4013861     0.88   0.376    -.4317167    1.141911
          5  |   .4169589   .4014666     1.04   0.299    -.3700126     1.20393
          6  |   .3542953   .4003735     0.88   0.376    -.4305334    1.139124
          7  |   .3493815   .4032273     0.87   0.386    -.4410414    1.139804
          8  |   .4153627   .4020235     1.03   0.302    -.3727004    1.203426
          9  |   .5067405    .404324     1.25   0.210    -.2858321    1.299313
         10  |   .3259212   .4017167     0.81   0.417    -.4615406    1.113383
         11  |   .4467693   .4020398     1.11   0.266    -.3413257    1.234864
         12  |   .4920627   .4021688     1.22   0.221    -.2962852    1.280411
         13  |   .4610662   .4028175     1.14   0.252    -.3285535    1.250686
         14  |   .3153116   .4017508     0.78   0.433     -.472217     1.10284
         15  |    .448028   .4027573     1.11   0.266    -.3414736     1.23753
         16  |   .3778826   .4012301     0.94   0.346    -.4086252     1.16439
         17  |   .2782773   .4183505     0.67   0.506    -.5417906    1.098345
         18  |   .3845863   .4065578     0.95   0.344    -.4123652    1.181538
             |
    1.dunion |   .0362543   .0125991     2.88   0.004     .0115571    .0609515
  1.dmarital |   .1577715   .0139658    11.30   0.000     .1303952    .1851478
             |
        year |
       2005  |   .1102695   .0291239     3.79   0.000     .0531796    .1673594
       2006  |   .0938675   .0282348     3.32   0.001     .0385206    .1492145
       2007  |   .0716693    .025791     2.78   0.005     .0211127     .122226
       2008  |    .068432   .0258496     2.65   0.008     .0177606    .1191035
       2009  |   .0977198   .0233914     4.18   0.000     .0518671    .1435725
       2010  |    .064362   .0238277     2.70   0.007      .017654    .1110699
       2011  |   .0767761   .0233642     3.29   0.001     .0309767    .1225756
       2012  |   .0715229   .0234207     3.05   0.002     .0256126    .1174332
       2013  |    .066243   .0247007     2.68   0.007     .0178237    .1146622
       2014  |   .1013664    .024429     4.15   0.000     .0534797    .1492531
             |
   schooling |
         12  |   .1224318   .0267831     4.57   0.000     .0699304    .1749331
         14  |    .122101   .0307231     3.97   0.000     .0618762    .1823257
         16  |   .2491474   .0289299     8.61   0.000     .1924378     .305857
             |
       dsize |
          1  |   .0737344   .0137779     5.35   0.000     .0467263    .1007424
          2  |   .2103619   .0140173    15.01   0.000     .1828846    .2378392
             |
  1.dregular |   .2878633   .0178858    16.09   0.000     .2528028    .3229238
   emptenure |   .0096817   .0006058    15.98   0.000     .0084942    .0108691
          oj |   .1036268   .0252218     4.11   0.000      .054186    .1530676
     workexp |   .0025138   .0006005     4.19   0.000     .0013366    .0036909
       _cons |   6.267301    .094755    66.14   0.000     6.081559    6.453044
------------------------------------------------------------------------------
/* OLS emp 2th order */

Linear regression                               Number of obs     =      8,601
                                                F(51, 8549)       =      88.15
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3336
                                                Root MSE          =     .46125

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         occ |
          2  |   .0073181   .4316699     0.02   0.986    -.8388592    .8534954
          3  |  -.2553092   .3741991    -0.68   0.495    -.9888299    .4782115
          4  |  -.3432263   .3759146    -0.91   0.361     -1.08011     .393657
          5  |   .0560337   .3757239     0.15   0.881    -.6804758    .7925433
          6  |  -.1793694   .3755732    -0.48   0.633    -.9155836    .5568449
          7  |  -.3087859    .375977    -0.82   0.412    -1.045792    .4282199
          8  |  -.2508939   .3755716    -0.67   0.504    -.9871049     .485317
          9  |  -.1366654   .3759748    -0.36   0.716    -.8736669     .600336
         10  |  -.1057212   .3757658    -0.28   0.778    -.8423129    .6308704
         11  |  -.3951467   .3765935    -1.05   0.294    -1.133361    .3430674
         12  |   -.214244   .3824399    -0.56   0.575    -.9639185    .5354305
             |
         ind |
          2  |   .0287989   .2362854     0.12   0.903    -.4343775    .4919753
          3  |   .3974769   .4050759     0.98   0.327    -.3965697    1.191523
          4  |   .3888868   .3852665     1.01   0.313    -.3663285    1.144102
          5  |   .4466031   .3853574     1.16   0.247    -.3087905    1.201997
          6  |   .3834056   .3843326     1.00   0.319    -.3699791     1.13679
          7  |   .3753626   .3872532     0.97   0.332    -.3837471    1.134472
          8  |   .4443837   .3859914     1.15   0.250    -.3122528     1.20102
          9  |   .5349681   .3883436     1.38   0.168    -.2262792    1.296215
         10  |   .3499001   .3856454     0.91   0.364     -.406058    1.105858
         11  |   .4760945   .3860029     1.23   0.217    -.2805644    1.232753
         12  |   .5311907   .3860441     1.38   0.169    -.2255489     1.28793
         13  |   .5081122   .3867894     1.31   0.189    -.2500885    1.266313
         14  |   .3447612   .3856714     0.89   0.371    -.4112479     1.10077
         15  |   .4847534   .3867066     1.25   0.210     -.273285    1.242792
         16  |   .4090511   .3851298     1.06   0.288    -.3458963    1.163999
         17  |   .3299905   .4017572     0.82   0.411    -.4575507    1.117532
         18  |   .4237962   .3906907     1.08   0.278    -.3420519    1.189644
             |
    1.dunion |   .0429304   .0125396     3.42   0.001     .0183497    .0675111
  1.dmarital |   .1395932   .0141004     9.90   0.000      .111953    .1672335
             |
        year |
       2005  |   .1051563   .0289393     3.63   0.000     .0484283    .1618843
       2006  |   .0846143   .0280236     3.02   0.003     .0296813    .1395473
       2007  |   .0661225     .02552     2.59   0.010     .0160972    .1161478
       2008  |    .062163   .0255797     2.43   0.015     .0120206    .1123053
       2009  |   .0925691   .0231844     3.99   0.000     .0471221    .1380161
       2010  |   .0567686   .0237177     2.39   0.017     .0102763    .1032609
       2011  |   .0672909   .0232276     2.90   0.004     .0217592    .1128227
       2012  |   .0638323   .0233065     2.74   0.006     .0181459    .1095187
       2013  |   .0560475   .0246066     2.28   0.023     .0078127    .1042824
       2014  |   .0926631    .024248     3.82   0.000     .0451311    .1401951
             |
   schooling |
         12  |   .0823595   .0268088     3.07   0.002     .0298077    .1349113
         14  |   .0839315   .0306389     2.74   0.006     .0238719    .1439912
         16  |   .2073878   .0287796     7.21   0.000     .1509729    .2638027
             |
       dsize |
          1  |   .0774864   .0137628     5.63   0.000     .0505079    .1044649
          2  |   .2132906   .0140112    15.22   0.000     .1858253    .2407559
             |
  1.dregular |   .2477924   .0180108    13.76   0.000     .2124869    .2830978
   emptenure |   .0142208   .0019051     7.46   0.000     .0104863    .0179552
             |
 c.emptenure#|
 c.emptenure |  -.0001353   .0000492    -2.75   0.006    -.0002317   -.0000389
             |
          oj |    .075954   .0266971     2.85   0.004     .0236212    .1282868
     workexp |   .0209201   .0025481     8.21   0.000     .0159251     .025915
             |
   c.workexp#|
   c.workexp |  -.0003574    .000049    -7.29   0.000    -.0004535   -.0002613
             |
       _cons |    6.18851   .0969526    63.83   0.000     5.998459    6.378561
------------------------------------------------------------------------------
/* OLS emp 3th order */

Linear regression                               Number of obs     =      8,601
                                                F(53, 8547)       =      86.37
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3345
                                                Root MSE          =     .46097

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         occ |
          2  |    .035853   .4318371     0.08   0.934     -.810652    .8823579
          3  |  -.2538667   .3691278    -0.69   0.492    -.9774463     .469713
          4  |  -.3426014    .370818    -0.92   0.356    -1.069494    .3842916
          5  |   .0542428   .3705448     0.15   0.884    -.6721144    .7806001
          6  |  -.1788311     .37041    -0.48   0.629    -.9049242    .5472621
          7  |  -.3074672   .3708532    -0.83   0.407    -1.034429    .4194948
          8  |  -.2521581   .3704169    -0.68   0.496    -.9782647    .4739485
          9  |  -.1334415   .3708716    -0.36   0.719    -.8604395    .5935564
         10  |  -.1059534   .3706364    -0.29   0.775    -.8324903    .6205836
         11  |  -.3970154   .3714657    -1.07   0.285    -1.125178    .3311471
         12  |  -.2141069   .3772725    -0.57   0.570    -.9536521    .5254384
             |
         ind |
          2  |   .0356904   .2348054     0.15   0.879    -.4245848    .4959656
          3  |   .3976255   .4009282     0.99   0.321    -.3882906    1.183542
          4  |   .3926446   .3801417     1.03   0.302     -.352525    1.137814
          5  |   .4496891   .3802469     1.18   0.237    -.2956867    1.195065
          6  |   .3854415   .3792463     1.02   0.309    -.3579729    1.128856
          7  |    .375509    .382165     0.98   0.326    -.3736268    1.124645
          8  |   .4462195   .3809259     1.17   0.241    -.3004872    1.192926
          9  |    .535498   .3831342     1.40   0.162    -.2155376    1.286534
         10  |   .3529311   .3805429     0.93   0.354     -.393025    1.098887
         11  |   .4781541   .3808906     1.26   0.209    -.2684835    1.224792
         12  |   .5350169   .3809018     1.40   0.160    -.2116426    1.281676
         13  |   .5113689   .3817277     1.34   0.180    -.2369095    1.259647
         14  |   .3471146   .3805863     0.91   0.362    -.3989265    1.093156
         15  |   .4856984   .3816627     1.27   0.203    -.2624528     1.23385
         16  |   .4121984   .3799993     1.08   0.278    -.3326919    1.157089
         17  |   .3322223    .396964     0.84   0.403     -.445923    1.110368
         18  |   .4286016   .3856436     1.11   0.266    -.3273531    1.184556
             |
    1.dunion |   .0417507   .0125323     3.33   0.001     .0171844    .0663169
  1.dmarital |   .1484919   .0143872    10.32   0.000     .1202895    .1766943
             |
        year |
       2005  |   .1075587   .0289099     3.72   0.000     .0508883    .1642292
       2006  |   .0872436   .0280074     3.12   0.002     .0323423     .142145
       2007  |   .0692244   .0255124     2.71   0.007      .019214    .1192348
       2008  |   .0653953   .0256185     2.55   0.011      .015177    .1156137
       2009  |   .0954065   .0231839     4.12   0.000     .0499604    .1408525
       2010  |   .0605038   .0237276     2.55   0.011      .013992    .1070156
       2011  |   .0716244   .0232323     3.08   0.002     .0260835    .1171653
       2012  |    .068778   .0233357     2.95   0.003     .0230345    .1145216
       2013  |   .0605591   .0246513     2.46   0.014     .0122365    .1088817
       2014  |   .0973608   .0243211     4.00   0.000     .0496855    .1450361
             |
   schooling |
         12  |   .0747428   .0269416     2.77   0.006     .0219308    .1275549
         14  |   .0722956   .0309286     2.34   0.019     .0116681    .1329232
         16  |   .1944387   .0292002     6.66   0.000     .1371992    .2516781
             |
       dsize |
          1  |   .0779685   .0137708     5.66   0.000     .0509744    .1049626
          2  |   .2138775   .0140379    15.24   0.000     .1863599    .2413952
             |
  1.dregular |   .2415793     .01814    13.32   0.000     .2060206     .277138
   emptenure |   .0119727   .0043679     2.74   0.006     .0034105    .0205348
             |
 c.emptenure#|
 c.emptenure |   .0000313   .0002602     0.12   0.904    -.0004788    .0005413
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure |  -3.11e-06   4.27e-06    -0.73   0.465    -.0000115    5.25e-06
             |
          oj |   .0879997   .0293032     3.00   0.003     .0305583    .1454411
     workexp |   .0011013   .0070038     0.16   0.875    -.0126279    .0148304
             |
   c.workexp#|
   c.workexp |    .000531   .0002988     1.78   0.076    -.0000548    .0011168
             |
   c.workexp#|
   c.workexp#|
   c.workexp |  -.0000117   3.90e-06    -3.00   0.003    -.0000193   -4.04e-06
             |
       _cons |   6.306139    .102924    61.27   0.000     6.104383    6.507895
------------------------------------------------------------------------------
/* OLS emp 4th order */

Linear regression                               Number of obs     =      8,601
                                                F(55, 8545)       =      84.12
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3350
                                                Root MSE          =     .46087

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         occ |
          2  |   .0618536   .4349325     0.14   0.887    -.7907192    .9144265
          3  |  -.2432918   .3673247    -0.66   0.508     -.963337    .4767534
          4  |  -.3309758   .3690339    -0.90   0.370    -1.054371    .3924197
          5  |   .0655165   .3687909     0.18   0.859    -.6574027    .7884358
          6  |  -.1677966   .3686378    -0.46   0.649    -.8904157    .5548225
          7  |  -.2966807   .3690969    -0.80   0.422      -1.0202    .4268383
          8  |  -.2424674   .3686365    -0.66   0.511    -.9650841    .4801493
          9  |  -.1225319   .3691185    -0.33   0.740    -.8460934    .6010296
         10  |  -.0949958   .3688641    -0.26   0.797    -.8180586    .6280671
         11  |  -.3862971   .3696763    -1.04   0.296    -1.110952    .3383577
         12  |   -.203297   .3754912    -0.54   0.588    -.9393505    .5327565
             |
         ind |
          2  |   .0320425   .2345253     0.14   0.891    -.4276837    .4917688
          3  |   .3892312   .3991222     0.98   0.329    -.3931448    1.171607
          4  |   .3827798   .3783167     1.01   0.312    -.3588124    1.124372
          5  |   .4414016   .3783922     1.17   0.243    -.3003385    1.183142
          6  |   .3761675   .3773906     1.00   0.319    -.3636093    1.115944
          7  |   .3661132   .3803409     0.96   0.336    -.3794469    1.111673
          8  |   .4368394   .3790715     1.15   0.249    -.3062324    1.179911
          9  |   .5241959   .3813545     1.37   0.169    -.2233512    1.271743
         10  |   .3426173    .378733     0.90   0.366    -.3997908    1.085025
         11  |    .469498   .3790659     1.24   0.216    -.2735627    1.212559
         12  |   .5239654   .3791412     1.38   0.167    -.2192431    1.267174
         13  |   .5017777   .3798756     1.32   0.187    -.2428703    1.246426
         14  |    .337571   .3787601     0.89   0.373    -.4048904    1.080032
         15  |   .4758025   .3797665     1.25   0.210    -.2686316    1.220237
         16  |   .4018155   .3781914     1.06   0.288     -.339531    1.143162
         17  |   .3221113   .3949964     0.82   0.415    -.4521771      1.0964
         18  |   .4174979   .3838319     1.09   0.277    -.3349054    1.169901
             |
    1.dunion |   .0404155   .0125258     3.23   0.001     .0158618    .0649691
  1.dmarital |   .1473386    .014372    10.25   0.000     .1191661    .1755111
             |
        year |
       2005  |   .1058697    .028889     3.66   0.000     .0492403    .1624991
       2006  |   .0859085   .0280095     3.07   0.002     .0310032    .1408139
       2007  |   .0688591   .0254932     2.70   0.007     .0188863    .1188319
       2008  |    .064305   .0256337     2.51   0.012     .0140567    .1145533
       2009  |   .0949521   .0231548     4.10   0.000     .0495632    .1403411
       2010  |    .060136   .0237142     2.54   0.011     .0136504    .1066216
       2011  |   .0707637   .0232056     3.05   0.002     .0252752    .1162523
       2012  |     .06833   .0233102     2.93   0.003     .0226363    .1140237
       2013  |   .0601372    .024626     2.44   0.015     .0118643    .1084101
       2014  |   .0970831   .0243064     3.99   0.000     .0494368    .1447295
             |
   schooling |
         12  |   .0747115   .0268738     2.78   0.005     .0220324    .1273906
         14  |   .0715891   .0309056     2.32   0.021     .0110067    .1321715
         16  |   .1930224   .0291813     6.61   0.000       .13582    .2502248
             |
       dsize |
          1  |   .0781103   .0137633     5.68   0.000     .0511309    .1050898
          2  |    .214707   .0140265    15.31   0.000     .1872117    .2422023
             |
  1.dregular |   .2385139    .018292    13.04   0.000     .2026572    .2743706
   emptenure |   .0156775   .0084211     1.86   0.063    -.0008299    .0321849
             |
 c.emptenure#|
 c.emptenure |  -.0003977   .0008319    -0.48   0.633    -.0020285    .0012331
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure |   .0000143   .0000301     0.48   0.635    -.0000447    .0000732
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure#|
 c.emptenure |  -2.24e-07   3.58e-07    -0.63   0.531    -9.25e-07    4.77e-07
             |
          oj |   .0786059   .0329425     2.39   0.017     .0140306    .1431811
     workexp |   .0286527   .0144831     1.98   0.048     .0002624     .057043
             |
   c.workexp#|
   c.workexp |  -.0015841   .0010463    -1.51   0.130    -.0036352    .0004669
             |
   c.workexp#|
   c.workexp#|
   c.workexp |   .0000504   .0000303     1.66   0.096    -9.01e-06    .0001098
             |
   c.workexp#|
   c.workexp#|
   c.workexp#|
   c.workexp |  -6.14e-07   3.02e-07    -2.03   0.042    -1.21e-06   -2.16e-08
             |
       _cons |   6.204579   .1114987    55.65   0.000     5.986015    6.423143
------------------------------------------------------------------------------
/* OLS empocc 1th order */

Linear regression                               Number of obs     =      8,463
                                                F(50, 8412)       =      85.54
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3234
                                                Root MSE          =     .46421

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         occ |
          2  |   .0332711   .4290397     0.08   0.938    -.8077523    .8742945
          3  |  -.2070318   .3946956    -0.52   0.600    -.9807324    .5666687
          4  |   -.303629   .3964814    -0.77   0.444     -1.08083    .4735721
          5  |   .1056717   .3962129     0.27   0.790     -.671003    .8823464
          6  |  -.1326973   .3961013    -0.34   0.738    -.9091534    .6437588
          7  |  -.2631915   .3965513    -0.66   0.507     -1.04053    .5141467
          8  |  -.2014303   .3962126    -0.51   0.611    -.9781046    .5752439
          9  |  -.0897203   .3965506    -0.23   0.821     -.867057    .6876164
         10  |   -.058538   .3963102    -0.15   0.883    -.8354035    .7183274
         11  |  -.3590717   .3970573    -0.90   0.366    -1.137402    .4192584
         12  |  -.1505925      .4027    -0.37   0.708    -.9399836    .6387986
             |
         ind |
          2  |   .0051902    .249607     0.02   0.983     -.484101    .4944813
          3  |   .3925678   .4238122     0.93   0.354    -.4382085    1.223344
          4  |   .3524107   .4047972     0.87   0.384    -.4410914    1.145913
          5  |   .4153649   .4048609     1.03   0.305    -.3782621    1.208992
          6  |   .3555599   .4037382     0.88   0.379    -.4358663    1.146986
          7  |   .3519443    .406679     0.87   0.387    -.4452467    1.149135
          8  |   .4154657   .4053595     1.02   0.305    -.3791387     1.21007
          9  |   .4898874   .4076619     1.20   0.230    -.3092302    1.289005
         10  |   .3247295   .4050976     0.80   0.423    -.4693615    1.118821
         11  |   .4447705   .4054304     1.10   0.273    -.3499727    1.239514
         12  |   .4913332   .4055716     1.21   0.226    -.3036869    1.286353
         13  |   .4620242   .4062484     1.14   0.255    -.3343226    1.258371
         14  |   .3136846   .4051484     0.77   0.439    -.4805059    1.107875
         15  |   .4440057   .4061289     1.09   0.274    -.3521068    1.240118
         16  |   .3779994   .4046285     0.93   0.350    -.4151721    1.171171
         17  |   .2763468   .4216341     0.66   0.512    -.5501598    1.102853
         18  |   .3834785     .40995     0.94   0.350    -.4201245    1.187081
             |
    1.dunion |   .0392949   .0126646     3.10   0.002     .0144691    .0641207
  1.dmarital |    .167519   .0142135    11.79   0.000      .139657     .195381
             |
        year |
       2005  |   .1132793   .0292238     3.88   0.000     .0559935    .1705651
       2006  |   .0997403   .0285483     3.49   0.000     .0437787     .155702
       2007  |   .0740257   .0260748     2.84   0.005     .0229127    .1251387
       2008  |   .0704265   .0261235     2.70   0.007      .019218     .121635
       2009  |   .0987494    .023506     4.20   0.000     .0526718     .144827
       2010  |   .0701339    .024077     2.91   0.004     .0229372    .1173307
       2011  |   .0811079   .0235597     3.44   0.001      .034925    .1272908
       2012  |   .0731622   .0236208     3.10   0.002     .0268597    .1194647
       2013  |   .0702755   .0248769     2.82   0.005     .0215106    .1190403
       2014  |   .1029653   .0247768     4.16   0.000     .0543966     .151534
             |
   schooling |
         12  |   .1284972   .0275364     4.67   0.000      .074519    .1824754
         14  |   .1305994   .0314028     4.16   0.000     .0690423    .1921566
         16  |   .2585204   .0296606     8.72   0.000     .2003782    .3166625
             |
       dsize |
          1  |   .0707143   .0138854     5.09   0.000     .0434955    .0979332
          2  |   .2088087    .014194    14.71   0.000     .1809849    .2366325
             |
  1.dregular |    .286016   .0184764    15.48   0.000     .2497978    .3222342
   emptenure |   .0090545   .0007045    12.85   0.000     .0076735    .0104355
          oj |    .110154   .0261069     4.22   0.000      .058978      .16133
     workexp |   .0026952   .0006128     4.40   0.000     .0014939    .0038966
   occtenure |   .0008798   .0005708     1.54   0.123    -.0002391    .0019987
       _cons |   6.242768   .0956361    65.28   0.000     6.055298    6.430238
------------------------------------------------------------------------------
/* OLS empocc 2th order */

Linear regression                               Number of obs     =      8,463
                                                F(53, 8409)       =      82.92
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3313
                                                Root MSE          =     .46158

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         occ |
          2  |   .0087424   .4369551     0.02   0.984    -.8477972    .8652819
          3  |  -.2574723   .3768733    -0.68   0.495    -.9962367    .4812921
          4  |   -.345561   .3786312    -0.91   0.361    -1.087771    .3966494
          5  |   .0527165   .3783882     0.14   0.889    -.6890176    .7944506
          6  |  -.1828226   .3782468    -0.48   0.629    -.9242795    .5586343
          7  |  -.3132045   .3786713    -0.83   0.408    -1.055493    .4290844
          8  |  -.2574341   .3783028    -0.68   0.496    -.9990006    .4841325
          9  |  -.1411899   .3786926    -0.37   0.709    -.8835206    .6011408
         10  |  -.1082345   .3784324    -0.29   0.775    -.8500551     .633586
         11  |  -.3966982   .3792377    -1.05   0.296    -1.140097     .346701
         12  |  -.2059583   .3853054    -0.53   0.593    -.9612516    .5493351
             |
         ind |
          2  |   .0232396   .2375029     0.10   0.922    -.4423245    .4888036
          3  |   .3996626   .4077874     0.98   0.327    -.3997011    1.199026
          4  |    .390008   .3879066     1.01   0.315    -.3703845      1.1504
          5  |   .4472584   .3879845     1.15   0.249    -.3132867    1.207804
          6  |   .3870968     .38694     1.00   0.317    -.3714009    1.145594
          7  |   .3777866   .3899729     0.97   0.333    -.3866563    1.142229
          8  |   .4467475   .3885741     1.15   0.250    -.3149534    1.208448
          9  |   .5193559   .3909078     1.33   0.184    -.2469196    1.285631
         10  |   .3515248   .3882618     0.91   0.365    -.4095638    1.112613
         11  |   .4748832   .3886399     1.22   0.222    -.2869467    1.236713
         12  |   .5347767   .3887115     1.38   0.169    -.2271935    1.296747
         13  |   .5126403   .3894453     1.32   0.188    -.2507682    1.276049
         14  |   .3424371   .3883165     0.88   0.378    -.4187588    1.103633
         15  |   .4834645    .389304     1.24   0.214    -.2796673    1.246596
         16  |   .4115896   .3877642     1.06   0.289    -.3485237    1.171703
         17  |     .33109    .404265     0.82   0.413    -.4613689    1.123549
         18  |    .426161   .3933156     1.08   0.279    -.3448344    1.197156
             |
    1.dunion |   .0467006   .0126019     3.71   0.000     .0219978    .0714035
  1.dmarital |   .1506628   .0143653    10.49   0.000     .1225034    .1788223
             |
        year |
       2005  |    .109892   .0290592     3.78   0.000     .0529289    .1668551
       2006  |   .0923062   .0285284     3.24   0.001     .0363835    .1482289
       2007  |   .0689619   .0257995     2.67   0.008     .0183886    .1195353
       2008  |   .0647718   .0258478     2.51   0.012     .0141038    .1154398
       2009  |   .0939341   .0232952     4.03   0.000     .0482699    .1395984
       2010  |   .0627652   .0239849     2.62   0.009     .0157489    .1097815
       2011  |   .0716171   .0234293     3.06   0.002     .0256899    .1175444
       2012  |   .0657184   .0235265     2.79   0.005     .0196006    .1118362
       2013  |   .0595096   .0247622     2.40   0.016     .0109697    .1080496
       2014  |   .0941617   .0246522     3.82   0.000     .0458374     .142486
             |
   schooling |
         12  |   .0875229   .0275233     3.18   0.001     .0335705    .1414754
         14  |    .091161   .0313189     2.91   0.004     .0297683    .1525537
         16  |   .2161132   .0294853     7.33   0.000     .1583148    .2739117
             |
       dsize |
          1  |   .0742277   .0138538     5.36   0.000     .0470708    .1013846
          2  |   .2114669   .0141727    14.92   0.000      .183685    .2392489
             |
  1.dregular |   .2442518   .0185858    13.14   0.000      .207819    .2806846
   emptenure |    .012967   .0021421     6.05   0.000     .0087679    .0171661
             |
 c.emptenure#|
 c.emptenure |  -.0001147   .0000568    -2.02   0.044    -.0002261   -3.29e-06
             |
          oj |   .0857777   .0277247     3.09   0.002     .0314303     .140125
     workexp |   .0220992   .0026257     8.42   0.000     .0169523    .0272462
             |
   c.workexp#|
   c.workexp |  -.0003749   .0000504    -7.44   0.000    -.0004737   -.0002761
             |
   occtenure |    .002011   .0016374     1.23   0.219    -.0011986    .0052207
             |
 c.occtenure#|
 c.occtenure |  -.0000386   .0000494    -0.78   0.435    -.0001355    .0000583
             |
       _cons |    6.14932   .0980291    62.73   0.000     5.957159    6.341481
------------------------------------------------------------------------------
/* OLS empocc 3th order */

Linear regression                               Number of obs     =      8,463
                                                F(56, 8406)       =      79.88
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3323
                                                Root MSE          =     .46131

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         occ |
          2  |    .031316   .4379306     0.07   0.943    -.8271358    .8897678
          3  |  -.2634937   .3717139    -0.71   0.478    -.9921444     .465157
          4  |  -.3503258   .3734296    -0.94   0.348     -1.08234    .3816883
          5  |   .0446935    .373118     0.12   0.905    -.6867096    .7760966
          6  |  -.1884813   .3729976    -0.51   0.613    -.9196484    .5426858
          7  |  -.3196918   .3734597    -0.86   0.392    -1.051765    .4123812
          8  |   -.265873   .3730665    -0.71   0.476    -.9971752    .4654292
          9  |  -.1456366   .3735016    -0.39   0.697    -.8777918    .5865186
         10  |  -.1149209   .3732122    -0.31   0.758    -.8465086    .6166669
         11  |  -.4059224   .3740201    -1.09   0.278    -1.139094    .3272491
         12  |   -.210038   .3800276    -0.55   0.580    -.9549857    .5349097
             |
         ind |
          2  |   .0384934   .2355052     0.16   0.870    -.4231548    .5001416
          3  |   .4056576   .4034789     1.01   0.315    -.3852604    1.196576
          4  |   .4038676   .3826361     1.06   0.291    -.3461933    1.153929
          5  |   .4609414   .3827313     1.20   0.228    -.2893063    1.211189
          6  |   .4003941   .3817096     1.05   0.294    -.3478507    1.148639
          7  |    .386721   .3847273     1.01   0.315    -.3674393    1.140881
          8  |   .4596812   .3833812     1.20   0.231    -.2918402    1.211203
          9  |    .531373   .3855751     1.38   0.168    -.2244491    1.287195
         10  |   .3654331   .3830203     0.95   0.340    -.3853811    1.116247
         11  |     .48708   .3833768     1.27   0.204    -.2644329    1.238593
         12  |   .5500992   .3834426     1.43   0.151    -.2015427    1.301741
         13  |   .5257693   .3842156     1.37   0.171     -.227388    1.278927
         14  |   .3548573   .3830833     0.93   0.354    -.3960802    1.105795
         15  |   .4940504    .384075     1.29   0.198    -.2588312    1.246932
         16  |   .4257898   .3824968     1.11   0.266    -.3239981    1.175578
         17  |   .3440103   .3993663     0.86   0.389     -.438846    1.126866
         18  |   .4428416   .3881894     1.14   0.254    -.3181052    1.203788
             |
    1.dunion |   .0456751      .0126     3.62   0.000      .020976    .0703743
  1.dmarital |   .1594271   .0146605    10.87   0.000     .1306888    .1881653
             |
        year |
       2005  |   .1139508   .0290542     3.92   0.000     .0569974    .1709041
       2006  |   .0967998   .0285494     3.39   0.001     .0408359    .1527637
       2007  |   .0731725   .0258163     2.83   0.005     .0225662    .1237787
       2008  |   .0687248   .0258992     2.65   0.008      .017956    .1194936
       2009  |   .0969058   .0233143     4.16   0.000      .051204    .1426076
       2010  |   .0672861   .0240248     2.80   0.005     .0201916    .1143806
       2011  |   .0767282   .0234574     3.27   0.001     .0307459    .1227105
       2012  |    .070907    .023575     3.01   0.003     .0246941    .1171198
       2013  |   .0642098   .0248268     2.59   0.010     .0155431    .1128764
       2014  |   .0983623   .0247533     3.97   0.000     .0498398    .1468848
             |
   schooling |
         12  |   .0797355   .0276056     2.89   0.004     .0256218    .1338492
         14  |   .0794273   .0315707     2.52   0.012     .0175411    .1413136
         16  |   .2032425    .029873     6.80   0.000     .1446841    .2618009
             |
       dsize |
          1  |   .0747342    .013863     5.39   0.000     .0475593    .1019092
          2  |   .2125926   .0141895    14.98   0.000     .1847776    .2404076
             |
  1.dregular |   .2381728   .0187298    12.72   0.000     .2014579    .2748878
   emptenure |   .0089695   .0048432     1.85   0.064    -.0005244    .0184633
             |
 c.emptenure#|
 c.emptenure |   .0001769   .0002932     0.60   0.546    -.0003979    .0007517
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure |  -5.08e-06   4.78e-06    -1.06   0.289    -.0000145    4.30e-06
             |
          oj |   .0985683   .0305997     3.22   0.001     .0385853    .1585512
     workexp |   .0027093    .007451     0.36   0.716    -.0118965    .0173151
             |
   c.workexp#|
   c.workexp |   .0004894   .0003152     1.55   0.120    -.0001283    .0011072
             |
   c.workexp#|
   c.workexp#|
   c.workexp |  -.0000113   4.08e-06    -2.77   0.006    -.0000193   -3.32e-06
             |
   occtenure |    .005875   .0031873     1.84   0.065    -.0003728    .0121228
             |
 c.occtenure#|
 c.occtenure |   -.000314   .0002062    -1.52   0.128    -.0007182    .0000901
             |
 c.occtenure#|
 c.occtenure#|
 c.occtenure |   4.48e-06   3.41e-06     1.31   0.190    -2.22e-06    .0000112
             |
       _cons |   6.257587   .1055385    59.29   0.000     6.050706    6.464469
------------------------------------------------------------------------------
/* OLS empocc 4th order */

Linear regression                               Number of obs     =      8,463
                                                F(59, 8403)       =      77.76
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3332
                                                Root MSE          =     .46107

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         occ |
          2  |    .056863   .4401328     0.13   0.897    -.8059056    .9196317
          3  |  -.2562472    .369783    -0.69   0.488    -.9811129    .4686185
          4  |  -.3406812   .3715034    -0.92   0.359    -1.068919     .387557
          5  |   .0523036   .3712429     0.14   0.888    -.6754239    .7800311
          6  |  -.1797998   .3710933    -0.48   0.628    -.9072341    .5476346
          7  |  -.3128062   .3715801    -0.84   0.400    -1.041195    .4155824
          8  |  -.2592304   .3711651    -0.70   0.485    -.9868054    .4683446
          9  |  -.1384494   .3716286    -0.37   0.709    -.8669329    .5900341
         10  |    -.10708   .3713095    -0.29   0.773    -.8349381    .6207781
         11  |  -.4018767   .3721163    -1.08   0.280    -1.131316    .3275629
         12  |  -.2002604    .378112    -0.53   0.596    -.9414531    .5409322
             |
         ind |
          2  |   .0443844   .2340386     0.19   0.850    -.4143889    .5031576
          3  |   .4014353   .4013718     1.00   0.317    -.3853524    1.188223
          4  |   .4045076   .3803844     1.06   0.288    -.3411395    1.150155
          5  |   .4632332   .3804443     1.22   0.223    -.2825312    1.208998
          6  |   .4013743   .3794097     1.06   0.290    -.3423622    1.145111
          7  |   .3864612   .3824534     1.01   0.312    -.3632416    1.136164
          8  |   .4609356   .3811011     1.21   0.227    -.2861164    1.207988
          9  |   .5310372   .3833485     1.39   0.166    -.2204203    1.282495
         10  |   .3654962   .3807786     0.96   0.337    -.3809236    1.111916
         11  |   .4868513   .3811008     1.28   0.201    -.2602002    1.233903
         12  |   .5494702   .3812344     1.44   0.150    -.1978431    1.296784
         13  |   .5258978   .3819065     1.38   0.169    -.2227329    1.274529
         14  |   .3537798    .380816     0.93   0.353    -.3927134    1.100273
         15  |   .4930938   .3817004     1.29   0.196    -.2551331    1.241321
         16  |   .4266006   .3802667     1.12   0.262    -.3188158    1.172017
         17  |   .3443586   .3970212     0.87   0.386    -.4339008    1.122618
         18  |   .4431757   .3860865     1.15   0.251    -.3136489         1.2
             |
    1.dunion |   .0444792   .0125996     3.53   0.000     .0197808    .0691775
  1.dmarital |   .1576419    .014621    10.78   0.000     .1289811    .1863026
             |
        year |
       2005  |   .1137288   .0290479     3.92   0.000     .0567878    .1706699
       2006  |   .0966575   .0285551     3.38   0.001     .0406824    .1526326
       2007  |   .0724096   .0258154     2.80   0.005     .0218051    .1230142
       2008  |   .0667275   .0259214     2.57   0.010     .0159151      .11754
       2009  |   .0959729    .023302     4.12   0.000     .0502953    .1416505
       2010  |   .0664854   .0240325     2.77   0.006     .0193758     .113595
       2011  |   .0753562   .0234489     3.21   0.001     .0293905    .1213219
       2012  |   .0695041   .0235654     2.95   0.003     .0233102    .1156981
       2013  |   .0624523   .0248114     2.52   0.012     .0138159    .1110887
       2014  |   .0978436   .0247525     3.95   0.000     .0493226    .1463646
             |
   schooling |
         12  |   .0804227   .0274358     2.93   0.003     .0266418    .1342037
         14  |   .0791028   .0314424     2.52   0.012      .017468    .1407376
         16  |   .2030654   .0297558     6.82   0.000     .1447368     .261394
             |
       dsize |
          1  |   .0741624    .013864     5.35   0.000     .0469856    .1013393
          2  |   .2136554   .0141779    15.07   0.000     .1858632    .2414476
             |
  1.dregular |   .2326812   .0188707    12.33   0.000     .1956901    .2696724
   emptenure |    .008019    .009019     0.89   0.374    -.0096604    .0256985
             |
 c.emptenure#|
 c.emptenure |   .0002675   .0008815     0.30   0.762    -.0014604    .0019954
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure |  -4.40e-06   .0000312    -0.14   0.888    -.0000655    .0000567
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure#|
 c.emptenure |  -6.70e-08   3.64e-07    -0.18   0.854    -7.81e-07    6.47e-07
             |
          oj |   .0928924   .0342239     2.71   0.007     .0258051    .1599796
     workexp |   .0363831   .0159978     2.27   0.023     .0050235    .0677427
             |
   c.workexp#|
   c.workexp |  -.0020479   .0011338    -1.81   0.071    -.0042704    .0001746
             |
   c.workexp#|
   c.workexp#|
   c.workexp |   .0000624   .0000324     1.93   0.054    -1.03e-06    .0001259
             |
   c.workexp#|
   c.workexp#|
   c.workexp#|
   c.workexp |  -7.26e-07   3.20e-07    -2.27   0.023    -1.35e-06   -9.96e-08
             |
   occtenure |   .0138225    .004998     2.77   0.006     .0040253    .0236197
             |
 c.occtenure#|
 c.occtenure |  -.0012022   .0004631    -2.60   0.009      -.00211   -.0002943
             |
 c.occtenure#|
 c.occtenure#|
 c.occtenure |   .0000328   .0000132     2.49   0.013     6.92e-06    .0000586
             |
 c.occtenure#|
 c.occtenure#|
 c.occtenure#|
 c.occtenure |  -2.60e-07   1.08e-07    -2.41   0.016    -4.71e-07   -4.86e-08
             |
       _cons |   6.116109   .1161502    52.66   0.000     5.888426    6.343792
------------------------------------------------------------------------------
. 
. ** AS
. foreach ten_i of local isIncOcc{
  2.         forvalues poly_x=1/4{
  3.                 qui {
  4.                         do "$Code\ReadData.do"
  5.                         do "$Code\ConstructIV.do"
  6.                         ivregress 2sls ///
>                                                 `commonVar' ///
>                                                 (``ten_i'`poly_x'' = ``ten_i'iv
> `poly_x'') ///
>                                                 , vce(r)
  7.                         est sto isv`ten_i'`poly_x'
  8.                         drop if _est_isv`ten_i'`poly_x'==0
  9.                         drop *iv *iv? avg*
 10.                         **** re-build iv
.                         do "$Code\ConstructIV.do"
 11.                 }
 12.                 dis "/* AS's IV `ten_i' `poly_x'th order */"
 13.                 ivregress 2sls ///
>                                 `commonVar' ///
>                                 (``ten_i'`poly_x'' = ``ten_i'iv`poly_x'') ///
>                                 , vce(r)
 14.                 est sto isv`ten_i'`poly_x'
 15.         }
 16. }
/* AS's IV emp 1th order */

Instrumental variables (2SLS) regression          Number of obs   =      8,601
                                                  Wald chi2(49)   =    3635.96
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.3030
                                                  Root MSE        =     .47029

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   emptenure |   .0006421   .0033094     0.19   0.846    -.0058441    .0071283
          oj |   .0563925   .0418876     1.35   0.178    -.0257056    .1384907
     workexp |   .0038953   .0036571     1.07   0.287    -.0032724     .011063
             |
         occ |
          2  |   .0796099   .4031722     0.20   0.843    -.7105932    .8698129
          3  |  -.1961627   .3704486    -0.53   0.596    -.9222287    .5299032
          4  |  -.3027344   .3709827    -0.82   0.414    -1.029847    .4243783
          5  |   .1846688   .3709903     0.50   0.619    -.5424588    .9117963
          6  |  -.1006417   .3710275    -0.27   0.786    -.8278422    .6265588
          7  |  -.2898244   .3709536    -0.78   0.435     -1.01688    .4372313
          8  |  -.1976278   .3715008    -0.53   0.595    -.9257559    .5305004
          9  |  -.0828768   .3727799    -0.22   0.824     -.813512    .6477584
         10  |  -.0420605   .3720607    -0.11   0.910    -.7712862    .6871651
         11  |  -.3874696   .3708845    -1.04   0.296     -1.11439    .3394507
         12  |  -.1497142   .3776739    -0.40   0.692    -.8899414     .590513
             |
         ind |
          2  |   .0663642   .2555751     0.26   0.795    -.4345537    .5672821
          3  |   .2921578   .4054458     0.72   0.471    -.5025014    1.086817
          4  |   .3570282   .3822382     0.93   0.350     -.392145    1.106201
          5  |   .4346487   .3821934     1.14   0.255    -.3144365    1.183734
          6  |   .3732678   .3811044     0.98   0.327    -.3736832    1.120219
          7  |    .324067   .3837062     0.84   0.398    -.4279834    1.076117
          8  |   .4014473   .3828526     1.05   0.294    -.3489301    1.151825
          9  |   .4699004   .3872896     1.21   0.225    -.2891733    1.228974
         10  |    .331981   .3824329     0.87   0.385    -.4175737    1.081536
         11  |   .4571558   .3826765     1.19   0.232    -.2928765    1.207188
         12  |   .4955664   .3832924     1.29   0.196     -.255673    1.246806
         13  |   .4528917   .3840834     1.18   0.238     -.299898    1.205681
         14  |   .2910897   .3824433     0.76   0.447    -.4584853    1.040665
         15  |   .4469821   .3837121     1.16   0.244    -.3050799    1.199044
         16  |   .3591144   .3826842     0.94   0.348    -.3909329    1.109162
         17  |   .2807836   .4016239     0.70   0.484    -.5063849    1.067952
         18  |   .3629518   .3888206     0.93   0.351    -.3991226    1.125026
             |
    1.dunion |   .0585641   .0164995     3.55   0.000     .0262257    .0909024
  1.dmarital |   .1889823   .0203659     9.28   0.000     .1490658    .2288987
             |
        year |
       2005  |    .106335   .0299198     3.55   0.000     .0476933    .1649767
       2006  |   .0941883   .0290273     3.24   0.001     .0372959    .1510807
       2007  |   .0740973   .0265465     2.79   0.005      .022067    .1261275
       2008  |   .0650714   .0274375     2.37   0.018      .011295    .1188478
       2009  |   .0989574   .0244797     4.04   0.000     .0509781    .1469367
       2010  |   .0654043   .0251354     2.60   0.009     .0161398    .1146688
       2011  |   .0838353   .0247637     3.39   0.001     .0352994    .1323712
       2012  |    .080966   .0251366     3.22   0.001     .0316992    .1302328
       2013  |   .0778328   .0268613     2.90   0.004     .0251855      .13048
       2014  |   .1143558   .0270109     4.23   0.000     .0614155    .1672961
             |
   schooling |
         12  |   .1072558    .037814     2.84   0.005     .0331416    .1813699
         14  |   .0936099   .0504812     1.85   0.064    -.0053314    .1925512
         16  |   .2063672   .0520345     3.97   0.000     .1043814     .308353
             |
       dsize |
          1  |   .1011715   .0172074     5.88   0.000     .0674455    .1348974
          2  |   .2589553   .0222363    11.65   0.000     .2153731    .3025376
             |
  1.dregular |   .3436371     .04131     8.32   0.000     .2626709    .4246032
       _cons |   6.303748   .1837263    34.31   0.000     5.943651    6.663844
------------------------------------------------------------------------------
Instrumented:  emptenure oj workexp
Instruments:   2.occ 3.occ 4.occ 5.occ 6.occ 7.occ 8.occ 9.occ 10.occ 11.occ
               12.occ 2.ind 3.ind 4.ind 5.ind 6.ind 7.ind 8.ind 9.ind 10.ind
               11.ind 12.ind 13.ind 14.ind 15.ind 16.ind 17.ind 18.ind
               1.dunion 1.dmarital 2005.year 2006.year 2007.year 2008.year
               2009.year 2010.year 2011.year 2012.year 2013.year 2014.year
               12.schooling 14.schooling 16.schooling 1.dsize 2.dsize
               1.dregular emptenureiv ojiv workexpiv
/* AS's IV emp 2th order */

Instrumental variables (2SLS) regression          Number of obs   =      8,601
                                                  Wald chi2(51)   =    3711.17
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.3100
                                                  Root MSE        =     .46791

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   emptenure |   .0029139   .0056507     0.52   0.606    -.0081613    .0139891
             |
 c.emptenure#|
 c.emptenure |  -.0000686   .0001497    -0.46   0.647     -.000362    .0002249
             |
          oj |   .0530937   .0437399     1.21   0.225    -.0326349    .1388224
     workexp |   .0428357   .0078788     5.44   0.000     .0273936    .0582778
             |
   c.workexp#|
   c.workexp |  -.0007302   .0001471    -4.97   0.000    -.0010185    -.000442
             |
         occ |
          2  |   .0680149   .4271334     0.16   0.873    -.7691513     .905181
          3  |  -.2695536   .3452812    -0.78   0.435    -.9462924    .4071851
          4  |  -.3641721   .3456216    -1.05   0.292    -1.041578    .3132338
          5  |   .0881589   .3462577     0.25   0.799    -.5904936    .7668115
          6  |  -.1795078    .345879    -0.52   0.604    -.8574182    .4984025
          7  |  -.3608194   .3456267    -1.04   0.297    -1.038235    .3165964
          8  |   -.277997   .3462607    -0.80   0.422    -.9566555    .4006615
          9  |  -.1518413   .3475567    -0.44   0.662    -.8330399    .5293572
         10  |  -.1101733   .3467946    -0.32   0.751    -.7898783    .5695317
         11  |  -.4470174   .3453968    -1.29   0.196    -1.123983     .229948
         12  |  -.2399108   .3531759    -0.68   0.497    -.9321228    .4523012
             |
         ind |
          2  |   .0755778   .2352475     0.32   0.748    -.3854989    .5366545
          3  |   .2831513   .3845532     0.74   0.462    -.4705592    1.036862
          4  |   .3953976   .3586377     1.10   0.270    -.3075194    1.098315
          5  |   .4610369   .3586769     1.29   0.199     -.241957    1.164031
          6  |   .4009811   .3576212     1.12   0.262    -.2999436    1.101906
          7  |   .3534606   .3603719     0.98   0.327    -.3528554    1.059777
          8  |   .4343117   .3593308     1.21   0.227    -.2699637    1.138587
          9  |   .4926244   .3638713     1.35   0.176    -.2205503    1.205799
         10  |    .350994   .3587899     0.98   0.328    -.3522213    1.054209
         11  |   .4844305    .359232     1.35   0.177    -.2196513    1.188512
         12  |   .5347352   .3599072     1.49   0.137    -.1706699     1.24014
         13  |   .5154207   .3607585     1.43   0.153    -.1916531    1.222494
         14  |   .3244008   .3588519     0.90   0.366    -.3789361    1.027738
         15  |   .4863529   .3603817     1.35   0.177    -.2199823    1.192688
         16  |   .3922978   .3590473     1.09   0.275    -.3114219    1.096018
         17  |   .3495315   .3771395     0.93   0.354    -.3896482    1.088711
         18  |   .4020524   .3656789     1.10   0.272    -.3146651     1.11877
             |
    1.dunion |   .0725972   .0165388     4.39   0.000     .0401817    .1050126
  1.dmarital |   .1439843    .021235     6.78   0.000     .1023645    .1856042
             |
        year |
       2005  |   .0999476   .0296438     3.37   0.001     .0418468    .1580484
       2006  |   .0795083   .0288446     2.76   0.006     .0229739    .1360426
       2007  |   .0637559    .026203     2.43   0.015     .0123989    .1151128
       2008  |   .0521905   .0270364     1.93   0.054    -.0007999    .1051808
       2009  |   .0885898   .0241837     3.66   0.000     .0411906    .1359891
       2010  |   .0515885   .0249532     2.07   0.039     .0026811    .1004959
       2011  |   .0660608   .0246767     2.68   0.007     .0176954    .1144262
       2012  |   .0653999   .0250121     2.61   0.009     .0163771    .1144227
       2013  |   .0563298   .0269289     2.09   0.036     .0035502    .1091095
       2014  |   .0954906   .0267883     3.56   0.000     .0429865    .1479947
             |
   schooling |
         12  |   .0438457   .0407593     1.08   0.282     -.036041    .1237324
         14  |   .0426358   .0519981     0.82   0.412    -.0592785    .1445502
         16  |    .154409   .0534838     2.89   0.004     .0495827    .2592353
             |
       dsize |
          1  |   .1092483   .0171129     6.38   0.000     .0757077    .1427889
          2  |   .2628108   .0225408    11.66   0.000     .2186317    .3069898
             |
  1.dregular |   .2859716   .0443132     6.45   0.000     .1991192     .372824
       _cons |   6.059518   .1864188    32.50   0.000     5.694144    6.424892
------------------------------------------------------------------------------
Instrumented:  emptenure c.emptenure#c.emptenure oj workexp
               c.workexp#c.workexp
Instruments:   2.occ 3.occ 4.occ 5.occ 6.occ 7.occ 8.occ 9.occ 10.occ 11.occ
               12.occ 2.ind 3.ind 4.ind 5.ind 6.ind 7.ind 8.ind 9.ind 10.ind
               11.ind 12.ind 13.ind 14.ind 15.ind 16.ind 17.ind 18.ind
               1.dunion 1.dmarital 2005.year 2006.year 2007.year 2008.year
               2009.year 2010.year 2011.year 2012.year 2013.year 2014.year
               12.schooling 14.schooling 16.schooling 1.dsize 2.dsize
               1.dregular emptenureiv emptenureiv2 ojiv workexpiv workexpiv2
/* AS's IV emp 3th order */

Instrumental variables (2SLS) regression          Number of obs   =      8,601
                                                  Wald chi2(53)   =    3721.65
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.3095
                                                  Root MSE        =     .46808

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   emptenure |   .0038207   .0091322     0.42   0.676    -.0140781    .0217195
             |
 c.emptenure#|
 c.emptenure |    -.00012   .0005832    -0.21   0.837    -.0012631    .0010231
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure |   2.56e-07   9.66e-06     0.03   0.979    -.0000187    .0000192
             |
          oj |   .0561437   .0450681     1.25   0.213    -.0321881    .1444756
     workexp |   .0142881   .0160101     0.89   0.372     -.017091    .0456673
             |
   c.workexp#|
   c.workexp |   .0005729   .0006865     0.83   0.404    -.0007727    .0019184
             |
   c.workexp#|
   c.workexp#|
   c.workexp |  -.0000169   8.97e-06    -1.89   0.059    -.0000345    6.44e-07
             |
         occ |
          2  |   .1007154   .4262679     0.24   0.813    -.7347542    .9361851
          3  |  -.2679007     .34049    -0.79   0.431    -.9352489    .3994475
          4  |  -.3662603   .3410028    -1.07   0.283    -1.034614    .3020929
          5  |   .0857085   .3409754     0.25   0.802     -.582591     .754008
          6  |  -.1795778   .3408737    -0.53   0.598     -.847678    .4885225
          7  |  -.3626045   .3411145    -1.06   0.288    -1.031177    .3059676
          8  |  -.2800989   .3414553    -0.82   0.412    -.9493389    .3891411
          9  |  -.1470529   .3427012    -0.43   0.668    -.8187349    .5246291
         10  |   -.110185   .3418486    -0.32   0.747    -.7801959    .5598258
         11  |   -.456913   .3414427    -1.34   0.181    -1.126128    .2123024
         12  |  -.2406755   .3481191    -0.69   0.489    -.9229764    .4416254
             |
         ind |
          2  |   .0948154   .2364527     0.40   0.688    -.3686234    .5582542
          3  |   .2944164   .3818246     0.77   0.441    -.4539462    1.042779
          4  |   .4079079   .3542971     1.15   0.250    -.2865016    1.102317
          5  |   .4745427   .3545599     1.34   0.181    -.2203819    1.169467
          6  |   .4134677   .3535498     1.17   0.242    -.2794773    1.106413
          7  |   .3646022   .3561633     1.02   0.306     -.333465    1.062669
          8  |   .4459831   .3551117     1.26   0.209    -.2500231    1.141989
          9  |   .4964387   .3588744     1.38   0.167    -.2069422     1.19982
         10  |    .365046   .3546635     1.03   0.303    -.3300816    1.060174
         11  |   .4970901   .3550792     1.40   0.162    -.1988524    1.193033
         12  |    .547739   .3555899     1.54   0.123    -.1492044    1.244683
         13  |   .5274847   .3565606     1.48   0.139    -.1713612    1.226331
         14  |   .3362484   .3544584     0.95   0.343    -.3584773    1.030974
         15  |   .4961049    .356048     1.39   0.164    -.2017363    1.193946
         16  |    .402723   .3545615     1.14   0.256    -.2922047    1.097651
         17  |   .3638447   .3726826     0.98   0.329    -.3665998    1.094289
         18  |   .4133155   .3610224     1.14   0.252    -.2942754    1.120906
             |
    1.dunion |   .0726721   .0167395     4.34   0.000     .0398633    .1054808
  1.dmarital |   .1540302   .0216543     7.11   0.000     .1115885    .1964719
             |
        year |
       2005  |   .1022129   .0297022     3.44   0.001     .0439978    .1604281
       2006  |   .0821702   .0289513     2.84   0.005     .0254267    .1389137
       2007  |   .0665578   .0262837     2.53   0.011     .0150426    .1180729
       2008  |   .0547602   .0271788     2.01   0.044     .0014906    .1080297
       2009  |   .0912323   .0242774     3.76   0.000     .0436495    .1388151
       2010  |   .0551258   .0250576     2.20   0.028     .0060138    .1042378
       2011  |   .0706797   .0248184     2.85   0.004     .0220365    .1193229
       2012  |   .0704161   .0251714     2.80   0.005     .0210811    .1197511
       2013  |   .0604206   .0271134     2.23   0.026     .0072793    .1135618
       2014  |   .0994762   .0269845     3.69   0.000     .0465876    .1523648
             |
   schooling |
         12  |   .0400443   .0408463     0.98   0.327     -.040013    .1201017
         14  |   .0361396   .0521079     0.69   0.488      -.06599    .1382692
         16  |   .1461923   .0537083     2.72   0.006      .040926    .2514587
             |
       dsize |
          1  |    .111703   .0175184     6.38   0.000     .0773675    .1460385
          2  |   .2666215   .0235285    11.33   0.000     .2205065    .3127365
             |
  1.dregular |   .2865746   .0448756     6.39   0.000       .19862    .3745291
       _cons |   6.198477   .1944733    31.87   0.000     5.817317    6.579638
------------------------------------------------------------------------------
Instrumented:  emptenure c.emptenure#c.emptenure
               c.emptenure#c.emptenure#c.emptenure oj workexp
               c.workexp#c.workexp c.workexp#c.workexp#c.workexp
Instruments:   2.occ 3.occ 4.occ 5.occ 6.occ 7.occ 8.occ 9.occ 10.occ 11.occ
               12.occ 2.ind 3.ind 4.ind 5.ind 6.ind 7.ind 8.ind 9.ind 10.ind
               11.ind 12.ind 13.ind 14.ind 15.ind 16.ind 17.ind 18.ind
               1.dunion 1.dmarital 2005.year 2006.year 2007.year 2008.year
               2009.year 2010.year 2011.year 2012.year 2013.year 2014.year
               12.schooling 14.schooling 16.schooling 1.dsize 2.dsize
               1.dregular emptenureiv emptenureiv2 emptenureiv3 ojiv
               workexpiv workexpiv2 workexpiv3
/* AS's IV emp 4th order */

Instrumental variables (2SLS) regression          Number of obs   =      8,601
                                                  Wald chi2(55)   =    3730.07
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.3114
                                                  Root MSE        =     .46745

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   emptenure |   .0107938   .0142124     0.76   0.448    -.0170619    .0386495
             |
 c.emptenure#|
 c.emptenure |  -.0010163   .0014887    -0.68   0.495     -.003934    .0019015
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure |   .0000379   .0000566     0.67   0.503     -.000073    .0001488
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure#|
 c.emptenure |  -4.82e-07   6.87e-07    -0.70   0.483    -1.83e-06    8.65e-07
             |
          oj |   .0450504   .0482297     0.93   0.350     -.049478    .1395789
     workexp |   .0501309   .0279507     1.79   0.073    -.0046514    .1049131
             |
   c.workexp#|
   c.workexp |  -.0021979   .0020423    -1.08   0.282    -.0062007    .0018049
             |
   c.workexp#|
   c.workexp#|
   c.workexp |   .0000636    .000059     1.08   0.281     -.000052    .0001792
             |
   c.workexp#|
   c.workexp#|
   c.workexp#|
   c.workexp |  -7.86e-07   5.84e-07    -1.35   0.179    -1.93e-06    3.59e-07
             |
         occ |
          2  |   .1425069   .4314254     0.33   0.741    -.7030715    .9880852
          3  |  -.2474505   .3397314    -0.73   0.466    -.9133117    .4184107
          4  |  -.3443307   .3403772    -1.01   0.312    -1.011458    .3227965
          5  |   .1063006   .3402534     0.31   0.755    -.5605839     .773185
          6  |  -.1584378   .3401753    -0.47   0.641    -.8251692    .5082935
          7  |  -.3411289   .3405302    -1.00   0.316    -1.008556     .326298
          8  |  -.2603872   .3407267    -0.76   0.445    -.9281992    .4074247
          9  |  -.1260398   .3419328    -0.37   0.712    -.7962158    .5441362
         10  |  -.0894391    .341094    -0.26   0.793     -.757971    .5790929
         11  |  -.4349349   .3410555    -1.28   0.202    -1.103392    .2335216
         12  |  -.2189801   .3474301    -0.63   0.529    -.8999306    .4619704
             |
         ind |
          2  |   .0831037   .2366899     0.35   0.726       -.3808    .5470073
          3  |   .2753865   .3814728     0.72   0.470    -.4722865    1.023059
          4  |   .3858769   .3539624     1.09   0.276    -.3078767     1.07963
          5  |   .4540569   .3543813     1.28   0.200    -.2405177    1.148631
          6  |   .3914591   .3534017     1.11   0.268    -.3011955    1.084114
          7  |   .3429884   .3560459     0.96   0.335    -.3548488    1.040826
          8  |   .4243055   .3548895     1.20   0.232    -.2712652    1.119876
          9  |   .4735542   .3585439     1.32   0.187     -.229179    1.176287
         10  |   .3423009   .3544803     0.97   0.334    -.3524678    1.037069
         11  |   .4761271   .3549094     1.34   0.180    -.2194827    1.171737
         12  |   .5225211   .3554683     1.47   0.142     -.174184    1.219226
         13  |   .5045609   .3562365     1.42   0.157    -.1936497    1.202772
         14  |   .3150995   .3540949     0.89   0.374    -.3789137    1.009113
         15  |   .4724418   .3559033     1.33   0.184    -.2251159    1.169999
         16  |   .3804283   .3541886     1.07   0.283    -.3137687    1.074625
         17  |   .3381173   .3725224     0.91   0.364    -.3920131    1.068248
         18  |   .3890314   .3605945     1.08   0.281    -.3177209    1.095784
             |
    1.dunion |   .0698864   .0169369     4.13   0.000     .0366907     .103082
  1.dmarital |    .153647   .0216117     7.11   0.000     .1112888    .1960052
             |
        year |
       2005  |    .100427   .0296199     3.39   0.001     .0423731     .158481
       2006  |   .0812607   .0288666     2.82   0.005     .0246832    .1378382
       2007  |   .0665315   .0262308     2.54   0.011       .01512    .1179429
       2008  |   .0536765   .0271811     1.97   0.048     .0004026    .1069504
       2009  |   .0910844   .0242135     3.76   0.000     .0436269    .1385419
       2010  |   .0552655   .0249996     2.21   0.027     .0062671    .1042638
       2011  |   .0702085   .0247327     2.84   0.005     .0217334    .1186837
       2012  |   .0702585   .0251136     2.80   0.005     .0210369    .1194802
       2013  |    .060599   .0270405     2.24   0.025     .0076006    .1135975
       2014  |   .0998145   .0269253     3.71   0.000     .0470419    .1525871
             |
   schooling |
         12  |   .0427606   .0406127     1.05   0.292    -.0368389    .1223601
         14  |   .0376508   .0518489     0.73   0.468    -.0639712    .1392728
         16  |   .1474174   .0534693     2.76   0.006     .0426195    .2522154
             |
       dsize |
          1  |   .1110487   .0175231     6.34   0.000      .076704    .1453933
          2  |   .2664646   .0235009    11.34   0.000     .2204037    .3125254
             |
  1.dregular |   .2838784   .0450381     6.30   0.000     .1956053    .3721514
       _cons |   6.068862   .2041456    29.73   0.000     5.668744     6.46898
------------------------------------------------------------------------------
Instrumented:  emptenure c.emptenure#c.emptenure
               c.emptenure#c.emptenure#c.emptenure
               c.emptenure#c.emptenure#c.emptenure#c.emptenure oj workexp
               c.workexp#c.workexp c.workexp#c.workexp#c.workexp
               c.workexp#c.workexp#c.workexp#c.workexp
Instruments:   2.occ 3.occ 4.occ 5.occ 6.occ 7.occ 8.occ 9.occ 10.occ 11.occ
               12.occ 2.ind 3.ind 4.ind 5.ind 6.ind 7.ind 8.ind 9.ind 10.ind
               11.ind 12.ind 13.ind 14.ind 15.ind 16.ind 17.ind 18.ind
               1.dunion 1.dmarital 2005.year 2006.year 2007.year 2008.year
               2009.year 2010.year 2011.year 2012.year 2013.year 2014.year
               12.schooling 14.schooling 16.schooling 1.dsize 2.dsize
               1.dregular emptenureiv emptenureiv2 emptenureiv3 emptenureiv4
               ojiv workexpiv workexpiv2 workexpiv3 workexpiv4
/* AS's IV empocc 1th order */

Instrumental variables (2SLS) regression          Number of obs   =      8,463
                                                  Wald chi2(50)   =    3504.45
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.2994
                                                  Root MSE        =     .47094

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   emptenure |   .0007174   .0033238     0.22   0.829    -.0057972    .0072319
          oj |   .0567342   .0422411     1.34   0.179    -.0260568    .1395253
     workexp |   .0039789   .0038445     1.03   0.301    -.0035562    .0115139
   occtenure |  -.0003877   .0017802    -0.22   0.828    -.0038768    .0031013
             |
         occ |
          2  |   .0801668   .4003576     0.20   0.841    -.7045196    .8648533
          3  |  -.1953843   .3696149    -0.53   0.597    -.9198163    .5290476
          4  |  -.3030386   .3703208    -0.82   0.413    -1.028854    .4227768
          5  |   .1830269   .3699305     0.49   0.621    -.5420234    .9080773
          6  |  -.1026572   .3700748    -0.28   0.781    -.8279905     .622676
          7  |  -.2889387   .3700196    -0.78   0.435    -1.014164    .4362864
          8  |  -.1976889   .3706276    -0.53   0.594    -.9241057    .5287279
          9  |  -.0844586   .3720023    -0.23   0.820    -.8135696    .6446525
         10  |  -.0422284   .3712327    -0.11   0.909     -.769831    .6853742
         11  |  -.3887253   .3697206    -1.05   0.293    -1.113364    .3359138
         12  |  -.1467526   .3773523    -0.39   0.697    -.8863496    .5928444
             |
         ind |
          2  |   .0686358   .2560876     0.27   0.789    -.4332867    .5705582
          3  |   .2925329   .4043056     0.72   0.469    -.4998916    1.084957
          4  |   .3561922   .3810143     0.93   0.350    -.3905822    1.102966
          5  |   .4373133   .3810274     1.15   0.251    -.3094866    1.184113
          6  |   .3791111   .3799549     1.00   0.318    -.3655868    1.123809
          7  |   .3345899   .3826946     0.87   0.382    -.4154777    1.084658
          8  |   .4092397    .381663     1.07   0.284    -.3388061    1.157285
          9  |   .4583482   .3864891     1.19   0.236    -.2991565    1.215853
         10  |   .3340843   .3812332     0.88   0.381    -.4131191    1.081288
         11  |   .4593798   .3815597     1.20   0.229    -.2884635    1.207223
         12  |   .4966952    .382099     1.30   0.194    -.2522051    1.245596
         13  |   .4530764   .3828244     1.18   0.237    -.2972457    1.203399
         14  |   .2952908   .3813051     0.77   0.439    -.4520534    1.042635
         15  |   .4471811   .3825654     1.17   0.242    -.3026334    1.196996
         16  |   .3622391   .3815346     0.95   0.342    -.3855548    1.110033
         17  |   .2828235    .400636     0.71   0.480    -.5024087    1.068056
         18  |   .3633213   .3877112     0.94   0.349    -.3965787    1.123221
             |
    1.dunion |   .0620612   .0168035     3.69   0.000     .0291269    .0949954
  1.dmarital |   .1971321   .0211236     9.33   0.000     .1557306    .2385336
             |
        year |
       2005  |   .1061618   .0308535     3.44   0.001     .0456901    .1666334
       2006  |   .0938158   .0308625     3.04   0.002     .0333264    .1543052
       2007  |   .0725352   .0272952     2.66   0.008     .0190376    .1260327
       2008  |    .062329   .0284503     2.19   0.028     .0065673    .1180906
       2009  |    .097139    .024883     3.90   0.000     .0483692    .1459087
       2010  |   .0672536   .0260333     2.58   0.010     .0162294    .1182778
       2011  |   .0830034    .025892     3.21   0.001      .032256    .1337507
       2012  |   .0776944   .0257961     3.01   0.003     .0271349    .1282539
       2013  |   .0757349   .0278593     2.72   0.007     .0211317    .1303382
       2014  |   .1104157   .0280688     3.93   0.000     .0554019    .1654295
             |
   schooling |
         12  |   .1070681   .0403259     2.66   0.008     .0280308    .1861054
         14  |   .0944526   .0535508     1.76   0.078    -.0105049    .1994101
         16  |   .2080379   .0563123     3.69   0.000     .0976678    .3184079
             |
       dsize |
          1  |   .0962101   .0172079     5.59   0.000     .0624832    .1299371
          2  |   .2568181   .0226365    11.35   0.000     .2124514    .3011849
             |
  1.dregular |   .3385488   .0425496     7.96   0.000      .255153    .4219445
       _cons |   6.302088   .1922815    32.78   0.000     5.925223    6.678952
------------------------------------------------------------------------------
Instrumented:  emptenure oj workexp occtenure
Instruments:   2.occ 3.occ 4.occ 5.occ 6.occ 7.occ 8.occ 9.occ 10.occ 11.occ
               12.occ 2.ind 3.ind 4.ind 5.ind 6.ind 7.ind 8.ind 9.ind 10.ind
               11.ind 12.ind 13.ind 14.ind 15.ind 16.ind 17.ind 18.ind
               1.dunion 1.dmarital 2005.year 2006.year 2007.year 2008.year
               2009.year 2010.year 2011.year 2012.year 2013.year 2014.year
               12.schooling 14.schooling 16.schooling 1.dsize 2.dsize
               1.dregular emptenureiv ojiv workexpiv occtenureiv
/* AS's IV empocc 2th order */

Instrumental variables (2SLS) regression          Number of obs   =      8,463
                                                  Wald chi2(53)   =    3572.04
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.3047
                                                  Root MSE        =     .46916

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   emptenure |   .0037253   .0060194     0.62   0.536    -.0080725    .0155232
             |
 c.emptenure#|
 c.emptenure |  -.0001091   .0001643    -0.66   0.507    -.0004311     .000213
             |
          oj |   .0556049   .0444595     1.25   0.211    -.0315342     .142744
     workexp |    .044572   .0081954     5.44   0.000     .0285093    .0606348
             |
   c.workexp#|
   c.workexp |  -.0007569   .0001499    -5.05   0.000    -.0010507   -.0004631
             |
   occtenure |  -.0053457   .0042519    -1.26   0.209    -.0136792    .0029879
             |
 c.occtenure#|
 c.occtenure |   .0001591   .0001367     1.16   0.245    -.0001089    .0004271
             |
         occ |
          2  |   .0790795   .4174315     0.19   0.850    -.7390711    .8972301
          3  |  -.2579752   .3445354    -0.75   0.454    -.9332521    .4173018
          4  |  -.3588463   .3451047    -1.04   0.298    -1.035239    .3175465
          5  |   .0926779   .3452947     0.27   0.788    -.5840873     .769443
          6  |  -.1724308   .3450356    -0.50   0.617    -.8486882    .5038266
          7  |   -.350255    .344922    -1.02   0.310     -1.02629    .3257796
          8  |  -.2678591   .3455453    -0.78   0.438    -.9451155    .4093973
          9  |  -.1411976   .3468793    -0.41   0.684    -.8210686    .5386734
         10  |  -.1033839   .3461143    -0.30   0.765    -.7817554    .5749875
         11  |  -.4421706   .3443797    -1.28   0.199    -1.117142    .2328013
         12  |  -.2352218   .3530315    -0.67   0.505    -.9271508    .4567073
             |
         ind |
          2  |   .0684732   .2375382     0.29   0.773    -.3970932    .5340396
          3  |    .271356    .383754     0.71   0.479    -.4807879      1.0235
          4  |   .3807121   .3576934     1.06   0.287     -.320354    1.081778
          5  |   .4498938   .3578598     1.26   0.209    -.2514985    1.151286
          6  |   .3912701   .3568498     1.10   0.273    -.3081427    1.090683
          7  |   .3509825    .359683     0.98   0.329    -.3539833    1.055948
          8  |   .4290164    .358417     1.20   0.231    -.2734679    1.131501
          9  |   .4615432   .3632135     1.27   0.204    -.2503422    1.173429
         10  |    .339225   .3578928     0.95   0.343    -.3622321    1.040682
         11  |   .4716196   .3584284     1.32   0.188    -.2308871    1.174126
         12  |   .5174486   .3591942     1.44   0.150    -.1865591    1.221456
         13  |   .5003527   .3598007     1.39   0.164    -.2048437    1.205549
         14  |   .3113225   .3579043     0.87   0.384    -.3901571    1.012802
         15  |   .4742116   .3595896     1.32   0.187     -.230571    1.178994
         16  |   .3805814    .358064     1.06   0.288     -.321211    1.082374
         17  |   .3366652    .376781     0.89   0.372    -.4018119    1.075142
         18  |   .3812646   .3649069     1.04   0.296    -.3339399    1.096469
             |
    1.dunion |   .0774361   .0172414     4.49   0.000     .0436435    .1112287
  1.dmarital |   .1539458    .021655     7.11   0.000     .1115028    .1963888
             |
        year |
       2005  |   .0947799   .0308998     3.07   0.002     .0342175    .1553423
       2006  |   .0724915   .0312381     2.32   0.020     .0112659    .1337171
       2007  |   .0570156   .0271574     2.10   0.036      .003788    .1102431
       2008  |   .0429173   .0283764     1.51   0.130    -.0126993    .0985339
       2009  |   .0847828   .0246976     3.43   0.001     .0363763    .1331893
       2010  |   .0479625   .0261942     1.83   0.067    -.0033771    .0993021
       2011  |   .0592985   .0261569     2.27   0.023     .0080318    .1105651
       2012  |   .0569873   .0259061     2.20   0.028     .0062124    .1077623
       2013  |   .0473439   .0282049     1.68   0.093    -.0079367    .1026246
       2014  |   .0849063   .0280975     3.02   0.003     .0298361    .1399764
             |
   schooling |
         12  |   .0458806    .042801     1.07   0.284    -.0380078    .1297689
         14  |   .0442039   .0547001     0.81   0.419    -.0630063     .151414
         16  |   .1576824   .0575186     2.74   0.006      .044948    .2704167
             |
       dsize |
          1  |   .1039258   .0171892     6.05   0.000     .0702357    .1376159
          2  |   .2607023    .023387    11.15   0.000     .2148645    .3065401
             |
  1.dregular |   .2855552   .0451361     6.33   0.000     .1970901    .3740203
       _cons |   6.052101   .1959412    30.89   0.000     5.668063    6.436139
------------------------------------------------------------------------------
Instrumented:  emptenure c.emptenure#c.emptenure oj workexp
               c.workexp#c.workexp occtenure c.occtenure#c.occtenure
Instruments:   2.occ 3.occ 4.occ 5.occ 6.occ 7.occ 8.occ 9.occ 10.occ 11.occ
               12.occ 2.ind 3.ind 4.ind 5.ind 6.ind 7.ind 8.ind 9.ind 10.ind
               11.ind 12.ind 13.ind 14.ind 15.ind 16.ind 17.ind 18.ind
               1.dunion 1.dmarital 2005.year 2006.year 2007.year 2008.year
               2009.year 2010.year 2011.year 2012.year 2013.year 2014.year
               12.schooling 14.schooling 16.schooling 1.dsize 2.dsize
               1.dregular emptenureiv emptenureiv2 ojiv workexpiv workexpiv2
               occtenureiv occtenureiv2
/* AS's IV empocc 3th order */

Instrumental variables (2SLS) regression          Number of obs   =      8,463
                                                  Wald chi2(56)   =    3527.34
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.2987
                                                  Root MSE        =     .47119

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   emptenure |   .0070542   .0099117     0.71   0.477    -.0123723    .0264808
             |
 c.emptenure#|
 c.emptenure |  -.0003029   .0006294    -0.48   0.630    -.0015366    .0009308
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure |   2.07e-06   .0000104     0.20   0.842    -.0000183    .0000225
             |
          oj |    .052248   .0461099     1.13   0.257    -.0381257    .1426217
     workexp |   .0163216   .0166744     0.98   0.328    -.0163596    .0490027
             |
   c.workexp#|
   c.workexp |   .0005637   .0007075     0.80   0.426     -.000823    .0019504
             |
   c.workexp#|
   c.workexp#|
   c.workexp |  -.0000174   9.21e-06    -1.89   0.058    -.0000355    6.10e-07
             |
   occtenure |   .0007245   .0070088     0.10   0.918    -.0130125    .0144615
             |
 c.occtenure#|
 c.occtenure |  -.0003816   .0005281    -0.72   0.470    -.0014167    .0006535
             |
 c.occtenure#|
 c.occtenure#|
 c.occtenure |   .0000105   9.93e-06     1.06   0.291    -8.97e-06    .0000299
             |
         occ |
          2  |   .0897485   .4174203     0.22   0.830    -.7283803    .9078773
          3  |  -.2878051   .3391529    -0.85   0.396    -.9525327    .3769224
          4  |  -.3891998   .3397706    -1.15   0.252    -1.055138    .2767384
          5  |   .0672433   .3392326     0.20   0.843    -.5976403     .732127
          6  |  -.1998353   .3393492    -0.59   0.556    -.8649475     .465277
          7  |  -.3866535    .339871    -1.14   0.255    -1.052788    .2794814
          8  |  -.3018901   .3401998    -0.89   0.375    -.9686694    .3648893
          9  |   -.169086   .3415312    -0.50   0.621    -.8384749    .5003029
         10  |  -.1325328    .340586    -0.39   0.697    -.8000691    .5350035
         11  |  -.4906898   .3402031    -1.44   0.149    -1.157476     .176096
         12  |  -.2625572   .3474262    -0.76   0.450       -.9435    .4183856
             |
         ind |
          2  |   .1160011   .2388784     0.49   0.627     -.352192    .5841942
          3  |   .3044921   .3806236     0.80   0.424    -.4415165    1.050501
          4  |   .4267184   .3530749     1.21   0.227    -.2652957    1.118733
          5  |   .5010447   .3536407     1.42   0.157    -.1920783    1.194168
          6  |   .4412158   .3525568     1.25   0.211    -.2497829    1.132215
          7  |   .3951223    .355091     1.11   0.266    -.3008433    1.091088
          8  |   .4773396   .3540288     1.35   0.178     -.216544    1.171223
          9  |   .4973245    .357984     1.39   0.165    -.2043112     1.19896
         10  |   .3899736   .3535697     1.10   0.270    -.3030103    1.082958
         11  |   .5207651   .3541201     1.47   0.141    -.1732975    1.214828
         12  |   .5664029   .3547073     1.60   0.110    -.1288106    1.261616
         13  |   .5471616   .3553142     1.54   0.124    -.1492414    1.243565
         14  |   .3565155   .3532425     1.01   0.313    -.3358271    1.048858
         15  |   .5182334   .3549621     1.46   0.144    -.1774795    1.213946
         16  |   .4263283   .3534405     1.21   0.228    -.2664024    1.119059
         17  |    .390562   .3725904     1.05   0.295    -.3397018    1.120826
         18  |    .425798   .3599767     1.18   0.237    -.2797433    1.131339
             |
    1.dunion |   .0792699   .0174378     4.55   0.000     .0450926    .1134473
  1.dmarital |    .164563   .0221934     7.41   0.000     .1210648    .2080613
             |
        year |
       2005  |   .0972826   .0311408     3.12   0.002     .0362477    .1583176
       2006  |   .0748086    .031544     2.37   0.018     .0129835    .1366337
       2007  |   .0593131   .0274638     2.16   0.031      .005485    .1131411
       2008  |   .0439099   .0288315     1.52   0.128    -.0125989    .1004187
       2009  |    .086603   .0249547     3.47   0.001     .0376926    .1355134
       2010  |    .050886   .0265596     1.92   0.055    -.0011699    .1029419
       2011  |   .0635378   .0265105     2.40   0.017     .0115783    .1154974
       2012  |   .0605415   .0262946     2.30   0.021     .0090051    .1120779
       2013  |   .0499314   .0286337     1.74   0.081    -.0061896    .1060525
       2014  |   .0853355   .0288003     2.96   0.003     .0288879    .1417831
             |
   schooling |
         12  |    .037833   .0431255     0.88   0.380    -.0466915    .1223575
         14  |   .0323531   .0553203     0.58   0.559    -.0760728    .1407789
         16  |   .1426035   .0583747     2.44   0.015     .0281912    .2570159
             |
       dsize |
          1  |     .10836   .0176143     6.15   0.000     .0738365    .1428834
          2  |   .2695724   .0245069    11.00   0.000     .2215398     .317605
             |
  1.dregular |   .2883737   .0461524     6.25   0.000     .1979166    .3788309
       _cons |   6.175046   .2059976    29.98   0.000     5.771298    6.578794
------------------------------------------------------------------------------
Instrumented:  emptenure c.emptenure#c.emptenure
               c.emptenure#c.emptenure#c.emptenure oj workexp
               c.workexp#c.workexp c.workexp#c.workexp#c.workexp occtenure
               c.occtenure#c.occtenure c.occtenure#c.occtenure#c.occtenure
Instruments:   2.occ 3.occ 4.occ 5.occ 6.occ 7.occ 8.occ 9.occ 10.occ 11.occ
               12.occ 2.ind 3.ind 4.ind 5.ind 6.ind 7.ind 8.ind 9.ind 10.ind
               11.ind 12.ind 13.ind 14.ind 15.ind 16.ind 17.ind 18.ind
               1.dunion 1.dmarital 2005.year 2006.year 2007.year 2008.year
               2009.year 2010.year 2011.year 2012.year 2013.year 2014.year
               12.schooling 14.schooling 16.schooling 1.dsize 2.dsize
               1.dregular emptenureiv emptenureiv2 emptenureiv3 ojiv
               workexpiv workexpiv2 workexpiv3 occtenureiv occtenureiv2
               occtenureiv3
/* AS's IV empocc 4th order */

Instrumental variables (2SLS) regression          Number of obs   =      8,463
                                                  Wald chi2(59)   =    3591.49
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.3013
                                                  Root MSE        =     .47032

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   emptenure |    .009709    .015395     0.63   0.528    -.0204647    .0398827
             |
 c.emptenure#|
 c.emptenure |  -.0005917   .0016601    -0.36   0.722    -.0038454    .0026619
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure |   .0000133   .0000656     0.20   0.839    -.0001152    .0001418
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure#|
 c.emptenure |  -1.42e-07   8.14e-07    -0.17   0.862    -1.74e-06    1.45e-06
             |
          oj |   .0471144   .0491828     0.96   0.338    -.0492821    .1435108
     workexp |   .0549337   .0294802     1.86   0.062    -.0028464    .1127138
             |
   c.workexp#|
   c.workexp |  -.0024695   .0021336    -1.16   0.247    -.0066512    .0017123
             |
   c.workexp#|
   c.workexp#|
   c.workexp |   .0000716   .0000613     1.17   0.243    -.0000486    .0001917
             |
   c.workexp#|
   c.workexp#|
   c.workexp#|
   c.workexp |  -8.75e-07   6.05e-07    -1.45   0.148    -2.06e-06    3.11e-07
             |
   occtenure |   .0023319   .0113342     0.21   0.837    -.0198827    .0245466
             |
 c.occtenure#|
 c.occtenure |  -.0007061   .0015944    -0.44   0.658    -.0038311    .0024189
             |
 c.occtenure#|
 c.occtenure#|
 c.occtenure |   .0000268   .0000672     0.40   0.690     -.000105    .0001586
             |
 c.occtenure#|
 c.occtenure#|
 c.occtenure#|
 c.occtenure |  -2.34e-07   8.49e-07    -0.28   0.783    -1.90e-06    1.43e-06
             |
         occ |
          2  |   .1300882   .4204042     0.31   0.757    -.6938889    .9540654
          3  |  -.2672158    .336025    -0.80   0.426    -.9258126    .3913811
          4  |  -.3688608   .3366638    -1.10   0.273     -1.02871    .2909882
          5  |   .0917761   .3367722     0.27   0.785    -.5682853    .7518375
          6  |  -.1783266   .3363932    -0.53   0.596    -.8376451     .480992
          7  |  -.3654974   .3368542    -1.09   0.278     -1.02572    .2947247
          8  |  -.2815792   .3370792    -0.84   0.404    -.9422423    .3790838
          9  |  -.1489112   .3383361    -0.44   0.660    -.8120377    .5142153
         10  |  -.1124172   .3373983    -0.33   0.739    -.7737058    .5488713
         11  |   -.470039   .3375127    -1.39   0.164    -1.131552    .1914737
         12  |   -.241259    .344368    -0.70   0.484    -.9162079      .43369
             |
         ind |
          2  |     .10839   .2381646     0.46   0.649    -.3584041     .575184
          3  |    .285804   .3783265     0.76   0.450    -.4557023     1.02731
          4  |   .4078795   .3503125     1.16   0.244    -.2787204    1.094479
          5  |   .4835448   .3510544     1.38   0.168    -.2045091    1.171599
          6  |   .4219435   .3500199     1.21   0.228    -.2640829     1.10797
          7  |   .3756365   .3526615     1.07   0.287    -.3155674     1.06684
          8  |   .4575157   .3514982     1.30   0.193    -.2314082     1.14644
          9  |   .4766217   .3555159     1.34   0.180    -.2201767     1.17342
         10  |   .3694372   .3510667     1.05   0.293    -.3186409    1.057515
         11  |   .5018063   .3515263     1.43   0.153    -.1871725    1.190785
         12  |   .5443368   .3522559     1.55   0.122     -.146072    1.234746
         13  |   .5262501   .3527218     1.49   0.136     -.165072    1.217572
         14  |   .3361886   .3505092     0.96   0.337    -.3507968    1.023174
         15  |   .4976998   .3524954     1.41   0.158    -.1931784    1.188578
         16  |   .4057306   .3507661     1.16   0.247    -.2817584     1.09322
         17  |   .3676234   .3704528     0.99   0.321    -.3584508    1.093698
         18  |   .4044361   .3572904     1.13   0.258    -.2958403    1.104712
             |
    1.dunion |   .0769192   .0177115     4.34   0.000     .0422052    .1116332
  1.dmarital |   .1650993   .0223162     7.40   0.000     .1213604    .2088381
             |
        year |
       2005  |   .0953701   .0310975     3.07   0.002     .0344201    .1563202
       2006  |   .0736747   .0315355     2.34   0.019     .0118662    .1354832
       2007  |   .0589255   .0274395     2.15   0.032     .0051449     .112706
       2008  |   .0428702   .0288942     1.48   0.138    -.0137613    .0995018
       2009  |    .086564   .0249146     3.47   0.001     .0377323    .1353956
       2010  |   .0510531   .0264659     1.93   0.054    -.0008192    .1029254
       2011  |   .0632477   .0264187     2.39   0.017      .011468    .1150275
       2012  |   .0610582   .0262565     2.33   0.020     .0095964    .1125201
       2013  |   .0506762   .0285912     1.77   0.076    -.0053614    .1067139
       2014  |   .0887144   .0300477     2.95   0.003      .029822    .1476068
             |
   schooling |
         12  |    .037998    .043187     0.88   0.379    -.0466469    .1226428
         14  |   .0301073   .0559352     0.54   0.590    -.0795236    .1397383
         16  |   .1396722   .0590914     2.36   0.018     .0238551    .2554893
             |
       dsize |
          1  |     .10748   .0174923     6.14   0.000     .0731957    .1417644
          2  |   .2699639   .0247127    10.92   0.000     .2215278    .3183999
             |
  1.dregular |   .2823831    .045793     6.17   0.000     .1926306    .3721357
       _cons |   6.043754   .2177852    27.75   0.000     5.616903    6.470605
------------------------------------------------------------------------------
Instrumented:  emptenure c.emptenure#c.emptenure
               c.emptenure#c.emptenure#c.emptenure
               c.emptenure#c.emptenure#c.emptenure#c.emptenure oj workexp
               c.workexp#c.workexp c.workexp#c.workexp#c.workexp
               c.workexp#c.workexp#c.workexp#c.workexp occtenure
               c.occtenure#c.occtenure c.occtenure#c.occtenure#c.occtenure
               c.occtenure#c.occtenure#c.occtenure#c.occtenure
Instruments:   2.occ 3.occ 4.occ 5.occ 6.occ 7.occ 8.occ 9.occ 10.occ 11.occ
               12.occ 2.ind 3.ind 4.ind 5.ind 6.ind 7.ind 8.ind 9.ind 10.ind
               11.ind 12.ind 13.ind 14.ind 15.ind 16.ind 17.ind 18.ind
               1.dunion 1.dmarital 2005.year 2006.year 2007.year 2008.year
               2009.year 2010.year 2011.year 2012.year 2013.year 2014.year
               12.schooling 14.schooling 16.schooling 1.dsize 2.dsize
               1.dregular emptenureiv emptenureiv2 emptenureiv3 emptenureiv4
               ojiv workexpiv workexpiv2 workexpiv3 workexpiv4 occtenureiv
               occtenureiv2 occtenureiv3 occtenureiv4
. 
. ** culc. return
. qui{
. 
. foreach ten_i of local isIncOcc{ /* loop within emp and empocc */
  2.         forvalues poly_x=1/4{ /* loop within ten_inomial */
  3.                 *** culculation
.                 dis "/* `ten_i' `poly_x'th order */"
  4.                 est res ols`ten_i'`poly_x'
  5.                 margins, exp(`culcemp`poly_x'') ///
>                 at(emptenure=(0(1)25)) noe post
  6.                 est sto ols`ten_i'r`poly_x'
  7.                 est res isv`ten_i'`poly_x'
  8.                 margins, exp(`culcemp`poly_x'') ///
>                 at(emptenure=(0(1)25)) noe post
  9.                 est sto isv`ten_i'r`poly_x'
 10.                 
.                 *** plot
.                 qui coefplot (ols`ten_i'r`poly_x', label(OLS)) (isv`ten_i'r`pol
> y_x', label(IV)), ///
>                 `comSetPlot'
 11.                 graph export "$Output\plot_as_`ten_i'_`poly_x'.pdf", replace
 12.         }
 13. }
/* emp 1th order */
(results olsemp1 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .1036268   .0252218     4.11   0.000      .054193    .1530606
          2  |   .1133085   .0250991     4.51   0.000     .0641152    .1625018
          3  |   .1229901   .0249904     4.92   0.000     .0740098    .1719705
          4  |   .1326718   .0248961     5.33   0.000     .0838764    .1814672
          5  |   .1423534   .0248161     5.74   0.000     .0937147    .1909922
          6  |   .1520351   .0247508     6.14   0.000     .1035245    .2005457
          7  |   .1617167   .0247001     6.55   0.000     .1133054     .210128
          8  |   .1713984   .0246642     6.95   0.000     .1230574    .2197393
          9  |     .18108   .0246431     7.35   0.000     .1327804    .2293797
         10  |   .1907617    .024637     7.74   0.000     .1424741    .2390492
         11  |   .2004433   .0246457     8.13   0.000     .1521387     .248748
         12  |    .210125   .0246693     8.52   0.000     .1617741    .2584759
         13  |   .2198066   .0247077     8.90   0.000     .1713804    .2682328
         14  |   .2294883   .0247609     9.27   0.000     .1809579    .2780187
         15  |   .2391699   .0248287     9.63   0.000     .1905065    .2878334
         16  |   .2488516   .0249111     9.99   0.000     .2000266    .2976765
         17  |   .2585332    .025008    10.34   0.000     .2095186    .3075479
         18  |   .2682149    .025119    10.68   0.000     .2189825    .3174472
         19  |   .2778965   .0252441    11.01   0.000      .228419    .3273741
         20  |   .2875782    .025383    11.33   0.000     .2378283     .337328
         21  |   .2972598   .0255356    11.64   0.000      .247211    .3473087
         22  |   .3069415   .0257015    11.94   0.000     .2565674    .3573156
         23  |   .3166231   .0258806    12.23   0.000     .2658981    .3673482
         24  |   .3263048   .0260725    12.52   0.000     .2752036    .3774059
         25  |   .3359864    .026277    12.79   0.000     .2844846    .3874883
         26  |   .3456681   .0264937    13.05   0.000     .2937414    .3975948
------------------------------------------------------------------------------
(results isvemp1 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0563925   .0418876     1.35   0.178    -.0257056    .1384907
          2  |   .0570346   .0408898     1.39   0.163    -.0231078    .1371771
          3  |   .0576767   .0401407     1.44   0.151    -.0209977    .1363511
          4  |   .0583188   .0396546     1.47   0.141    -.0194028    .1360405
          5  |   .0589609   .0394411     1.49   0.135    -.0183423    .1362641
          6  |    .059603   .0395047     1.51   0.131    -.0178248    .1370308
          7  |   .0602451    .039844     1.51   0.131    -.0178477    .1383379
          8  |   .0608872   .0404521     1.51   0.132    -.0183974    .1401718
          9  |   .0615293   .0413171     1.49   0.136    -.0194506    .1425093
         10  |   .0621714   .0424233     1.47   0.143    -.0209767    .1453195
         11  |   .0628135   .0437524     1.44   0.151    -.0229396    .1485666
         12  |   .0634556   .0452848     1.40   0.161     -.025301    .1522121
         13  |   .0640977   .0470006     1.36   0.173    -.0280218    .1562172
         14  |   .0647398   .0488805     1.32   0.185    -.0310643    .1605439
         15  |   .0653819   .0509064     1.28   0.199    -.0343928    .1651565
         16  |    .066024   .0530614     1.24   0.213    -.0379745    .1700225
         17  |   .0666661   .0553306     1.20   0.228    -.0417799    .1751121
         18  |   .0673082   .0577004     1.17   0.243    -.0457826     .180399
         19  |   .0679503    .060159     1.13   0.259    -.0499593    .1858598
         20  |   .0685924   .0626959     1.09   0.274    -.0542894    .1914742
         21  |   .0692345    .065302     1.06   0.289    -.0587552    .1972241
         22  |   .0698766   .0679694     1.03   0.304     -.063341    .2030941
         23  |   .0705187    .070691     1.00   0.318    -.0680332    .2090705
         24  |   .0711608   .0734609     0.97   0.333      -.07282    .2151415
         25  |   .0718029   .0762739     0.94   0.347    -.0776911    .2212969
         26  |   .0724449   .0791252     0.92   0.360    -.0826376    .2275275
------------------------------------------------------------------------------
(file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Ou
> tput\plot_as_emp_1.pdf written in PDF format)
/* emp 2th order */
(results olsemp2 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |    .075954   .0266971     2.85   0.004     .0236286    .1282794
          2  |   .0900395   .0260623     3.45   0.001     .0389583    .1411207
          3  |   .1038543   .0255673     4.06   0.000     .0537434    .1539653
          4  |   .1173986   .0252009     4.66   0.000     .0680058    .1667913
          5  |   .1306722   .0249502     5.24   0.000     .0817706    .1795737
          6  |   .1436752   .0248015     5.79   0.000     .0950652    .1922852
          7  |   .1564076   .0247402     6.32   0.000     .1079177    .2048974
          8  |   .1688693   .0247518     6.82   0.000     .1203566     .217382
          9  |   .1810605   .0248225     7.29   0.000     .1324093    .2297116
         10  |    .192981    .024939     7.74   0.000     .1441015    .2418604
         11  |   .2046309   .0250892     8.16   0.000      .155457    .2538048
         12  |   .2160102   .0252624     8.55   0.000     .1664968    .2655235
         13  |   .2271188    .025449     8.92   0.000     .1772396    .2769981
         14  |   .2379569   .0256411     9.28   0.000     .1877012    .2882126
         15  |   .2485243   .0258319     9.62   0.000     .1978948    .2991539
         16  |   .2588211   .0260159     9.95   0.000      .207831    .3098113
         17  |   .2688473    .026189    10.27   0.000     .2175179    .3201768
         18  |   .2786029   .0263482    10.57   0.000     .2269613    .3302445
         19  |   .2880879   .0264918    10.87   0.000     .2361649    .3400109
         20  |   .2973022    .026619    11.17   0.000       .24513    .3494745
         21  |    .306246   .0267302    11.46   0.000     .2538558    .3586361
         22  |   .3149191   .0268267    11.74   0.000     .2623397    .3674984
         23  |   .3233216   .0269111    12.01   0.000     .2705768    .3760663
         24  |   .3314534   .0269868    12.28   0.000     .2785603    .3843465
         25  |   .3393147   .0270582    12.54   0.000     .2862815    .3923479
         26  |   .3469053    .027131    12.79   0.000     .2937295    .4000811
------------------------------------------------------------------------------
(results isvemp2 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0530937   .0437399     1.21   0.225    -.0326349    .1388224
          2  |   .0559391   .0417785     1.34   0.181    -.0259452    .1378234
          3  |   .0586473   .0405058     1.45   0.148    -.0207426    .1380372
          4  |   .0612185   .0398951     1.53   0.125    -.0169745    .1394114
          5  |   .0636525   .0398908     1.60   0.111     -.014532     .141837
          6  |   .0659494   .0404149     1.63   0.103    -.0132624    .1451612
          7  |   .0681092   .0413776     1.65   0.100    -.0129894    .1492079
          8  |    .070132   .0426879     1.64   0.100    -.0135347    .1537986
          9  |   .0720176   .0442616     1.63   0.104    -.0147336    .1587688
         10  |   .0737661   .0460267     1.60   0.109    -.0164446    .1639768
         11  |   .0753775   .0479241     1.57   0.116    -.0185519    .1693069
         12  |   .0768518   .0499076     1.54   0.124    -.0209653    .1746689
         13  |    .078189   .0519429     1.51   0.132    -.0236173    .1799953
         14  |   .0793891   .0540055     1.47   0.142    -.0264597    .1852379
         15  |   .0804521    .056079     1.43   0.151    -.0294608     .190365
         16  |    .081378   .0581543     1.40   0.162    -.0326024    .1953584
         17  |   .0821668   .0602279     1.36   0.172    -.0358777    .2002112
         18  |   .0828184   .0623009     1.33   0.184    -.0392891     .204926
         19  |    .083333   .0643787     1.29   0.196    -.0428469    .2095129
         20  |   .0837105   .0664699     1.26   0.208    -.0465681     .213989
         21  |   .0839509    .068586     1.22   0.221    -.0504753     .218377
         22  |   .0840541    .070741     1.19   0.235    -.0545957     .222704
         23  |   .0840203   .0729508     1.15   0.249    -.0589607    .2270013
         24  |   .0838493    .075233     1.11   0.265    -.0636046    .2313032
         25  |   .0835413   .0776062     1.08   0.282     -.068564    .2356466
         26  |   .0830961   .0800901     1.04   0.299    -.0738776    .2400699
------------------------------------------------------------------------------
(file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Ou
> tput\plot_as_emp_2.pdf written in PDF format)
/* emp 3th order */
(results olsemp3 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]
               +(emptenure^3)*_b[c.emptenure#c.emptenure#c.emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0879997   .0293032     3.00   0.003     .0305664     .145433
          2  |   .1000005   .0273848     3.65   0.000     .0463274    .1536737
          3  |   .1120451   .0260969     4.29   0.000     .0608961    .1631941
          4  |   .1241149   .0253305     4.90   0.000     .0744681    .1737617
          5  |   .1361911   .0249639     5.46   0.000     .0872627    .1851194
          6  |    .148255    .024879     5.96   0.000      .099493     .197017
          7  |    .160288   .0249731     6.42   0.000     .1113417    .2092344
          8  |   .1722714   .0251648     6.85   0.000     .1229492    .2215936
          9  |   .1841865    .025395     7.25   0.000     .1344132    .2339598
         10  |   .1960145   .0256241     7.65   0.000     .1457923    .2462368
         11  |   .2077369   .0258285     8.04   0.000     .1571141    .2583598
         12  |   .2193349    .025997     8.44   0.000     .1683817    .2702881
         13  |   .2307898   .0261278     8.83   0.000     .1795803    .2819994
         14  |    .242083   .0262254     9.23   0.000     .1906822    .2934838
         15  |   .2531957   .0262985     9.63   0.000     .2016516    .3047399
         16  |   .2641093   .0263586    10.02   0.000     .2124474    .3157713
         17  |   .2748051   .0264177    10.40   0.000     .2230273    .3265829
         18  |   .2852644   .0264877    10.77   0.000     .2333495    .3371792
         19  |   .2954684   .0265785    11.12   0.000     .2433754    .3475614
         20  |   .3053986   .0266981    11.44   0.000     .2530713    .3577258
         21  |   .3150361   .0268509    11.73   0.000     .2624094    .3676629
         22  |   .3243624   .0270382    12.00   0.000     .2713686    .3773563
         23  |   .3333588   .0272578    12.23   0.000     .2799345     .386783
         24  |   .3420065   .0275043    12.43   0.000     .2880992    .3959138
         25  |   .3502869   .0277696    12.61   0.000     .2958595    .4047143
         26  |   .3581812   .0280439    12.77   0.000     .3032162    .4131462
------------------------------------------------------------------------------
(results isvemp3 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]
               +(emptenure^3)*_b[c.emptenure#c.emptenure#c.emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0561437   .0450681     1.25   0.213    -.0321881    .1444756
          2  |   .0598446    .042048     1.42   0.155    -.0225679    .1422572
          3  |    .063307   .0406375     1.56   0.119     -.016341    .1429551
          4  |   .0665325   .0404837     1.64   0.100     -.012814     .145879
          5  |   .0695225   .0411981     1.69   0.092    -.0112243    .1502694
          6  |   .0722787   .0424387     1.70   0.089    -.0108997    .1554571
          7  |   .0748025   .0439497     1.70   0.089    -.0113372    .1609423
          8  |   .0770955   .0455635     1.69   0.091    -.0122073    .1663984
          9  |   .0791593   .0471853     1.68   0.093    -.0133222    .1716408
         10  |   .0809953   .0487735     1.66   0.097    -.0145991    .1765897
         11  |   .0826051   .0503235     1.64   0.101    -.0160272    .1812375
         12  |   .0839903   .0518548     1.62   0.105    -.0176432    .1856239
         13  |   .0851524   .0534014     1.59   0.111    -.0195124    .1898171
         14  |   .0860929   .0550041     1.57   0.118    -.0217132    .1938989
         15  |   .0868133    .056705     1.53   0.126    -.0243265     .197953
         16  |   .0873152   .0585423     1.49   0.136    -.0274256    .2020561
         17  |   .0876002   .0605472     1.45   0.148    -.0310701    .2062705
         18  |   .0876697   .0627412     1.40   0.162    -.0353008    .2106402
         19  |   .0875254   .0651353     1.34   0.179    -.0401375    .2151882
         20  |   .0871687   .0677298     1.29   0.198    -.0455792    .2199166
         21  |   .0866011    .070515     1.23   0.219    -.0516058     .224808
         22  |   .0858243   .0734733     1.17   0.243    -.0581806    .2298293
         23  |   .0848398   .0765803     1.11   0.268    -.0652549    .2349345
         24  |    .083649   .0798079     1.05   0.295    -.0727716    .2400697
         25  |   .0822536   .0831254     0.99   0.322    -.0806693    .2451765
         26  |   .0806551   .0865022     0.93   0.351    -.0888862    .2501963
------------------------------------------------------------------------------
(file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Ou
> tput\plot_as_emp_3.pdf written in PDF format)
/* emp 4th order */
(results olsemp4 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]
               +(emptenure^3)*_b[c.emptenure#c.emptenure#c.emptenure]
               +(emptenure^4)*_b[c.emptenure#c.emptenure#c.emptenure#c.emptenur
               > e]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0786059   .0329425     2.39   0.017     .0140398     .143172
          2  |   .0938997   .0287045     3.27   0.001       .03764    .1501594
          3  |   .1084807   .0263392     4.12   0.000     .0568568    .1601046
          4  |   .1224265   .0253316     4.83   0.000     .0727774    .1720756
          5  |   .1358094   .0251371     5.40   0.000     .0865415    .1850773
          6  |   .1486964   .0253229     5.87   0.000     .0990644    .1983284
          7  |    .161149    .025615     6.29   0.000     .1109447    .2113534
          8  |   .1732235   .0258725     6.70   0.000     .1225144    .2239326
          9  |   .1849706   .0260438     7.10   0.000     .1339257    .2360155
         10  |   .1964357   .0261291     7.52   0.000     .1452236    .2476478
         11  |   .2076589   .0261547     7.94   0.000     .1563967    .2589211
         12  |   .2186749    .026156     8.36   0.000     .1674101    .2699398
         13  |    .229513   .0261669     8.77   0.000     .1782268    .2807993
         14  |   .2401971   .0262129     9.16   0.000     .1888207    .2915735
         15  |   .2507457   .0263082     9.53   0.000     .1991826    .3023088
         16  |   .2611721   .0264551     9.87   0.000     .2093211     .313023
         17  |    .271484    .026646    10.19   0.000     .2192588    .3237091
         18  |   .2816838   .0268666    10.48   0.000     .2290263    .3343412
         19  |   .2917685   .0270993    10.77   0.000      .238655    .3448821
         20  |   .3017299    .027327    11.04   0.000     .2481699      .35529
         21  |   .3115543   .0275363    11.31   0.000     .2575841    .3655244
         22  |   .3212224   .0277188    11.59   0.000     .2668946    .3755503
         23  |     .33071    .027873    11.86   0.000     .2760799    .3853401
         24  |    .339987   .0280041    12.14   0.000        .2851     .394874
         25  |   .3490184   .0281231    12.41   0.000     .2938981    .4041388
         26  |   .3577635   .0282456    12.67   0.000     .3024031    .4131239
------------------------------------------------------------------------------
(results isvemp4 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]
               +(emptenure^3)*_b[c.emptenure#c.emptenure#c.emptenure]
               +(emptenure^4)*_b[c.emptenure#c.emptenure#c.emptenure#c.emptenur
               > e]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0450504   .0482297     0.93   0.350     -.049478    .1395789
          2  |   .0548654   .0427293     1.28   0.199    -.0288825    .1386133
          3  |   .0628684   .0406404     1.55   0.122    -.0167854    .1425222
          4  |   .0692694   .0407454     1.70   0.089    -.0105901     .149129
          5  |    .074267   .0419362     1.77   0.077    -.0079265    .1564604
          6  |   .0780478   .0434906     1.79   0.073    -.0071923    .1632878
          7  |   .0807872   .0450472     1.79   0.073    -.0075037    .1690781
          8  |    .082649   .0464805     1.78   0.075    -.0084511     .173749
          9  |   .0837852   .0477943     1.75   0.080    -.0098899    .1774602
         10  |   .0843364   .0490524     1.72   0.086    -.0118044    .1804773
         11  |   .0844317   .0503358     1.68   0.093    -.0142246    .1830881
         12  |   .0841886   .0517182     1.63   0.104    -.0171772    .1855544
         13  |   .0837129   .0532526     1.57   0.116    -.0206603    .1880861
         14  |   .0830989   .0549669     1.51   0.131    -.0246343    .1908321
         15  |   .0824294   .0568658     1.45   0.147    -.0290256    .1938843
         16  |   .0817756   .0589366     1.39   0.165    -.0337381    .1972892
         17  |   .0811971   .0611571     1.33   0.184    -.0386686    .2010628
         18  |    .080742   .0635028     1.27   0.204    -.0437213    .2052052
         19  |   .0804467   .0659537     1.22   0.223    -.0488202    .2097137
         20  |   .0803363    .068498     1.17   0.241    -.0539172    .2145899
         21  |   .0804241   .0711344     1.13   0.258    -.0589967    .2198448
         22  |   .0807118   .0738723     1.09   0.275    -.0640753    .2254988
         23  |   .0811897   .0767303     1.06   0.290     -.069199    .2315783
         24  |   .0818364   .0797328     1.03   0.305     -.074437    .2381098
         25  |   .0826192   .0829061     1.00   0.319    -.0798737    .2451121
         26  |   .0834934   .0862737     0.97   0.333    -.0855999    .2525867
------------------------------------------------------------------------------
(file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Ou
> tput\plot_as_emp_4.pdf written in PDF format)
/* empocc 1th order */
(results olsempocc1 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |    .110154   .0261069     4.22   0.000     .0589853    .1613227
          2  |   .1192085   .0259689     4.59   0.000     .0683103    .1701067
          3  |   .1282631   .0258494     4.96   0.000     .0775991     .178927
          4  |   .1373176   .0257486     5.33   0.000     .0868512    .1877839
          5  |   .1463721   .0256668     5.70   0.000     .0960662     .196678
          6  |   .1554266    .025604     6.07   0.000     .1052437    .2056096
          7  |   .1644811   .0255606     6.43   0.000     .1143834    .2145789
          8  |   .1735357   .0255365     6.80   0.000     .1234851    .2235863
          9  |   .1825902   .0255318     7.15   0.000     .1325487    .2326317
         10  |   .1916447   .0255466     7.50   0.000     .1415743    .2417151
         11  |   .2006992   .0255808     7.85   0.000     .1505619    .2508366
         12  |   .2097538   .0256343     8.18   0.000     .1595115     .259996
         13  |   .2188083    .025707     8.51   0.000     .1684236     .269193
         14  |   .2278628   .0257987     8.83   0.000     .1772983    .2784274
         15  |   .2369173   .0259093     9.14   0.000     .1861361    .2876986
         16  |   .2459719   .0260385     9.45   0.000     .1949374    .2970063
         17  |   .2550264    .026186     9.74   0.000     .2037028    .3063499
         18  |   .2640809   .0263515    10.02   0.000      .212433    .3157289
         19  |   .2731354   .0265347    10.29   0.000     .2211284    .3251425
         20  |     .28219   .0267352    10.56   0.000       .22979      .33459
         21  |   .2912445   .0269526    10.81   0.000     .2384183    .3440707
         22  |    .300299   .0271866    11.05   0.000     .2470143    .3535837
         23  |   .3093535   .0274366    11.28   0.000     .2555787    .3631284
         24  |   .3184081   .0277024    11.49   0.000     .2641124    .3727037
         25  |   .3274626   .0279833    11.70   0.000     .2726163    .3823089
         26  |   .3365171    .028279    11.90   0.000     .2810913    .3919429
------------------------------------------------------------------------------
(results isvempocc1 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0567342   .0422411     1.34   0.179    -.0260568    .1395253
          2  |   .0574516   .0412574     1.39   0.164    -.0234114    .1383147
          3  |    .058169   .0405232     1.44   0.151     -.021255    .1375931
          4  |   .0588864   .0400523     1.47   0.141    -.0196146    .1373874
          5  |   .0596038   .0398539     1.50   0.135    -.0185084     .137716
          6  |   .0603212   .0399322     1.51   0.131    -.0179444    .1385868
          7  |   .0610386   .0402854     1.52   0.130    -.0179195    .1399966
          8  |   .0617559   .0409066     1.51   0.131    -.0184196    .1419315
          9  |   .0624733   .0417838     1.50   0.135    -.0194213     .144368
         10  |   .0631907   .0429011     1.47   0.141     -.020894    .1472754
         11  |   .0639081   .0442406     1.44   0.149    -.0228019    .1506181
         12  |   .0646255   .0457826     1.41   0.158    -.0251068    .1543577
         13  |   .0653429   .0475075     1.38   0.169      -.02777    .1584558
         14  |   .0660603    .049396     1.34   0.181    -.0307541    .1628747
         15  |   .0667777   .0514302     1.30   0.194    -.0340238    .1675791
         16  |    .067495   .0535935     1.26   0.208    -.0375464    .1725365
         17  |   .0682124   .0558709     1.22   0.222    -.0412926    .1777175
         18  |   .0689298    .058249     1.18   0.237    -.0452362    .1830959
         19  |   .0696472    .060716     1.15   0.251     -.049354    .1886484
         20  |   .0703646   .0632615     1.11   0.266    -.0536257    .1943548
         21  |    .071082   .0658763     1.08   0.281    -.0580333    .2001972
         22  |   .0717994   .0685526     1.05   0.295    -.0625613    .2061601
         23  |   .0725168   .0712835     1.02   0.309    -.0671962    .2122298
         24  |   .0732341   .0740628     0.99   0.323    -.0719262    .2183945
         25  |   .0739515   .0768853     0.96   0.336    -.0767409     .224644
         26  |   .0746689   .0797465     0.94   0.349    -.0816313    .2309692
------------------------------------------------------------------------------
(file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Ou
> tput\plot_as_empocc_1.pdf written in PDF format)
/* empocc 2th order */
(results olsempocc2 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0857777   .0277247     3.09   0.002     .0314382    .1401172
          2  |     .09863   .0270394     3.65   0.000     .0456338    .1516261
          3  |    .111253   .0265209     4.19   0.000      .059273    .1632329
          4  |   .1236466   .0261551     4.73   0.000     .0723834    .1749097
          5  |   .1358108   .0259258     5.24   0.000     .0849973    .1866244
          6  |   .1477457    .025815     5.72   0.000     .0971494    .1983421
          7  |   .1594513   .0258043     6.18   0.000     .1088758    .2100268
          8  |   .1709275   .0258755     6.61   0.000     .1202125    .2216425
          9  |   .1821744   .0260111     7.00   0.000     .1311935    .2331552
         10  |   .1931919   .0261949     7.38   0.000     .1418507     .244533
         11  |     .20398   .0264124     7.72   0.000     .1522127    .2557473
         12  |   .2145388   .0266505     8.05   0.000     .1623048    .2667728
         13  |   .2248682   .0268983     8.36   0.000     .1721485    .2775879
         14  |   .2349683   .0271466     8.66   0.000     .1817621    .2881746
         15  |   .2448391   .0273878     8.94   0.000       .19116    .2985181
         16  |   .2544805   .0276161     9.21   0.000     .2003538    .3086071
         17  |   .2638925   .0278274     9.48   0.000     .2093518    .3184332
         18  |   .2730752   .0280187     9.75   0.000     .2181594    .3279909
         19  |   .2820285   .0281889    10.00   0.000     .2267794    .3372776
         20  |   .2907525   .0283377    10.26   0.000     .2352116    .3462934
         21  |   .2992471   .0284666    10.51   0.000     .2434535    .3550407
         22  |   .3075124   .0285782    10.76   0.000     .2515001    .3635246
         23  |   .3155483   .0286763    11.00   0.000     .2593438    .3717528
         24  |   .3233548   .0287661    11.24   0.000     .2669744    .3797353
         25  |    .330932   .0288539    11.47   0.000     .2743794    .3874847
         26  |   .3382799   .0289476    11.69   0.000     .2815437    .3950161
------------------------------------------------------------------------------
(results isvempocc2 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0556049   .0444595     1.25   0.211    -.0315342     .142744
          2  |   .0592212   .0424207     1.40   0.163    -.0239219    .1423642
          3  |   .0626193   .0411497     1.52   0.128    -.0180326    .1432712
          4  |   .0657992   .0406088     1.62   0.105    -.0137926    .1453911
          5  |    .068761   .0407259     1.69   0.091    -.0110602    .1485822
          6  |   .0715047   .0414034     1.73   0.084    -.0096444    .1526538
          7  |   .0740302   .0425328     1.74   0.082    -.0093325    .1573929
          8  |   .0763375   .0440077     1.73   0.083    -.0099159     .162591
          9  |   .0784267   .0457327     1.71   0.086    -.0112077    .1680612
         10  |   .0802978    .047628     1.69   0.092    -.0130514     .173647
         11  |   .0819507   .0496301     1.65   0.099    -.0153225    .1792239
         12  |   .0833854   .0516905     1.61   0.107    -.0179261    .1846969
         13  |    .084602   .0537739     1.57   0.116    -.0207928    .1899969
         14  |   .0856005   .0558559     1.53   0.125     -.023875     .195076
         15  |   .0863808   .0579213     1.49   0.136    -.0271429    .1999044
         16  |   .0869429   .0599623     1.45   0.147    -.0305811    .2044669
         17  |   .0872869   .0619775     1.41   0.159    -.0341868    .2087606
         18  |   .0874127   .0639705     1.37   0.172    -.0379671    .2127926
         19  |   .0873204   .0659494     1.32   0.185    -.0419381    .2165789
         20  |   .0870099   .0679263     1.28   0.200    -.0461231     .220143
         21  |   .0864813   .0699162     1.24   0.216    -.0505519    .2235145
         22  |   .0857345   .0719373     1.19   0.233    -.0552599     .226729
         23  |   .0847696   .0740099     1.15   0.252    -.0602872    .2298265
         24  |   .0835866   .0761565     1.10   0.272    -.0656775    .2328506
         25  |   .0821853    .078401     1.05   0.295    -.0714777    .2358484
         26  |   .0805659   .0807681     1.00   0.319    -.0777366    .2388685
------------------------------------------------------------------------------
(file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Ou
> tput\plot_as_empocc_2.pdf written in PDF format)
/* empocc 3th order */
(results olsempocc3 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]
               +(emptenure^3)*_b[c.emptenure#c.emptenure#c.emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0985683   .0305997     3.22   0.001     .0385939    .1585426
          2  |   .1077096   .0284766     3.78   0.000     .0518965    .1635226
          3  |   .1171742    .027085     4.33   0.000     .0640886    .1702599
          4  |   .1269318   .0262965     4.83   0.000     .0753916    .1784719
          5  |   .1369517   .0259649     5.27   0.000     .0860614    .1878421
          6  |   .1472037   .0259482     5.67   0.000     .0963462    .1980612
          7  |   .1576571   .0261238     6.03   0.000     .1064554    .2088589
          8  |   .1682816   .0263968     6.38   0.000     .1165449    .2200183
          9  |   .1790467   .0266995     6.71   0.000     .1267167    .2313767
         10  |   .1899219   .0269884     7.04   0.000     .1370255    .2428182
         11  |   .2008767   .0272393     7.37   0.000     .1474887    .2542647
         12  |   .2118807   .0274422     7.72   0.000     .1580949    .2656665
         13  |   .2229034   .0275981     8.08   0.000     .1688121    .2769947
         14  |   .2339144   .0277152     8.44   0.000     .1795937    .2882351
         15  |   .2448831   .0278065     8.81   0.000     .1903834    .2993829
         16  |   .2557792   .0278879     9.17   0.000       .20112    .3104385
         17  |   .2665722   .0279757     9.53   0.000     .2117409    .3214035
         18  |   .2772315   .0280855     9.87   0.000     .2221849    .3322782
         19  |   .2877268   .0282308    10.19   0.000     .2323954    .3430582
         20  |   .2980275   .0284215    10.49   0.000     .2423225    .3537326
         21  |   .3081033   .0286634    10.75   0.000     .2519241    .3642825
         22  |   .3179236   .0289579    10.98   0.000     .2611671    .3746801
         23  |   .3274579   .0293019    11.18   0.000     .2700273    .3848886
         24  |   .3366759    .029688    11.34   0.000     .2784884    .3948634
         25  |    .345547   .0301057    11.48   0.000     .2865408    .4045532
         26  |   .3540408   .0305421    11.59   0.000     .2941795    .4139022
------------------------------------------------------------------------------
(results isvempocc3 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]
               +(emptenure^3)*_b[c.emptenure#c.emptenure#c.emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |    .052248   .0461099     1.13   0.257    -.0381257    .1426217
          2  |   .0590014   .0427583     1.38   0.168    -.0248033    .1428061
          3  |   .0651614   .0412589     1.58   0.114    -.0157045    .1460273
          4  |   .0707404   .0412056     1.72   0.086     -.010021    .1515018
          5  |   .0757508   .0421349     1.80   0.072     -.006832    .1583336
          6  |   .0802051   .0436362     1.84   0.066    -.0053202    .1657304
          7  |   .0841156   .0454056     1.85   0.064    -.0048777    .1731089
          8  |   .0874948    .047247     1.85   0.064    -.0051076    .1800971
          9  |    .090355   .0490505     1.84   0.065    -.0057822    .1864922
         10  |   .0927088   .0507683     1.83   0.068    -.0067953    .1922128
         11  |   .0945684   .0523948     1.80   0.071    -.0081235    .1972603
         12  |   .0959464   .0539517     1.78   0.075     -.009797    .2016897
         13  |    .096855   .0554776     1.75   0.081     -.011879     .205589
         14  |   .0973069   .0570196     1.71   0.088    -.0144496    .2090633
         15  |   .0973142   .0586274     1.66   0.097    -.0175933    .2122218
         16  |   .0968896   .0603474     1.61   0.108    -.0213892    .2151684
         17  |   .0960453   .0622195     1.54   0.123    -.0259026    .2179933
         18  |   .0947939   .0642737     1.47   0.140    -.0311802    .2207679
         19  |   .0931476   .0665285     1.40   0.161     -.037246    .2235412
         20  |    .091119    .068991     1.32   0.187    -.0441008    .2263388
         21  |   .0887204   .0716565     1.24   0.216    -.0517237    .2291645
         22  |   .0859642   .0745109     1.15   0.249    -.0600744    .2320028
         23  |   .0828629   .0775323     1.07   0.285    -.0690976    .2348235
         24  |   .0794289   .0806936     0.98   0.325    -.0787276    .2375854
         25  |   .0756746   .0839646     0.90   0.367    -.0888929    .2402421
         26  |   .0716124   .0873145     0.82   0.412    -.0995208    .2427456
------------------------------------------------------------------------------
(file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Ou
> tput\plot_as_empocc_3.pdf written in PDF format)
/* empocc 4th order */
(results olsempocc4 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]
               +(emptenure^3)*_b[c.emptenure#c.emptenure#c.emptenure]
               +(emptenure^4)*_b[c.emptenure#c.emptenure#c.emptenure#c.emptenur
               > e]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0928924   .0342239     2.71   0.007     .0258148    .1599699
          2  |   .1011744   .0297617     3.40   0.001     .0428425    .1595063
          3  |   .1099641     .02735     4.02   0.000     .0563591    .1635692
          4  |   .1192327   .0264184     4.51   0.000     .0674537    .1710118
          5  |   .1289498   .0263541     4.89   0.000     .0772967    .1806029
          6  |   .1390833   .0266729     5.21   0.000     .0868054    .1913613
          7  |   .1495997   .0270728     5.53   0.000     .0965379    .2026615
          8  |   .1604637   .0274023     5.86   0.000     .1067562    .2141713
          9  |   .1716385   .0276089     6.22   0.000      .117526    .2257511
         10  |   .1830857    .027698     6.61   0.000     .1287987    .2373727
         11  |   .1947651   .0277041     7.03   0.000     .1404661    .2490642
         12  |   .2066352   .0276734     7.47   0.000     .1523963    .2608741
         13  |   .2186526   .0276512     7.91   0.000     .1644574    .2728479
         14  |   .2307726   .0276742     8.34   0.000     .1765321    .2850131
         15  |   .2429485   .0277669     8.75   0.000     .1885264    .2973706
         16  |   .2551323   .0279392     9.13   0.000     .2003724    .3098922
         17  |   .2672743   .0281886     9.48   0.000     .2120257     .322523
         18  |   .2793232   .0285022     9.80   0.000       .22346    .3351864
         19  |   .2912261   .0288612    10.09   0.000     .2346592    .3477929
         20  |   .3029283   .0292448    10.36   0.000     .2456095    .3602471
         21  |   .3143738   .0296339    10.61   0.000     .2562924    .3724553
         22  |   .3255048   .0300134    10.85   0.000     .2666797    .3843299
         23  |    .336262   .0303737    11.07   0.000     .2767307    .3957933
         24  |   .3465843   .0307117    11.29   0.000     .2863905    .4067781
         25  |   .3564093   .0310302    11.49   0.000     .2955913    .4172273
         26  |   .3656726   .0313365    11.67   0.000     .3042543     .427091
------------------------------------------------------------------------------
(results isvempocc4 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      8,463
Model VCE    : Robust

Expression   : _b[oj]+emptenure*_b[emptenure]
               +(emptenure^2)*_b[c.emptenure#c.emptenure]
               +(emptenure^3)*_b[c.emptenure#c.emptenure#c.emptenure]
               +(emptenure^4)*_b[c.emptenure#c.emptenure#c.emptenure#c.emptenur
               > e]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |   .0471144   .0491828     0.96   0.338    -.0492821    .1435108
          2  |   .0562449   .0433849     1.30   0.195    -.0287879    .1412777
          3  |   .0642699   .0413967     1.55   0.121    -.0168662    .1454061
          4  |   .0712644   .0417891     1.71   0.088    -.0106407    .1531695
          5  |   .0772997   .0432907     1.79   0.074    -.0075484    .1621479
          6  |    .082444    .045109     1.83   0.068     -.005968     .170856
          7  |   .0867618   .0468702     1.85   0.064    -.0051021    .1786257
          8  |   .0903145   .0484583     1.86   0.062    -.0046619     .185291
          9  |   .0931599   .0498897     1.87   0.062     -.004622    .1909419
         10  |   .0953525   .0512365     1.86   0.063    -.0050692    .1957741
         11  |   .0969433    .052582     1.84   0.065    -.0061155    .2000021
         12  |     .09798   .0539966     1.81   0.070    -.0078514    .2038115
         13  |   .0985069   .0555272     1.77   0.076    -.0103245    .2073383
         14  |   .0985649   .0571956     1.72   0.085    -.0135364    .2106663
         15  |   .0981914   .0590034     1.66   0.096    -.0174532     .213836
         16  |   .0974206   .0609405     1.60   0.110    -.0220205    .2168617
         17  |    .096283   .0629939     1.53   0.126    -.0271828    .2197487
         18  |    .094806   .0651564     1.46   0.146    -.0328983    .2225103
         19  |   .0930135   .0674325     1.38   0.168    -.0391518    .2251789
         20  |    .090926   .0698416     1.30   0.193    -.0459611     .227813
         21  |   .0885605   .0724185     1.22   0.221    -.0533772    .2304981
         22  |   .0859307   .0752111     1.14   0.253    -.0614803    .2333418
         23  |    .083047   .0782752     1.06   0.289    -.0703696    .2364636
         24  |   .0799162   .0816676     0.98   0.328    -.0801494    .2399818
         25  |   .0765419   .0854378     0.90   0.370    -.0909132     .243997
         26  |   .0729241   .0896203     0.81   0.416    -.1027284    .2485765
------------------------------------------------------------------------------
(file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Ou
> tput\plot_as_empocc_4.pdf written in PDF format)
. 
. ** output tex all results
. {
. qui{
. }
. }

. 
. 
end of do-file

