---------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submit
> tion\Log\Estimation.log
  log type:  text
 opened on:  16 Feb 2019, 21:06:18

. 
. * Summary statistics
. do "$Code\ReadData.do"

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd $Inputfd

. 
. qui {

. 
end of do-file

. qui     reg ///
>                                 `commonVar' ///
>                                 `emp1' ///
>                                 , vce(r)

.                 est sto forsum

. keep if _est_forsum==1
(1,939 observations deleted)

. tabulate dsize, generate(sized)

      dsize |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,841       37.15       37.15
          1 |      1,771       23.16       60.30
          2 |      3,036       39.70      100.00
------------+-----------------------------------
      Total |      7,648      100.00

. tabulate schooling, generate(edud)

  schooling |      Freq.     Percent        Cum.
------------+-----------------------------------
          9 |        280        3.66        3.66
         12 |      3,363       43.97       47.63
         14 |        854       11.17       58.80
         16 |      3,151       41.20      100.00
------------+-----------------------------------
      Total |      7,648      100.00

. estpost sum age edud* dmarital dunion sized* dregular ///
>                                         realwage workexp emptenure

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)     e(min) 
-------------+------------------------------------------------------------------
         age |      7648       7648   45.72764   106.7153   10.33031         20 
       edud1 |      7648       7648   .0366109   .0352751   .1878168          0 
       edud2 |      7648       7648   .4397228   .2463989   .4963858          0 
       edud3 |      7648       7648   .1116632   .0992075   .3149722          0 
       edud4 |      7648       7648   .4120031   .2422882   .4922278          0 
    dmarital |      7648       7648   .8372123   .1363057    .369196          0 
      dunion |      7648       7648   .2922333     .20686   .4548187          0 
      sized1 |      7648       7648   .3714697   .2335105   .4832292          0 
      sized2 |      7648       7648   .2315638   .1779653   .4218593          0 
      sized3 |      7648       7648   .3969665   .2394154   .4893009          0 
    dregular |      7648       7648   .8874215   .0999176   .3160975          0 
    realwage |      7648       7648    7.60362   .3066968   .5538021   5.526562 
     workexp |      7648       7648   25.75392   116.3344   10.78584          0 
   emptenure |      7648       7648       14.5   127.8104   11.30533          0 

             |    e(max)     e(sum) 
-------------+----------------------
         age |        64     349725 
       edud1 |         1        280 
       edud2 |         1       3363 
       edud3 |         1        854 
       edud4 |         1       3151 
    dmarital |         1       6403 
      dunion |         1       2235 
      sized1 |         1       2841 
      sized2 |         1       1771 
      sized3 |         1       3036 
    dregular |         1       6787 
    realwage |  10.65899   58152.49 
     workexp |        50     196966 
   emptenure |        47     110896 

. global FileTex ///
>                 "sum"

. global LabelVar ///
>                 age "Age" ///
>                 edud1 "\quad Junior High School" ///
>                 edud2 "\quad High School" ///
>                 edud3 "\quad 2-year College or Vocational" ///
>                 edud4 "\quad College or More" ///
>                 dmarital "Married" ///
>                 dunion "Union Member" ///
>                 sized1 "\quad Size $<100$" ///
>                 sized2 "\quad $100\leq$ Size $<500$" ///
>                 sized3 "\quad Size $\geq 500$" ///
>                 dregular "Regular Employee" ///
>                 realwage "Log of Real Hourly Wage" ///
>                 workexp "Total Experience" ///
>                 emptenure "Employer Tenure" ///
> global TitleTab ///
>                         "Summary Statistics"

. global LabelTab ///
>                 summary

. global Space ///
>                 .3em

. do "$Code\TexTab_sum.do"

. /* Title: TexTab_sum */
. /// Date: Feb 16th, 2019
> /// Written by Ayaka Nakamura
> /// 
> /// Standard format of summary statistics
> 
. * set variables
. local fileTex $FileTex

. local labelVar $LabelVar

. local titleTab $TitleTab

. local labelTab $LabelTab

. local space $Space

. 
. * estab
. esttab using "$Output/`fileTex'.tex", ///
>         cells( ///
>                         ( ///
>                         mean( label(Mean) fmt(%5.4f) ) ///
>                         sd( label(St.d) fmt(%5.4f) ) ///
>                         min(label(Min) fmt(%9.0f) ) ///
>                         max(label(Max) fmt(%9.0f) ) ///
>                         ) ///
>                         ) ///
>         coeflabel( `labelVar' ) ///
>         noobs nomtitles nonumber nolz ///
>         gaps ///
>         style(tex) ///
>         substitute(_ \_ 1em `space') ///
>         title(`titleTab' \label{`labelTab'}) ///
>         prehead( ///
>                                         "\begin{table}[htbp]\centering" ///
>                                         "\begin{threeparttable}" ///
>                                         "\caption{@title}" ///
>                                         "\begin{tabular}{l*{4}{c}}" ///
>                                         "\hline\hline\\" ///
>                                         ) ///
>         posthead( "\hline\\" ) ///
>         prefoot( "\hline\\" ) ///
>         postfoot( "\end{tabular}" ///
>                                         "\begin{tablenotes}" ///
>                                         "\small" ///
>                                         "\im Notes: ." ///
>                                         "\end{tablenotes}" ///
>                                         "\end{threeparttable}" ///
>                                         "\end{table}" ///
>                                         ) ///
> replace
(output written to C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\
> Submittion\Output/sum.tex)

. 
. 
end of do-file

. 
end of do-file

. exit, clear
