---------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submit
> tion\Log\Estimation.log
  log type:  text
 opened on:   6 Dec 2018, 20:01:00

. 
. * Summary statistics
. do "$Code\ReadData.do"

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Su
> bmittion\Input"

. 
. qui {

. 
end of do-file

. qui     reg ///
>                                 `commonVar' ///
>                                 `emp1' ///
>                                 , vce(r)

.                 est sto forsum

. keep if _est_forsum==1
(2,907 observations deleted)

. tabulate dsize, generate(sized)

      dsize |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,328       38.69       38.69
          1 |      1,948       22.65       61.34
          2 |      3,325       38.66      100.00
------------+-----------------------------------
      Total |      8,601      100.00

. tabulate schooling, generate(edud)

  schooling |      Freq.     Percent        Cum.
------------+-----------------------------------
          9 |        308        3.58        3.58
         12 |      3,800       44.18       47.76
         14 |        972       11.30       59.06
         16 |      3,521       40.94      100.00
------------+-----------------------------------
      Total |      8,601      100.00

. estpost sum age edud* dmarital dunion sized* dregular ///
>                                         realwage workexp emptenure

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)     e(min) 
-------------+------------------------------------------------------------------
         age |      8601       8601    45.3588    105.531   10.27283         20 
       edud1 |      8601       8601   .0358098   .0345315   .1858264          0 
       edud2 |      8601       8601   .4418091   .2466425   .4966311          0 
       edud3 |      8601       8601   .1130101   .1002505   .3166236          0 
       edud4 |      8601       8601    .409371   .2418145   .4917464          0 
    dmarital |      8601       8601   .8386234   .1353499   .3678993          0 
      dunion |      8601       8601   .2875247   .2048781   .4526346          0 
      sized1 |      8601       8601   .3869318   .2372432   .4870761          0 
      sized2 |      8601       8601   .2264853   .1752101    .418581          0 
      sized3 |      8601       8601    .386583   .2371641    .486995          0 
    dregular |      8601       8601   .8961749   .0930563   .3050513          0 
    realwage |      8601       8601   7.551957   .3173452    .563334   5.526562 
     workexp |      8601       8601   25.39402   114.9897   10.72333          0 
   emptenure |      8601       8601   14.21056   124.0376   11.13722          0 

             |    e(max)     e(sum) 
-------------+----------------------
         age |        64     390131 
       edud1 |         1        308 
       edud2 |         1       3800 
       edud3 |         1        972 
       edud4 |         1       3521 
    dmarital |         1       7213 
      dunion |         1       2473 
      sized1 |         1       3328 
      sized2 |         1       1948 
      sized3 |         1       3325 
    dregular |         1       7708 
    realwage |  10.65899   64954.39 
     workexp |        50     218414 
   emptenure |        47     122225 

. esttab using "$Output\sum.tex", ///
>         cell( ///
>                         ( ///
>                         mean(label(Mean) fmt(%5.4f)) ///
>                         sd(label(St.d) fmt(%5.4f)) ///
>                         min(label(Min) fmt(%2.0f)) ///
>                         max(label(Max) fmt(%2.0f)) ///
>                         ) ///
>                         ) ///
>         coeflabel( ///
>                                         age "Age" ///
>                                         edud1 "\quad Junior High School" ///
>                                         edud2 "\quad High School" ///
>                                         edud3 "\quad 2-year College or Vocation
> al" ///
>                                         edud4 "\quad College or More" ///
>                                         dmarital "Married" ///
>                                         dunion "Union Member" ///
>                                         sized1 "\quad Size $<100$" ///
>                                         sized2 "\quad $100\leq$ Size $<500$" //
> /
>                                         sized3 "\quad Size $\geq 500$" ///
>                                         dregular "Regular Employee" ///
>                                         realwage "Log of Real Hourly Wage" ///
>                                         workexp "Total Experience" ///
>                                         emptenure "Employer Tenure" ///
>                                         ) ///
>         replace
(output written to C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\
> Submittion\Output\sum.tex)

. 
end of do-file

. do "C:\Users\AYAKAN~1\AppData\Local\Temp\STD2fa0_000000.tmp"

. esttab using "$Output\sum.tex", ///
>         cell( ///
>                         ( ///
>                         mean(label(Mean) fmt(%5.4f)) ///
>                         sd(label(St.d) fmt(%5.4f)) ///
>                         min(label(Min)) ///
>                         max(label(Max)) ///
>                         ) ///
>                         ) ///
>         coeflabel( ///
>                                         age "Age" ///
>                                         edud1 "\quad Junior High School" ///
>                                         edud2 "\quad High School" ///
>                                         edud3 "\quad 2-year College or Vocation
> al" ///
>                                         edud4 "\quad College or More" ///
>                                         dmarital "Married" ///
>                                         dunion "Union Member" ///
>                                         sized1 "\quad Size $<100$" ///
>                                         sized2 "\quad $100\leq$ Size $<500$" //
> /
>                                         sized3 "\quad Size $\geq 500$" ///
>                                         dregular "Regular Employee" ///
>                                         realwage "Log of Real Hourly Wage" ///
>                                         workexp "Total Experience" ///
>                                         emptenure "Employer Tenure" ///
>                                         ) ///
>         replace
(output written to C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\
> Submittion\Output\sum.tex)

. 
end of do-file

