---------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submit
> tion\Log\EstTopel.log
  log type:  text
 opened on:   7 Jan 2019, 17:00:35

. ** changing time treand
. qui{

. 
. local dmList Sum Sum2 Dm Dm2 Det

. foreach eq_i of local dmList{
  2.         global DmYear `dmYear`eq_i''
  3.         global FstReg `fstReg`eq_i''
  4.         global SndReg `sndReg`eq_i''
  5.         
.         dis "Year Dummy Type: `eq_i'"
  6.         do "$Code\ReadData.do"
  7.         
.         if "`eq_i'"=="Det"{
  8.                 reg realwage i.year
  9.                 predict hatwage, re
 10.                 replace realwage=hatwage
 11.         }
 12.         
.         do "$Code\EstTopel.do"
 13. }       
Year Dummy Type: Sum

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd $Inputfd

. 
. qui {

. 
end of do-file

. qui{

. 
. 
. * estimation
. forvalues i=1/4 {
  2.         **** 1st step
.         qui $FstReg ///
>                                 `contrl`i'' ///
>                                 if fst==1
  3.         est sto fst`i'
  4.         gen emptenB`i'=`LHSterm`i'' ///
>                                                                 $DmYear
  5.         gen intwemp`i'=realwage-emptenB`i'
  6.         
.         **** 2nd step
.         qui reg intwemp`i' ///
>                                 $SndReg
  7.         est sto snd`i'
  8. }
(1,076 missing values generated)
(2,498 missing values generated)
(1,157 missing values generated)
(2,567 missing values generated)
(1,157 missing values generated)
(2,567 missing values generated)
(1,157 missing values generated)
(2,567 missing values generated)

. 
. * calc. return
. ** linear
. capture program drop coef

. program coef, rclass
  1.         suest fst1 snd1
  2.         lincom [fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst1, snd1

                                                Number of obs     =      8,797

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst1_mean    |
       y2004 |          0  (omitted)
       y2005 |          0  (omitted)
       y2006 |  -.1035093   .0277972    -3.72   0.000    -.1579908   -.0490279
       y2007 |   .0294138   .0304687     0.97   0.334    -.0303038    .0891313
       y2008 |  -.0130532      .0273    -0.48   0.633    -.0665601    .0404538
       y2009 |   .0221613   .0248851     0.89   0.373    -.0266125    .0709351
       y2010 |  -.0536269   .0230298    -2.33   0.020    -.0987644   -.0084894
       y2011 |   .0443036   .0213088     2.08   0.038      .002539    .0860681
       y2012 |   .0053776   .0197009     0.27   0.785    -.0332354    .0439907
       y2013 |  -.0329762   .0191279    -1.72   0.085    -.0704662    .0045139
       y2014 |   .0419026   .0202897     2.07   0.039     .0021355    .0816697
       _cons |   .0488278   .0164667     2.97   0.003     .0165537    .0811019
-------------+----------------------------------------------------------------
fst1_lnvar   |
       _cons |  -1.908867    .048744   -39.16   0.000    -2.004404   -1.813331
-------------+----------------------------------------------------------------
snd1_mean    |
  1.dmarital |  -.0093418   .0168482    -0.55   0.579    -.0423637      .02368
             |
   schooling |
         12  |   .3460067   .0355159     9.74   0.000     .2763967    .4156166
         14  |   .4670183   .0393211    11.88   0.000     .3899503    .5440864
         16  |   .6533515   .0370597    17.63   0.000     .5807158    .7259873
             |
  1.dregular |   .3649444   .0238283    15.32   0.000     .3182418     .411647
    1.dunion |   .0238848   .0149517     1.60   0.110    -.0054199    .0531896
             |
         occ |
          2  |   .0009348   .5075171     0.00   0.999    -.9937805      .99565
          3  |   .0651926   .5039371     0.13   0.897    -.9225059    1.052891
          4  |  -.0684227   .5063703    -0.14   0.893     -1.06089    .9240448
          5  |   .1030222   .5058386     0.20   0.839    -.8884032    1.094448
          6  |   .0510868   .5058173     0.10   0.920     -.940297    1.042471
          7  |   .0520538   .5064271     0.10   0.918    -.9405251    1.044633
          8  |   .1034679   .5061072     0.20   0.838     -.888484     1.09542
          9  |   .2220102   .5064522     0.44   0.661    -.7706178    1.214638
         10  |   .2189197   .5059888     0.43   0.665    -.7728001     1.21064
         11  |  -.1194448   .5068343    -0.24   0.814    -1.112822    .8739322
         12  |   .0680468   .5106383     0.13   0.894    -.9327859    1.068879
             |
         ind |
          2  |  -.1476766   .3171514    -0.47   0.641     -.769282    .4739287
          3  |   .5726669   .5346323     1.07   0.284    -.4751931    1.620527
          4  |   .2121566   .5091706     0.42   0.677    -.7857994    1.210113
          5  |   .2436617   .5092088     0.48   0.632    -.7543693    1.241693
          6  |   .2009509   .5077524     0.40   0.692    -.7942256    1.196127
          7  |   .3439978   .5112561     0.67   0.501    -.6580458    1.346041
          8  |   .3413801   .5095722     0.67   0.503    -.6573631    1.340123
          9  |    .380705   .5111508     0.74   0.456    -.6211322    1.382542
         10  |   .1980374   .5095142     0.39   0.698    -.8005921    1.196667
         11  |   .3119355   .5097727     0.61   0.541    -.6872006    1.311072
         12  |   .3351702    .510076     0.66   0.511    -.6645603    1.334901
         13  |   .3404605   .5099307     0.67   0.504    -.6589854    1.339906
         14  |   .2657281   .5094036     0.52   0.602    -.7326847    1.264141
         15  |   .3001751   .5100528     0.59   0.556    -.6995101     1.29986
         16  |   .2631752    .509018     0.52   0.605    -.7344817    1.260832
         17  |   .0986683   .5231855     0.19   0.850    -.9267565    1.124093
         18  |   .2602499   .5144573     0.51   0.613     -.748068    1.268568
             |
       dsize |
          1  |   .0437459   .0163216     2.68   0.007     .0117562    .0757357
          2  |   .1333608   .0164218     8.12   0.000     .1011747    .1655468
             |
  initialemp |   .0219794   .0006116    35.94   0.000     .0207807    .0231781
       _cons |   5.477057   .0728614    75.17   0.000     5.334252    5.619863
-------------+----------------------------------------------------------------
snd1_lnvar   |
       _cons |  -1.195302    .023438   -51.00   0.000     -1.24124   -1.149364
------------------------------------------------------------------------------

 ( 1)  [fst1_mean]_cons - [snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0268484   .0164912     1.63   0.104    -.0054738    .0591705
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst1 snd1
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp])*`X'
  4.         }
  5. end

. emprtn

 ( 1)  2*[fst1_mean]_cons - 2*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0536967   .0329824     1.63   0.104    -.0109475     .118341
------------------------------------------------------------------------------

 ( 1)  5*[fst1_mean]_cons - 5*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1342419    .082456     1.63   0.104    -.0273689    .2958526
------------------------------------------------------------------------------

 ( 1)  10*[fst1_mean]_cons - 10*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2684837   .1649119     1.63   0.104    -.0547377    .5917051
------------------------------------------------------------------------------

 ( 1)  15*[fst1_mean]_cons - 15*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4027256   .2473679     1.63   0.104    -.0821066    .8875577
------------------------------------------------------------------------------

 ( 1)  20*[fst1_mean]_cons - 20*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5369674   .3298238     1.63   0.104    -.1094755     1.18341
------------------------------------------------------------------------------

 ( 1)  25*[fst1_mean]_cons - 25*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6712093   .4122798     1.63   0.104    -.1368443    1.479263
------------------------------------------------------------------------------

. 
. ** qadratic
. capture program drop coef

. program coef, rclass
  1.         suest fst2 snd2
  2.         lincom [fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst2, snd2

                                                Number of obs     =      8,794

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst2_mean    |
       y2004 |          0  (omitted)
       y2005 |          0  (omitted)
       y2006 |  -.1033253   .0277795    -3.72   0.000    -.1577721   -.0488785
       y2007 |   .0295702   .0304844     0.97   0.332     -.030178    .0893185
       y2008 |   -.013036   .0273027    -0.48   0.633    -.0665484    .0404764
       y2009 |   .0223225   .0248475     0.90   0.369    -.0263778    .0710227
       y2010 |  -.0539938   .0230224    -2.35   0.019    -.0991168   -.0088708
       y2011 |   .0444162   .0213009     2.09   0.037     .0026672    .0861653
       y2012 |   .0057119   .0197233     0.29   0.772    -.0329451    .0443689
       y2013 |  -.0327749   .0191585    -1.71   0.087     -.070325    .0047751
       y2014 |    .041316   .0203068     2.03   0.042     .0015154    .0811165
  emptendif2 |   -.000031   .0002438    -0.13   0.899    -.0005089    .0004469
  empexpdif2 |  -.0001026    .000254    -0.40   0.686    -.0006005    .0003953
       _cons |   .0546642   .0207019     2.64   0.008     .0140892    .0952392
-------------+----------------------------------------------------------------
fst2_lnvar   |
       _cons |  -1.908132   .0487704   -39.12   0.000     -2.00372   -1.812544
-------------+----------------------------------------------------------------
snd2_mean    |
  1.dmarital |  -.0125575   .0168447    -0.75   0.456    -.0455725    .0204576
             |
   schooling |
         12  |   .3318504   .0349521     9.49   0.000     .2633455    .4003554
         14  |   .4519232    .038795    11.65   0.000     .3758863    .5279601
         16  |   .6366377   .0365167    17.43   0.000     .5650663    .7082091
             |
  1.dregular |   .3527593   .0235296    14.99   0.000     .3066422    .3988764
    1.dunion |   .0259768   .0148888     1.74   0.081    -.0032046    .0551582
             |
         occ |
          2  |  -.0044949   .5012503    -0.01   0.993    -.9869275    .9779377
          3  |   .0476529   .4963145     0.10   0.924    -.9251057    1.020412
          4  |   -.083039   .4987158    -0.17   0.868    -1.060504     .894426
          5  |   .0880328   .4981864     0.18   0.860    -.8883946     1.06446
          6  |   .0346017   .4981631     0.07   0.945      -.94178    1.010983
          7  |   .0343331   .4987628     0.07   0.945     -.943224     1.01189
          8  |   .0841506   .4984329     0.17   0.866      -.89276    1.061061
          9  |   .2038329   .4988048     0.41   0.683    -.7738065    1.181472
         10  |     .20183   .4983325     0.41   0.685    -.7748838    1.178544
         11  |  -.1336678   .4991844    -0.27   0.789    -1.112051    .8447157
         12  |   .0493864   .5030762     0.10   0.922    -.9366249    1.035398
             |
         ind |
          2  |  -.1414549   .3121864    -0.45   0.650     -.753329    .4704193
          3  |    .572306   .5269338     1.09   0.277    -.4604652    1.605077
          4  |   .2233173   .5015567     0.45   0.656    -.7597158     1.20635
          5  |   .2538783   .5015984     0.51   0.613    -.7292365    1.236993
          6  |   .2106947   .5001692     0.42   0.674     -.769619    1.191008
          7  |    .351177   .5036965     0.70   0.486    -.6360499    1.338404
          8  |   .3502753   .5019906     0.70   0.485    -.6336083    1.334159
          9  |   .3897763   .5035801     0.77   0.439    -.5972227    1.376775
         10  |   .2060284    .501908     0.41   0.681    -.7776932     1.18975
         11  |   .3215298   .5021839     0.64   0.522    -.6627326    1.305792
         12  |   .3476582   .5024661     0.69   0.489    -.6371573    1.332474
         13  |   .3551545   .5023313     0.71   0.480    -.6293968    1.339706
         14  |   .2743761   .5018084     0.55   0.585    -.7091502    1.257902
         15  |    .311816    .502471     0.62   0.535    -.6730091    1.296641
         16  |   .2731305   .5014173     0.54   0.586    -.7096293     1.25589
         17  |   .1151686   .5156066     0.22   0.823    -.8954018    1.125739
         18  |   .2724654   .5068411     0.54   0.591     -.720925    1.265856
             |
       dsize |
          1  |   .0451086   .0162502     2.78   0.006     .0132587    .0769585
          2  |   .1350325   .0163477     8.26   0.000     .1029915    .1670734
             |
  initialemp |   .0270249   .0006065    44.56   0.000     .0258363    .0282135
       _cons |   5.459616   .0725199    75.28   0.000      5.31748    5.601752
-------------+----------------------------------------------------------------
snd2_lnvar   |
       _cons |  -1.205857   .0235764   -51.15   0.000    -1.252066   -1.159648
------------------------------------------------------------------------------

 ( 1)  [fst2_mean]_cons - [snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0276393   .0207154     1.33   0.182    -.0129621    .0682407
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst2 snd2
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp])*`X' ///
>                                 +[fst2_mean]_b[emptendif2]*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst2_mean]emptendif2 + 2*[fst2_mean]_cons - 2*[snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0551546   .0412976     1.34   0.182    -.0257873    .1360965
------------------------------------------------------------------------------

 ( 1)  25*[fst2_mean]emptendif2 + 5*[fst2_mean]_cons - 5*[snd2_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1374214   .1028513     1.34   0.182    -.0641636    .3390063
------------------------------------------------------------------------------

 ( 1)  100*[fst2_mean]emptendif2 + 10*[fst2_mean]_cons - 10*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2732924   .2049677     1.33   0.182     -.128437    .6750218
------------------------------------------------------------------------------

 ( 1)  225*[fst2_mean]emptendif2 + 15*[fst2_mean]_cons - 15*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4076131   .3074349     1.33   0.185    -.1949482    1.010174
------------------------------------------------------------------------------

 ( 1)  400*[fst2_mean]emptendif2 + 20*[fst2_mean]_cons - 20*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5403834   .4113388     1.31   0.189    -.2658257    1.346593
------------------------------------------------------------------------------

 ( 1)  625*[fst2_mean]emptendif2 + 25*[fst2_mean]_cons - 25*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6716035   .5177466     1.30   0.195    -.3431613    1.686368
------------------------------------------------------------------------------

. 
. ** cubic
. capture program drop coef

. program coef, rclass
  1.         suest fst3 snd3
  2.         lincom [fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst3, snd3

                                                Number of obs     =      8,794

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst3_mean    |
       y2004 |          0  (omitted)
       y2005 |          0  (omitted)
       y2006 |  -.1033307   .0278025    -3.72   0.000    -.1578226   -.0488388
       y2007 |   .0294003   .0305158     0.96   0.335    -.0304095    .0892101
       y2008 |  -.0125391   .0273334    -0.46   0.646    -.0661116    .0410334
       y2009 |   .0220115   .0248596     0.89   0.376    -.0267125    .0707354
       y2010 |  -.0541937   .0230601    -2.35   0.019    -.0993907   -.0089968
       y2011 |   .0442051   .0213065     2.07   0.038     .0024451     .085965
       y2012 |   .0056269    .019712     0.29   0.775    -.0330079    .0442617
       y2013 |  -.0325395   .0191291    -1.70   0.089    -.0700318    .0049527
       y2014 |   .0413006   .0202769     2.04   0.042     .0015586    .0810426
  emptendif2 |   .0013557   .0009289     1.46   0.144     -.000465    .0031764
  empexpdif2 |  -.0011235   .0013823    -0.81   0.416    -.0038328    .0015859
  emptendif3 |  -.0000256   .0000163    -1.57   0.116    -.0000576    6.31e-06
  empexpdif3 |    .000015   .0000171     0.88   0.380    -.0000186    .0000486
       _cons |   .0575338   .0344525     1.67   0.095    -.0099918    .1250594
-------------+----------------------------------------------------------------
fst3_lnvar   |
       _cons |  -1.908234    .048702   -39.18   0.000    -2.003688    -1.81278
-------------+----------------------------------------------------------------
snd3_mean    |
  1.dmarital |  -.0225036   .0171573    -1.31   0.190    -.0561313    .0111241
             |
   schooling |
         12  |   .3636828   .0361371    10.06   0.000     .2928555    .4345102
         14  |   .4894755   .0399123    12.26   0.000     .4112488    .5677021
         16  |   .6782564   .0376259    18.03   0.000      .604511    .7520017
             |
  1.dregular |   .3623407    .023702    15.29   0.000     .3158856    .4087957
    1.dunion |   .0256725   .0150941     1.70   0.089    -.0039113    .0552563
             |
         occ |
          2  |   .0076257   .5063079     0.02   0.988    -.9847196     .999971
          3  |   .1373328   .5039725     0.27   0.785    -.8504351    1.125101
          4  |   .0074947   .5063583     0.01   0.988    -.9849493    .9999387
          5  |   .1581349   .5058214     0.31   0.755    -.8332569    1.149527
          6  |   .1173431   .5058052     0.23   0.817     -.874017    1.108703
          7  |   .1237379   .5064071     0.24   0.807    -.8688018    1.116278
          8  |   .1754929   .5060584     0.35   0.729    -.8163633    1.167349
          9  |   .2934661   .5064566     0.58   0.562    -.6991707    1.286103
         10  |   .2884292   .5059777     0.57   0.569    -.7032689    1.280127
         11  |  -.0373539   .5068416    -0.07   0.941    -1.030745    .9560373
         12  |   .1276806   .5108038     0.25   0.803    -.8734765    1.128838
             |
         ind |
          2  |  -.1838103   .3212899    -0.57   0.567     -.813527    .4459063
          3  |   .5373363   .5344431     1.01   0.315    -.5101529    1.584825
          4  |   .1596834   .5094954     0.31   0.754    -.8389091    1.158276
          5  |   .1876744   .5095375     0.37   0.713    -.8110007    1.186349
          6  |   .1464459    .508121     0.29   0.773     -.849453    1.142345
          7  |   .2885607   .5116533     0.56   0.573    -.7142614    1.291383
          8  |   .2845176   .5099364     0.56   0.577    -.7149394    1.283975
          9  |   .3349005   .5115857     0.65   0.513     -.667789     1.33759
         10  |   .1407802   .5098506     0.28   0.782    -.8585086    1.140069
         11  |   .2566024   .5101331     0.50   0.615      -.74324    1.256445
         12  |    .286318   .5103646     0.56   0.575    -.7139782    1.286614
         13  |   .2874145   .5102195     0.56   0.573    -.7125973    1.287426
         14  |   .2146033   .5097456     0.42   0.674    -.7844798    1.213686
         15  |   .2516884    .510435     0.49   0.622    -.7487457    1.252123
         16  |   .2074129   .5093716     0.41   0.684    -.7909372    1.205763
         17  |   .0453469   .5244288     0.09   0.931    -.9825147    1.073209
         18  |   .2164676   .5149015     0.42   0.674    -.7927208    1.225656
             |
       dsize |
          1  |    .040997   .0165475     2.48   0.013     .0085646    .0734294
          2  |    .127976   .0166106     7.70   0.000     .0954199    .1605322
             |
  initialemp |   .0469913   .0006131    76.65   0.000     .0457897    .0481929
       _cons |     5.3185   .0755731    70.38   0.000      5.17038    5.466621
-------------+----------------------------------------------------------------
snd3_lnvar   |
       _cons |  -1.177156   .0231824   -50.78   0.000    -1.222593   -1.131719
------------------------------------------------------------------------------

 ( 1)  [fst3_mean]_cons - [snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0105425   .0344747     0.31   0.760    -.0570266    .0781116
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst3 snd3
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp])*`X' ///
>                                 +[fst3_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst3_mean]_b[emptendif3]*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst3_mean]emptendif2 + 8*[fst3_mean]emptendif3 + 2*[fst3_mean]_cons -
       2*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0263026   .0687841     0.38   0.702    -.1085118    .1611169
------------------------------------------------------------------------------

 ( 1)  25*[fst3_mean]emptendif2 + 125*[fst3_mean]emptendif3 + 5*[fst3_mean]_cons
       - 5*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0833992   .1722026     0.48   0.628    -.2541117    .4209102
------------------------------------------------------------------------------

 ( 1)  100*[fst3_mean]emptendif2 + 1000*[fst3_mean]emptendif3 +
       10*[fst3_mean]_cons - 10*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2153527   .3483539     0.62   0.536    -.4674085    .8981138
------------------------------------------------------------------------------

 ( 1)  225*[fst3_mean]emptendif2 + 3375*[fst3_mean]emptendif3 +
       15*[fst3_mean]_cons - 15*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3766318   .5313205     0.71   0.478    -.6647372    1.418001
------------------------------------------------------------------------------

 ( 1)  400*[fst3_mean]emptendif2 + 8000*[fst3_mean]emptendif3 +
       20*[fst3_mean]_cons - 20*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .548008    .720485     0.76   0.447    -.8641166    1.960133
------------------------------------------------------------------------------

 ( 1)  625*[fst3_mean]emptendif2 + 15625*[fst3_mean]emptendif3 +
       25*[fst3_mean]_cons - 25*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7102529   .9133736     0.78   0.437    -1.079926    2.500432
------------------------------------------------------------------------------

. 
. ** quartic
. capture program drop coef

. program coef, rclass
  1.         suest fst4 snd4
  2.         lincom [fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst4, snd4

                                                Number of obs     =      8,794

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst4_mean    |
       y2004 |          0  (omitted)
       y2005 |          0  (omitted)
       y2006 |  -.1026296   .0277882    -3.69   0.000    -.1570934   -.0481657
       y2007 |   .0304348   .0304246     1.00   0.317    -.0291963    .0900659
       y2008 |  -.0138486   .0272495    -0.51   0.611    -.0672567    .0395596
       y2009 |   .0227893    .024846     0.92   0.359     -.025908    .0714866
       y2010 |  -.0549994   .0230574    -2.39   0.017    -.1001911   -.0098077
       y2011 |    .044195   .0213046     2.07   0.038     .0024386    .0859513
       y2012 |   .0062929   .0197052     0.32   0.749    -.0323287    .0449145
       y2013 |  -.0321063   .0191596    -1.68   0.094    -.0696585    .0054459
       y2014 |   .0416536   .0202681     2.06   0.040     .0019288    .0813784
  emptendif2 |  -.0018409   .0021182    -0.87   0.385    -.0059924    .0023107
  empexpdif2 |  -.0046526   .0041641    -1.12   0.264    -.0128141    .0035088
  emptendif3 |   .0001194   .0000848     1.41   0.159    -.0000469    .0002857
  empexpdif3 |    .000109   .0001138     0.96   0.338    -.0001141    .0003321
  emptendif4 |  -1.88e-06   1.06e-06    -1.78   0.075    -3.95e-06    1.87e-07
  empexpdif4 |  -8.51e-07   1.07e-06    -0.79   0.427    -2.95e-06    1.25e-06
       _cons |   .1250464    .061245     2.04   0.041     .0050084    .2450843
-------------+----------------------------------------------------------------
fst4_lnvar   |
       _cons |  -1.908849   .0486938   -39.20   0.000    -2.004288   -1.813411
-------------+----------------------------------------------------------------
snd4_mean    |
  1.dmarital |  -.0170065   .0169886    -1.00   0.317    -.0503036    .0162905
             |
   schooling |
         12  |   .3686575   .0362678    10.16   0.000      .297574     .439741
         14  |   .4904489   .0400165    12.26   0.000     .4120181    .5688797
         16  |   .6807563   .0377633    18.03   0.000     .6067416     .754771
             |
  1.dregular |   .3699254   .0234874    15.75   0.000     .3238909    .4159599
    1.dunion |    .022798   .0150668     1.51   0.130    -.0067324    .0523284
             |
         occ |
          2  |   .1367752   .5121331     0.27   0.789    -.8669872    1.140538
          3  |   .2020558   .5093232     0.40   0.692    -.7961994    1.200311
          4  |   .0745937   .5117182     0.15   0.884    -.9283556    1.077543
          5  |   .2244303   .5112333     0.44   0.661    -.7775685    1.226429
          6  |   .1859388    .511202     0.36   0.716    -.8159988    1.187876
          7  |   .1870576   .5118079     0.37   0.715    -.8160674    1.190183
          8  |   .2383657   .5114828     0.47   0.641    -.7641221    1.240854
          9  |    .360206   .5118422     0.70   0.482    -.6429864    1.363398
         10  |    .354769   .5113777     0.69   0.488    -.6475128    1.357051
         11  |   .0321361   .5122266     0.06   0.950    -.9718097    1.036082
         12  |   .1953265   .5160635     0.38   0.705    -.8161394    1.206792
             |
         ind |
          2  |  -.2407638   .3219142    -0.75   0.455     -.871704    .3901764
          3  |   .4202538   .5395151     0.78   0.436    -.6371764    1.477684
          4  |   .0670806   .5148501     0.13   0.896     -.942007    1.076168
          5  |   .0929876   .5148923     0.18   0.857    -.9161828    1.102158
          6  |   .0492766   .5134359     0.10   0.924    -.9570392    1.055592
          7  |   .1859024     .51687     0.36   0.719    -.8271442    1.198949
          8  |   .1852828   .5152749     0.36   0.719    -.8246375    1.195203
          9  |   .2361732   .5168931     0.46   0.648    -.7769186    1.249265
         10  |    .042466   .5151992     0.08   0.934    -.9673059    1.052238
         11  |   .1597961   .5154898     0.31   0.757    -.8505453    1.170138
         12  |   .1768952   .5156856     0.34   0.732      -.83383     1.18762
         13  |   .1868925   .5155672     0.36   0.717    -.8236005    1.197386
         14  |   .1191073   .5150535     0.23   0.817    -.8903791    1.128594
         15  |   .1435867   .5157481     0.28   0.781    -.8672611    1.154434
         16  |   .1118653   .5147037     0.22   0.828    -.8969354    1.120666
         17  |  -.0729158   .5300984    -0.14   0.891     -1.11189    .9660581
         18  |   .1099764   .5202392     0.21   0.833    -.9096738    1.129627
             |
       dsize |
          1  |   .0423334   .0164351     2.58   0.010     .0101213    .0745455
          2  |   .1304004   .0165702     7.87   0.000     .0979235    .1628774
             |
  initialemp |   .0970196   .0006122   158.48   0.000     .0958198    .0982195
       _cons |   5.147347   .0755171    68.16   0.000     4.999336    5.295358
-------------+----------------------------------------------------------------
snd4_lnvar   |
       _cons |  -1.180291   .0231536   -50.98   0.000    -1.225671    -1.13491
------------------------------------------------------------------------------

 ( 1)  [fst4_mean]_cons - [snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0280267   .0612473     0.46   0.647    -.0920157    .1480692
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst4 snd4
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp])*`X' ///
>                                 +[fst4_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif3]*`X'*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif4]*`X'*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst4_mean]emptendif2 + 8*[fst4_mean]emptendif3 +
       16*[fst4_mean]emptendif4 + 2*[fst4_mean]_cons - 2*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0496154   .1216257     0.41   0.683    -.1887665    .2879973
------------------------------------------------------------------------------

 ( 1)  25*[fst4_mean]emptendif2 + 125*[fst4_mean]emptendif3 +
       625*[fst4_mean]emptendif4 + 5*[fst4_mean]_cons - 5*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1078657   .3033394     0.36   0.722    -.4866687    .7024001
------------------------------------------------------------------------------

 ( 1)  100*[fst4_mean]emptendif2 + 1000*[fst4_mean]emptendif3 +
       10000*[fst4_mean]emptendif4 + 10*[fst4_mean]_cons -
       10*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1968006   .6107798     0.32   0.747    -1.000306    1.393907
------------------------------------------------------------------------------

 ( 1)  225*[fst4_mean]emptendif2 + 3375*[fst4_mean]emptendif3 +
       50625*[fst4_mean]emptendif4 + 15*[fst4_mean]_cons -
       15*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3140416   .9248968     0.34   0.734    -1.498723    2.126806
------------------------------------------------------------------------------

 ( 1)  400*[fst4_mean]emptendif2 + 8000*[fst4_mean]emptendif3 +
       160000*[fst4_mean]emptendif4 + 20*[fst4_mean]_cons -
       20*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4785983   1.242464     0.39   0.700    -1.956586    2.913782
------------------------------------------------------------------------------

 ( 1)  625*[fst4_mean]emptendif2 + 15625*[fst4_mean]emptendif3 +
       390625*[fst4_mean]emptendif4 + 25*[fst4_mean]_cons -
       25*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6812525   1.560462     0.44   0.662    -2.377197    3.739702
------------------------------------------------------------------------------

. 
end of do-file
Year Dummy Type: Sum2

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd $Inputfd

. 
. qui {

. 
end of do-file

. qui{

. 
. 
. * estimation
. forvalues i=1/4 {
  2.         **** 1st step
.         qui $FstReg ///
>                                 `contrl`i'' ///
>                                 if fst==1
  3.         est sto fst`i'
  4.         gen emptenB`i'=`LHSterm`i'' ///
>                                                                 $DmYear
  5.         gen intwemp`i'=realwage-emptenB`i'
  6.         
.         **** 2nd step
.         qui reg intwemp`i' ///
>                                 $SndReg
  7.         est sto snd`i'
  8. }
(1,076 missing values generated)
(2,498 missing values generated)
(1,157 missing values generated)
(2,567 missing values generated)
(1,157 missing values generated)
(2,567 missing values generated)
(1,157 missing values generated)
(2,567 missing values generated)

. 
. * calc. return
. ** linear
. capture program drop coef

. program coef, rclass
  1.         suest fst1 snd1
  2.         lincom [fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst1, snd1

                                                Number of obs     =      8,797

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst1_mean    |
       y2004 |          0  (omitted)
       y2005 |          0  (omitted)
       y2006 |  -.1035093   .0277972    -3.72   0.000    -.1579908   -.0490279
       y2007 |   .0294138   .0304687     0.97   0.334    -.0303038    .0891313
       y2008 |  -.0130532      .0273    -0.48   0.633    -.0665601    .0404538
       y2009 |   .0221613   .0248851     0.89   0.373    -.0266125    .0709351
       y2010 |  -.0536269   .0230298    -2.33   0.020    -.0987644   -.0084894
       y2011 |   .0443036   .0213088     2.08   0.038      .002539    .0860681
       y2012 |   .0053776   .0197009     0.27   0.785    -.0332354    .0439907
       y2013 |  -.0329762   .0191279    -1.72   0.085    -.0704662    .0045139
       y2014 |   .0419026   .0202897     2.07   0.039     .0021355    .0816697
       _cons |   .0488278   .0164667     2.97   0.003     .0165537    .0811019
-------------+----------------------------------------------------------------
fst1_lnvar   |
       _cons |  -1.908867    .048744   -39.16   0.000    -2.004404   -1.813331
-------------+----------------------------------------------------------------
snd1_mean    |
        year |
       2005  |   .1014202   .0334966     3.03   0.002     .0357679    .1670724
       2006  |   .1769862   .0330056     5.36   0.000     .1122964    .2416761
       2007  |   .1081069   .0305286     3.54   0.000      .048272    .1679417
       2008  |   .1152909   .0299934     3.84   0.000     .0565049    .1740768
       2009  |    .125286    .027698     4.52   0.000     .0709988    .1795731
       2010  |   .1376106   .0275554     4.99   0.000      .083603    .1916181
       2011  |   .0892335   .0278127     3.21   0.001     .0347216    .1437454
       2012  |   .0684117   .0278459     2.46   0.014     .0138348    .1229886
       2013  |   .0775075    .029331     2.64   0.008     .0200199    .1349952
       2014  |   .0650507   .0291292     2.23   0.026     .0079586    .1221428
             |
  1.dmarital |  -.0104495   .0167782    -0.62   0.533    -.0433342    .0224352
             |
   schooling |
         12  |   .3445495   .0355606     9.69   0.000     .2748519     .414247
         14  |   .4645922   .0393711    11.80   0.000     .3874263     .541758
         16  |   .6513623   .0371837    17.52   0.000     .5784837     .724241
             |
  1.dregular |    .366797    .023717    15.47   0.000     .3203125    .4132814
    1.dunion |   .0223719   .0149482     1.50   0.134     -.006926    .0516697
             |
         occ |
          2  |   .0206706   .5177024     0.04   0.968    -.9940075    1.035349
          3  |   .0415772   .5160623     0.08   0.936    -.9698862    1.053041
          4  |  -.0884235   .5184473    -0.17   0.865    -1.104562    .9277146
          5  |   .0773556   .5179937     0.15   0.881    -.9378934    1.092605
          6  |   .0256271   .5179796     0.05   0.961    -.9895943    1.040849
          7  |   .0243691   .5185682     0.05   0.963    -.9920059    1.040744
          8  |    .079979   .5182915     0.15   0.877    -.9358536    1.095812
          9  |    .215472   .5183755     0.42   0.678    -.8005253    1.231469
         10  |   .1853558   .5182699     0.36   0.721    -.8304346    1.201146
         11  |  -.1333348   .5188498    -0.26   0.797    -1.150262    .8835921
         12  |   .0278985   .5226334     0.05   0.957    -.9964442    1.052241
             |
         ind |
          2  |  -.1170221   .3219173    -0.36   0.716    -.7479684    .5139242
          3  |   .5940024   .5452196     1.09   0.276    -.4746084    1.662613
          4  |   .2386136     .52121     0.46   0.647    -.7829393    1.260166
          5  |   .2694914   .5212722     0.52   0.605    -.7521833    1.291166
          6  |   .2261644   .5197354     0.44   0.663    -.7924982    1.244827
          7  |    .365863   .5231702     0.70   0.484    -.6595317    1.391258
          8  |   .3664878   .5215712     0.70   0.482     -.655773    1.388749
          9  |   .4055622   .5231019     0.78   0.438    -.6196987    1.430823
         10  |   .2264406    .521467     0.43   0.664     -.795616    1.248497
         11  |    .333055   .5217416     0.64   0.523    -.6895398     1.35565
         12  |   .3556388   .5220248     0.68   0.496     -.667511    1.378789
         13  |   .3657814   .5220119     0.70   0.483    -.6573431    1.388906
         14  |   .2951073   .5214218     0.57   0.571    -.7268608    1.317075
         15  |   .3516802   .5224473     0.67   0.501    -.6722976    1.375658
         16  |   .2812263   .5209429     0.54   0.589    -.7398031    1.302256
         17  |   .2075844   .5365908     0.39   0.699    -.8441142    1.259283
         18  |   .2717641   .5263369     0.52   0.606    -.7598373    1.303366
             |
       dsize |
          1  |   .0435032    .016287     2.67   0.008     .0115813    .0754252
          2  |   .1331091   .0164062     8.11   0.000     .1009536    .1652646
             |
  initialemp |   .0219527   .0006112    35.92   0.000     .0207548    .0231506
       _cons |   5.381861   .0747949    71.95   0.000     5.235265    5.528456
-------------+----------------------------------------------------------------
snd1_lnvar   |
       _cons |  -1.199062   .0234041   -51.23   0.000    -1.244933   -1.153191
------------------------------------------------------------------------------

 ( 1)  [fst1_mean]_cons - [snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0268751   .0164898     1.63   0.103    -.0054443    .0591945
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst1 snd1
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp])*`X'
  4.         }
  5. end

. emprtn

 ( 1)  2*[fst1_mean]_cons - 2*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0537502   .0329796     1.63   0.103    -.0108885     .118389
------------------------------------------------------------------------------

 ( 1)  5*[fst1_mean]_cons - 5*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1343756   .0824489     1.63   0.103    -.0272213    .2959725
------------------------------------------------------------------------------

 ( 1)  10*[fst1_mean]_cons - 10*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2687512   .1648979     1.63   0.103    -.0544426    .5919451
------------------------------------------------------------------------------

 ( 1)  15*[fst1_mean]_cons - 15*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4031268   .2473468     1.63   0.103     -.081664    .8879176
------------------------------------------------------------------------------

 ( 1)  20*[fst1_mean]_cons - 20*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5375024   .3297957     1.63   0.103    -.1088853     1.18389
------------------------------------------------------------------------------

 ( 1)  25*[fst1_mean]_cons - 25*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .671878   .4122446     1.63   0.103    -.1361066    1.479863
------------------------------------------------------------------------------

. 
. ** qadratic
. capture program drop coef

. program coef, rclass
  1.         suest fst2 snd2
  2.         lincom [fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst2, snd2

                                                Number of obs     =      8,794

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst2_mean    |
       y2004 |          0  (omitted)
       y2005 |          0  (omitted)
       y2006 |  -.1033253   .0277795    -3.72   0.000    -.1577721   -.0488785
       y2007 |   .0295702   .0304844     0.97   0.332     -.030178    .0893185
       y2008 |   -.013036   .0273027    -0.48   0.633    -.0665484    .0404764
       y2009 |   .0223225   .0248475     0.90   0.369    -.0263778    .0710227
       y2010 |  -.0539938   .0230224    -2.35   0.019    -.0991168   -.0088708
       y2011 |   .0444162   .0213009     2.09   0.037     .0026672    .0861653
       y2012 |   .0057119   .0197233     0.29   0.772    -.0329451    .0443689
       y2013 |  -.0327749   .0191585    -1.71   0.087     -.070325    .0047751
       y2014 |    .041316   .0203068     2.03   0.042     .0015154    .0811165
  emptendif2 |   -.000031   .0002438    -0.13   0.899    -.0005089    .0004469
  empexpdif2 |  -.0001026    .000254    -0.40   0.686    -.0006005    .0003953
       _cons |   .0546642   .0207019     2.64   0.008     .0140892    .0952392
-------------+----------------------------------------------------------------
fst2_lnvar   |
       _cons |  -1.908132   .0487704   -39.12   0.000     -2.00372   -1.812544
-------------+----------------------------------------------------------------
snd2_mean    |
        year |
       2005  |   .1005968   .0333399     3.02   0.003     .0352517    .1659418
       2006  |    .174913   .0328215     5.33   0.000      .110584     .239242
       2007  |   .1069646   .0303413     3.53   0.000     .0474967    .1664324
       2008  |   .1139758   .0298007     3.82   0.000     .0555675    .1723841
       2009  |   .1239881   .0275502     4.50   0.000     .0699907    .1779854
       2010  |   .1362383    .027431     4.97   0.000     .0824745    .1900022
       2011  |   .0874374    .027666     3.16   0.002      .033213    .1416617
       2012  |   .0668317   .0276966     2.41   0.016     .0125474     .121116
       2013  |   .0752668   .0291709     2.58   0.010     .0180928    .1324408
       2014  |   .0639356    .028944     2.21   0.027     .0072065    .1206648
             |
  1.dmarital |  -.0136782   .0167758    -0.82   0.415    -.0465581    .0192017
             |
   schooling |
         12  |   .3304869   .0349931     9.44   0.000     .2619017    .3990722
         14  |   .4496378   .0388379    11.58   0.000     .3735169    .5257586
         16  |   .6347876    .036635    17.33   0.000     .5629843    .7065909
             |
  1.dregular |   .3546015   .0234171    15.14   0.000     .3087048    .4004982
    1.dunion |   .0244528   .0148853     1.64   0.100    -.0047219    .0536275
             |
         occ |
          2  |   .0149493   .5102255     0.03   0.977    -.9850743    1.014973
          3  |   .0246852   .5083806     0.05   0.961    -.9717224    1.021093
          4  |  -.1024148   .5107333    -0.20   0.841    -1.103434    .8986041
          5  |   .0630092   .5102817     0.12   0.902    -.9371246    1.063143
          6  |   .0097933   .5102661     0.02   0.985    -.9903099    1.009896
          7  |   .0072969   .5108447     0.01   0.989    -.9939403    1.008534
          8  |   .0613239    .510558     0.12   0.904    -.9393514    1.061999
          9  |   .1976934   .5106703     0.39   0.699    -.8032019    1.198589
         10  |   .1690311   .5105534     0.33   0.741    -.8316351    1.169697
         11  |  -.1470672   .5111411    -0.29   0.774    -1.148885     .854751
         12  |   .0098234   .5150091     0.02   0.985    -.9995759    1.019223
             |
         ind |
          2  |  -.1114885   .3168894    -0.35   0.725    -.7325802    .5096033
          3  |   .5930134    .537464     1.10   0.270    -.4603966    1.646423
          4  |   .2488833   .5135292     0.48   0.628    -.7576155    1.255382
          5  |   .2788304   .5135956     0.54   0.587    -.7277985    1.285459
          6  |    .235062   .5120856     0.46   0.646    -.7686073    1.238731
          7  |   .3721987   .5155425     0.72   0.470    -.6382461    1.382644
          8  |   .3745243   .5139226     0.73   0.466    -.6327456    1.381794
          9  |   .4137889   .5154664     0.80   0.422    -.5965067    1.424084
         10  |   .2336085   .5137944     0.45   0.649      -.77341    1.240627
         11  |   .3418582   .5140856     0.66   0.506    -.6657311    1.349448
         12  |   .3673355   .5143484     0.71   0.475    -.6407689     1.37544
         13  |   .3795334   .5143457     0.74   0.461    -.6285657    1.387633
         14  |   .3029119   .5137589     0.59   0.555     -.704037    1.309861
         15  |   .3621416   .5147981     0.70   0.482    -.6468441    1.371127
         16  |   .2904315   .5132753     0.57   0.572    -.7155695    1.296433
         17  |   .2219863   .5289203     0.42   0.675    -.8146785    1.258651
         18  |   .2830956   .5186546     0.55   0.585    -.7334488     1.29964
             |
       dsize |
          1  |   .0448574    .016216     2.77   0.006     .0130746    .0766402
          2  |   .1347877   .0163318     8.25   0.000     .1027779    .1667974
             |
  initialemp |   .0269986    .000606    44.55   0.000     .0258108    .0281864
       _cons |   5.365917   .0744294    72.09   0.000     5.220038    5.511796
-------------+----------------------------------------------------------------
snd2_lnvar   |
       _cons |  -1.209612   .0235416   -51.38   0.000    -1.255753   -1.163472
------------------------------------------------------------------------------

 ( 1)  [fst2_mean]_cons - [snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0276656   .0207148     1.34   0.182    -.0129348    .0682659
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst2 snd2
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp])*`X' ///
>                                 +[fst2_mean]_b[emptendif2]*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst2_mean]emptendif2 + 2*[fst2_mean]_cons - 2*[snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0552071   .0412965     1.34   0.181    -.0257325    .1361468
------------------------------------------------------------------------------

 ( 1)  25*[fst2_mean]emptendif2 + 5*[fst2_mean]_cons - 5*[snd2_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1375527   .1028483     1.34   0.181    -.0640263    .3391318
------------------------------------------------------------------------------

 ( 1)  100*[fst2_mean]emptendif2 + 10*[fst2_mean]_cons - 10*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2735552   .2049611     1.33   0.182    -.1281611    .6752715
------------------------------------------------------------------------------

 ( 1)  225*[fst2_mean]emptendif2 + 15*[fst2_mean]_cons - 15*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4080072   .3074239     1.33   0.184    -.1945326    1.010547
------------------------------------------------------------------------------

 ( 1)  400*[fst2_mean]emptendif2 + 20*[fst2_mean]_cons - 20*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .540909    .411323     1.32   0.188    -.2652693    1.347087
------------------------------------------------------------------------------

 ( 1)  625*[fst2_mean]emptendif2 + 25*[fst2_mean]_cons - 25*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6722604   .5177255     1.30   0.194    -.3424629    1.686984
------------------------------------------------------------------------------

. 
. ** cubic
. capture program drop coef

. program coef, rclass
  1.         suest fst3 snd3
  2.         lincom [fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst3, snd3

                                                Number of obs     =      8,794

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst3_mean    |
       y2004 |          0  (omitted)
       y2005 |          0  (omitted)
       y2006 |  -.1033307   .0278025    -3.72   0.000    -.1578226   -.0488388
       y2007 |   .0294003   .0305158     0.96   0.335    -.0304095    .0892101
       y2008 |  -.0125391   .0273334    -0.46   0.646    -.0661116    .0410334
       y2009 |   .0220115   .0248596     0.89   0.376    -.0267125    .0707354
       y2010 |  -.0541937   .0230601    -2.35   0.019    -.0993907   -.0089968
       y2011 |   .0442051   .0213065     2.07   0.038     .0024451     .085965
       y2012 |   .0056269    .019712     0.29   0.775    -.0330079    .0442617
       y2013 |  -.0325395   .0191291    -1.70   0.089    -.0700318    .0049527
       y2014 |   .0413006   .0202769     2.04   0.042     .0015586    .0810426
  emptendif2 |   .0013557   .0009289     1.46   0.144     -.000465    .0031764
  empexpdif2 |  -.0011235   .0013823    -0.81   0.416    -.0038328    .0015859
  emptendif3 |  -.0000256   .0000163    -1.57   0.116    -.0000576    6.31e-06
  empexpdif3 |    .000015   .0000171     0.88   0.380    -.0000186    .0000486
       _cons |   .0575338   .0344525     1.67   0.095    -.0099918    .1250594
-------------+----------------------------------------------------------------
fst3_lnvar   |
       _cons |  -1.908234    .048702   -39.18   0.000    -2.003688    -1.81278
-------------+----------------------------------------------------------------
snd3_mean    |
        year |
       2005  |   .1009268   .0338494     2.98   0.003     .0345832    .1672704
       2006  |   .1753668   .0331914     5.28   0.000     .1103128    .2404208
       2007  |   .1065496   .0308256     3.46   0.001     .0461326    .1669667
       2008  |   .1121436   .0303036     3.70   0.000     .0527496    .1715376
       2009  |   .1214837   .0280249     4.33   0.000      .066556    .1764115
       2010  |   .1326634   .0278853     4.76   0.000     .0780093    .1873175
       2011  |   .0822571   .0281368     2.92   0.003       .02711    .1374041
       2012  |   .0624076   .0281681     2.22   0.027     .0071992     .117616
       2013  |   .0708178   .0296286     2.39   0.017     .0127467    .1288889
       2014  |   .0610553   .0293408     2.08   0.037     .0035484    .1185622
             |
  1.dmarital |  -.0237924   .0170878    -1.39   0.164    -.0572839     .009699
             |
   schooling |
         12  |   .3626797    .036191    10.02   0.000     .2917466    .4336128
         14  |   .4877594    .039974    12.20   0.000     .4094118    .5661071
         16  |   .6769837   .0377605    17.93   0.000     .6029744    .7509929
             |
  1.dregular |   .3642447   .0235878    15.44   0.000     .3180134     .410476
    1.dunion |    .024137   .0150921     1.60   0.110    -.0054429    .0537169
             |
         occ |
          2  |   .0263761   .5181624     0.05   0.959    -.9892036    1.041956
          3  |   .1163936   .5158581     0.23   0.821    -.8946696    1.127457
          4  |  -.0098494   .5181957    -0.02   0.985    -1.025494    1.005796
          5  |   .1350779   .5177313     0.26   0.794    -.8796568    1.149813
          6  |   .0945479   .5177259     0.18   0.855    -.9201761    1.109272
          7  |   .0986136   .5183045     0.19   0.849    -.9172445    1.114472
          8  |   .1547778   .5180014     0.30   0.765    -.8604863    1.170042
          9  |   .2889365   .5181341     0.56   0.577    -.7265876    1.304461
         10  |   .2578124   .5180169     0.50   0.619     -.757482    1.273107
         11  |  -.0490571    .518604    -0.09   0.925    -1.065502     .967388
         12  |   .0893471   .5225553     0.17   0.864    -.9348424    1.113537
             |
         ind |
          2  |  -.1555021   .3262331    -0.48   0.634    -.7949073    .4839031
          3  |   .5559161   .5447957     1.02   0.308     -.511864    1.623696
          4  |   .1824135   .5212442     0.35   0.726    -.8392064    1.204033
          5  |   .2098412   .5213114     0.40   0.687    -.8119104    1.231593
          6  |   .1681154   .5198141     0.32   0.746    -.8507015    1.186932
          7  |   .3067713   .5232809     0.59   0.558    -.7188405    1.332383
          8  |   .3060707   .5216446     0.59   0.557     -.716334    1.328475
          9  |   .3562404   .5232562     0.68   0.496    -.6693229    1.381804
         10  |   .1658848    .521512     0.32   0.750    -.8562599     1.18803
         11  |   .2743067   .5218076     0.53   0.599    -.7484174    1.297031
         12  |   .3033177   .5220216     0.58   0.561    -.7198259    1.326461
         13  |   .3088573   .5220159     0.59   0.554     -.714275     1.33199
         14  |   .2406183   .5214695     0.46   0.644    -.7814431     1.26268
         15  |   .2989291   .5225462     0.57   0.567    -.7252425    1.323101
         16  |   .2221716   .5210033     0.43   0.670     -.798976    1.243319
         17  |   .1470952    .537491     0.27   0.784    -.9063677    1.200558
         18  |   .2237988   .5265027     0.43   0.671    -.8081276    1.255725
             |
       dsize |
          1  |   .0407451   .0165138     2.47   0.014     .0083787    .0731115
          2  |   .1277565   .0165946     7.70   0.000     .0952318    .1602813
             |
  initialemp |   .0469683   .0006127    76.66   0.000     .0457675    .0481692
       _cons |   5.227759   .0772402    67.68   0.000     5.076372    5.379147
-------------+----------------------------------------------------------------
snd3_lnvar   |
       _cons |  -1.180852   .0231411   -51.03   0.000    -1.226208   -1.135496
------------------------------------------------------------------------------

 ( 1)  [fst3_mean]_cons - [snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0105655   .0344739     0.31   0.759    -.0570021     .078133
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst3 snd3
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp])*`X' ///
>                                 +[fst3_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst3_mean]_b[emptendif3]*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst3_mean]emptendif2 + 8*[fst3_mean]emptendif3 + 2*[fst3_mean]_cons -
       2*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0263484   .0687825     0.38   0.702    -.1084628    .1611597
------------------------------------------------------------------------------

 ( 1)  25*[fst3_mean]emptendif2 + 125*[fst3_mean]emptendif3 + 5*[fst3_mean]_cons
       - 5*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .083514   .1721985     0.48   0.628     -.253989    .4210169
------------------------------------------------------------------------------

 ( 1)  100*[fst3_mean]emptendif2 + 1000*[fst3_mean]emptendif3 +
       10*[fst3_mean]_cons - 10*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2155821   .3483457     0.62   0.536    -.4671628     .898327
------------------------------------------------------------------------------

 ( 1)  225*[fst3_mean]emptendif2 + 3375*[fst3_mean]emptendif3 +
       15*[fst3_mean]_cons - 15*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3769759   .5313079     0.71   0.478    -.6643683     1.41832
------------------------------------------------------------------------------

 ( 1)  400*[fst3_mean]emptendif2 + 8000*[fst3_mean]emptendif3 +
       20*[fst3_mean]_cons - 20*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5484669   .7204679     0.76   0.446    -.8636241    1.960558
------------------------------------------------------------------------------

 ( 1)  625*[fst3_mean]emptendif2 + 15625*[fst3_mean]emptendif3 +
       25*[fst3_mean]_cons - 25*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7108265   .9133516     0.78   0.436     -1.07931    2.500963
------------------------------------------------------------------------------

. 
. ** quartic
. capture program drop coef

. program coef, rclass
  1.         suest fst4 snd4
  2.         lincom [fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst4, snd4

                                                Number of obs     =      8,794

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst4_mean    |
       y2004 |          0  (omitted)
       y2005 |          0  (omitted)
       y2006 |  -.1026296   .0277882    -3.69   0.000    -.1570934   -.0481657
       y2007 |   .0304348   .0304246     1.00   0.317    -.0291963    .0900659
       y2008 |  -.0138486   .0272495    -0.51   0.611    -.0672567    .0395596
       y2009 |   .0227893    .024846     0.92   0.359     -.025908    .0714866
       y2010 |  -.0549994   .0230574    -2.39   0.017    -.1001911   -.0098077
       y2011 |    .044195   .0213046     2.07   0.038     .0024386    .0859513
       y2012 |   .0062929   .0197052     0.32   0.749    -.0323287    .0449145
       y2013 |  -.0321063   .0191596    -1.68   0.094    -.0696585    .0054459
       y2014 |   .0416536   .0202681     2.06   0.040     .0019288    .0813784
  emptendif2 |  -.0018409   .0021182    -0.87   0.385    -.0059924    .0023107
  empexpdif2 |  -.0046526   .0041641    -1.12   0.264    -.0128141    .0035088
  emptendif3 |   .0001194   .0000848     1.41   0.159    -.0000469    .0002857
  empexpdif3 |    .000109   .0001138     0.96   0.338    -.0001141    .0003321
  emptendif4 |  -1.88e-06   1.06e-06    -1.78   0.075    -3.95e-06    1.87e-07
  empexpdif4 |  -8.51e-07   1.07e-06    -0.79   0.427    -2.95e-06    1.25e-06
       _cons |   .1250464    .061245     2.04   0.041     .0050084    .2450843
-------------+----------------------------------------------------------------
fst4_lnvar   |
       _cons |  -1.908849   .0486938   -39.20   0.000    -2.004288   -1.813411
-------------+----------------------------------------------------------------
snd4_mean    |
        year |
       2005  |   .1008055    .033852     2.98   0.003     .0344567    .1671542
       2006  |    .177748   .0331602     5.36   0.000     .1127552    .2427407
       2007  |   .1074393   .0308053     3.49   0.000     .0470621    .1678165
       2008  |   .1102465   .0304235     3.62   0.000     .0506176    .1698755
       2009  |   .1221196   .0280358     4.36   0.000     .0671705    .1770686
       2010  |   .1354403   .0279255     4.85   0.000     .0807073    .1901733
       2011  |   .0850785   .0281402     3.02   0.002     .0299248    .1402323
       2012  |   .0644693   .0281298     2.29   0.022     .0093358    .1196027
       2013  |   .0740529   .0295991     2.50   0.012     .0160397    .1320661
       2014  |   .0649385   .0292834     2.22   0.027     .0075442    .1223329
             |
  1.dmarital |  -.0181891   .0169207    -1.07   0.282     -.051353    .0149748
             |
   schooling |
         12  |   .3674475   .0363057    10.12   0.000     .2962896    .4386054
         14  |   .4883753    .040061    12.19   0.000     .4098571    .5668935
         16  |    .679124   .0378796    17.93   0.000     .6048814    .7533666
             |
  1.dregular |   .3717881   .0233851    15.90   0.000     .3259542     .417622
    1.dunion |   .0213278   .0150649     1.42   0.157     -.008199    .0508545
             |
         occ |
          2  |   .1561761   .5229114     0.30   0.765    -.8687113    1.181064
          3  |   .1800369   .5211066     0.35   0.730    -.8413132    1.201387
          4  |   .0561673   .5234566     0.11   0.915    -.9697889    1.082123
          5  |   .2003794   .5230418     0.38   0.702    -.8247637    1.225523
          6  |   .1621485     .52302     0.31   0.757    -.8629518    1.187249
          7  |   .1610472   .5236061     0.31   0.758    -.8652019    1.187296
          8  |   .2165476   .5233233     0.41   0.679    -.8091472    1.242242
          9  |   .3549922   .5234183     0.68   0.498    -.6708888    1.380873
         10  |   .3230083    .523316     0.62   0.537    -.7026723    1.348689
         11  |   .0195928   .5238944     0.04   0.970    -1.007221    1.046407
         12  |   .1564217   .5277118     0.30   0.767    -.8778745    1.190718
             |
         ind |
          2  |  -.2113529   .3267263    -0.65   0.518    -.8517247     .429019
          3  |   .4401485   .5497265     0.80   0.423    -.6372956    1.517593
          4  |     .09155    .526468     0.17   0.862    -.9403083    1.123408
          5  |   .1168462   .5265354     0.22   0.824    -.9151442    1.148837
          6  |   .0725385   .5249991     0.14   0.890    -.9564408    1.101518
          7  |   .2058383   .5283704     0.39   0.697    -.8297487    1.241425
          8  |   .2085052    .526855     0.40   0.692    -.8241116    1.241122
          9  |   .2589953   .5284323     0.49   0.624    -.7767129    1.294704
         10  |   .0689668   .5267318     0.13   0.896    -.9634086    1.101342
         11  |   .1791044   .5270334     0.34   0.734    -.8538621    1.212071
         12  |   .1954296   .5272154     0.37   0.711    -.8378936    1.228753
         13  |   .2102056   .5272354     0.40   0.690    -.8231568    1.243568
         14  |   .1465142   .5266492     0.28   0.781    -.8856993    1.178728
         15  |   .1927236   .5277324     0.37   0.715    -.8416128     1.22706
         16  |   .1281272   .5262063     0.24   0.808    -.9032183    1.159473
         17  |   .0319558   .5430479     0.06   0.953    -1.032399     1.09631
         18  |   .1192527   .5317005     0.22   0.823    -.9228612    1.161367
             |
       dsize |
          1  |   .0421432   .0164001     2.57   0.010     .0099995    .0742869
          2  |   .1301889   .0165559     7.86   0.000       .09774    .1626379
             |
  initialemp |   .0969973   .0006118   158.54   0.000     .0957982    .0981965
       _cons |   5.054454   .0771029    65.55   0.000     4.903335    5.205573
-------------+----------------------------------------------------------------
snd4_lnvar   |
       _cons |  -1.183973   .0231113   -51.23   0.000     -1.22927   -1.138676
------------------------------------------------------------------------------

 ( 1)  [fst4_mean]_cons - [snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .028049   .0612467     0.46   0.647    -.0919923    .1480903
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst4 snd4
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp])*`X' ///
>                                 +[fst4_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif3]*`X'*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif4]*`X'*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst4_mean]emptendif2 + 8*[fst4_mean]emptendif3 +
       16*[fst4_mean]emptendif4 + 2*[fst4_mean]_cons - 2*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |     .04966   .1216243     0.41   0.683    -.1887193    .2880393
------------------------------------------------------------------------------

 ( 1)  25*[fst4_mean]emptendif2 + 125*[fst4_mean]emptendif3 +
       625*[fst4_mean]emptendif4 + 5*[fst4_mean]_cons - 5*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1079771   .3033357     0.36   0.722      -.48655    .7025042
------------------------------------------------------------------------------

 ( 1)  100*[fst4_mean]emptendif2 + 1000*[fst4_mean]emptendif3 +
       10000*[fst4_mean]emptendif4 + 10*[fst4_mean]_cons -
       10*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1970234   .6107716     0.32   0.747    -1.000067    1.394114
------------------------------------------------------------------------------

 ( 1)  225*[fst4_mean]emptendif2 + 3375*[fst4_mean]emptendif3 +
       50625*[fst4_mean]emptendif4 + 15*[fst4_mean]_cons -
       15*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3143759    .924884     0.34   0.734    -1.498364    2.127115
------------------------------------------------------------------------------

 ( 1)  400*[fst4_mean]emptendif2 + 8000*[fst4_mean]emptendif3 +
       160000*[fst4_mean]emptendif4 + 20*[fst4_mean]_cons -
       20*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4790439   1.242447     0.39   0.700    -1.956107    2.914194
------------------------------------------------------------------------------

 ( 1)  625*[fst4_mean]emptendif2 + 15625*[fst4_mean]emptendif3 +
       390625*[fst4_mean]emptendif4 + 25*[fst4_mean]_cons -
       25*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6818095   1.560441     0.44   0.662    -2.376598    3.740217
------------------------------------------------------------------------------

. 
end of do-file
Year Dummy Type: Dm

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd $Inputfd

. 
. qui {

. 
end of do-file

. qui{

. 
. 
. * estimation
. forvalues i=1/4 {
  2.         **** 1st step
.         qui $FstReg ///
>                                 `contrl`i'' ///
>                                 if fst==1
  3.         est sto fst`i'
  4.         gen emptenB`i'=`LHSterm`i'' ///
>                                                                 $DmYear
  5.         gen intwemp`i'=realwage-emptenB`i'
  6.         
.         **** 2nd step
.         qui reg intwemp`i' ///
>                                 $SndReg
  7.         est sto snd`i'
  8. }
(1,076 missing values generated)
(2,498 missing values generated)
(1,157 missing values generated)
(2,567 missing values generated)
(1,157 missing values generated)
(2,567 missing values generated)
(1,157 missing values generated)
(2,567 missing values generated)

. 
. * calc. return
. ** linear
. capture program drop coef

. program coef, rclass
  1.         suest fst1 snd1
  2.         lincom [fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst1, snd1

                                                Number of obs     =      8,797

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst1_mean    |
       dyear |
       2006  |  -.1035093   .0277972    -3.72   0.000    -.1579908   -.0490279
       2007  |  -.0740956   .0264189    -2.80   0.005    -.1258757   -.0223154
       2008  |  -.0871487   .0242823    -3.59   0.000    -.1347411   -.0395563
       2009  |  -.0649874   .0239152    -2.72   0.007    -.1118604   -.0181144
       2010  |  -.1186143   .0223771    -5.30   0.000    -.1624725   -.0747561
       2011  |  -.0743107   .0222629    -3.34   0.001    -.1179452   -.0306763
       2012  |  -.0689331   .0208517    -3.31   0.001    -.1098016   -.0280646
       2013  |  -.1019093   .0217575    -4.68   0.000    -.1445532   -.0592654
       2014  |  -.0600067   .0219223    -2.74   0.006    -.1029737   -.0170398
             |
       _cons |   .0488278   .0164667     2.97   0.003     .0165537    .0811019
-------------+----------------------------------------------------------------
fst1_lnvar   |
       _cons |  -1.908867    .048744   -39.16   0.000    -2.004404   -1.813331
-------------+----------------------------------------------------------------
snd1_mean    |
        year |
       2005  |   .1014202   .0334966     3.03   0.002     .0357679    .1670724
       2006  |   .0734769   .0330056     2.23   0.026      .008787    .1381667
       2007  |   .0340113   .0305286     1.11   0.265    -.0258236    .0938462
       2008  |   .0281421   .0299934     0.94   0.348    -.0306439    .0869281
       2009  |   .0602985    .027698     2.18   0.029     .0060114    .1145857
       2010  |   .0189962   .0275554     0.69   0.491    -.0350114    .0730038
       2011  |   .0149228   .0278127     0.54   0.592    -.0395892    .0694347
       2012  |  -.0005214   .0278459    -0.02   0.985    -.0550983    .0540555
       2013  |  -.0244018    .029331    -0.83   0.405    -.0818894    .0330859
       2014  |    .005044   .0291292     0.17   0.863    -.0520481    .0621361
             |
  1.dmarital |  -.0104495   .0167782    -0.62   0.533    -.0433342    .0224352
             |
   schooling |
         12  |   .3445495   .0355606     9.69   0.000     .2748519     .414247
         14  |   .4645922   .0393711    11.80   0.000     .3874263     .541758
         16  |   .6513623   .0371837    17.52   0.000     .5784836     .724241
             |
  1.dregular |    .366797    .023717    15.47   0.000     .3203125    .4132814
    1.dunion |   .0223719   .0149482     1.50   0.134     -.006926    .0516697
             |
         occ |
          2  |   .0206704   .5177024     0.04   0.968    -.9940077    1.035349
          3  |   .0415771   .5160622     0.08   0.936    -.9698863    1.053041
          4  |  -.0884236   .5184473    -0.17   0.865    -1.104562    .9277144
          5  |   .0773555   .5179937     0.15   0.881    -.9378935    1.092604
          6  |    .025627   .5179796     0.05   0.961    -.9895944    1.040848
          7  |    .024369   .5185682     0.05   0.963     -.992006    1.040744
          8  |   .0799788   .5182914     0.15   0.877    -.9358537    1.095811
          9  |   .2154719   .5183755     0.42   0.678    -.8005254    1.231469
         10  |   .1853556   .5182699     0.36   0.721    -.8304347    1.201146
         11  |   -.133335   .5188498    -0.26   0.797    -1.150262    .8835919
         12  |   .0278984   .5226334     0.05   0.957    -.9964443    1.052241
             |
         ind |
          2  |  -.1170221   .3219173    -0.36   0.716    -.7479685    .5139242
          3  |   .5940025   .5452196     1.09   0.276    -.4746084    1.662613
          4  |   .2386137     .52121     0.46   0.647    -.7829392    1.260167
          5  |   .2694915   .5212722     0.52   0.605    -.7521832    1.291166
          6  |   .2261645   .5197354     0.44   0.663    -.7924981    1.244827
          7  |   .3658631   .5231702     0.70   0.484    -.6595316    1.391258
          8  |   .3664879   .5215712     0.70   0.482    -.6557729    1.388749
          9  |   .4055622   .5231019     0.78   0.438    -.6196986    1.430823
         10  |   .2264407    .521467     0.43   0.664    -.7956158    1.248497
         11  |   .3330551   .5217416     0.64   0.523    -.6895397     1.35565
         12  |   .3556389   .5220248     0.68   0.496    -.6675109    1.378789
         13  |   .3657815   .5220119     0.70   0.483     -.657343    1.388906
         14  |   .2951074   .5214218     0.57   0.571    -.7268606    1.317075
         15  |   .3516803   .5224472     0.67   0.501    -.6722975    1.375658
         16  |   .2812263   .5209429     0.54   0.589     -.739803    1.302256
         17  |   .2075844   .5365908     0.39   0.699    -.8441141    1.259283
         18  |   .2717642   .5263369     0.52   0.606    -.7598372    1.303366
             |
       dsize |
          1  |   .0435032    .016287     2.67   0.008     .0115813    .0754252
          2  |   .1331091   .0164062     8.11   0.000     .1009536    .1652645
             |
  initialemp |   .0219527   .0006112    35.92   0.000     .0207548    .0231506
       _cons |   5.381861   .0747949    71.95   0.000     5.235265    5.528456
-------------+----------------------------------------------------------------
snd1_lnvar   |
       _cons |  -1.199062   .0234041   -51.23   0.000    -1.244933   -1.153191
------------------------------------------------------------------------------

 ( 1)  [fst1_mean]_cons - [snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0268751   .0164898     1.63   0.103    -.0054443    .0591945
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst1 snd1
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp])*`X'
  4.         }
  5. end

. emprtn

 ( 1)  2*[fst1_mean]_cons - 2*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0537502   .0329796     1.63   0.103    -.0108885     .118389
------------------------------------------------------------------------------

 ( 1)  5*[fst1_mean]_cons - 5*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1343756   .0824489     1.63   0.103    -.0272213    .2959725
------------------------------------------------------------------------------

 ( 1)  10*[fst1_mean]_cons - 10*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2687512   .1648979     1.63   0.103    -.0544426    .5919451
------------------------------------------------------------------------------

 ( 1)  15*[fst1_mean]_cons - 15*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4031268   .2473468     1.63   0.103     -.081664    .8879176
------------------------------------------------------------------------------

 ( 1)  20*[fst1_mean]_cons - 20*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5375024   .3297957     1.63   0.103    -.1088853     1.18389
------------------------------------------------------------------------------

 ( 1)  25*[fst1_mean]_cons - 25*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .671878   .4122446     1.63   0.103    -.1361066    1.479863
------------------------------------------------------------------------------

. 
. ** qadratic
. capture program drop coef

. program coef, rclass
  1.         suest fst2 snd2
  2.         lincom [fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst2, snd2

                                                Number of obs     =      8,794

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst2_mean    |
       dyear |
       2006  |  -.1033253   .0277795    -3.72   0.000    -.1577721   -.0488785
       2007  |  -.0737551   .0264447    -2.79   0.005    -.1255856   -.0219245
       2008  |   -.086791   .0243276    -3.57   0.000    -.1344723   -.0391098
       2009  |  -.0644686   .0239533    -2.69   0.007    -.1114163   -.0175209
       2010  |  -.1184624   .0223906    -5.29   0.000    -.1623471   -.0745776
       2011  |  -.0740461   .0222775    -3.32   0.001    -.1177093    -.030383
       2012  |  -.0683342    .020936    -3.26   0.001    -.1093681   -.0273004
       2013  |  -.1011092   .0218628    -4.62   0.000    -.1439594    -.058259
       2014  |  -.0597932   .0220184    -2.72   0.007    -.1029485   -.0166379
             |
  emptendif2 |   -.000031   .0002438    -0.13   0.899    -.0005089    .0004469
  empexpdif2 |  -.0001026    .000254    -0.40   0.686    -.0006005    .0003953
       _cons |   .0546642   .0207019     2.64   0.008     .0140892    .0952392
-------------+----------------------------------------------------------------
fst2_lnvar   |
       _cons |  -1.908132   .0487704   -39.12   0.000     -2.00372   -1.812544
-------------+----------------------------------------------------------------
snd2_mean    |
        year |
       2005  |   .1005968   .0333399     3.02   0.003     .0352517    .1659418
       2006  |   .0715877   .0328215     2.18   0.029     .0072587    .1359167
       2007  |   .0332095   .0303413     1.09   0.274    -.0262584    .0926773
       2008  |   .0271847   .0298007     0.91   0.362    -.0312235     .085593
       2009  |   .0595195   .0275502     2.16   0.031     .0055221    .1135168
       2010  |    .017776    .027431     0.65   0.517    -.0359879    .0715398
       2011  |   .0133912    .027666     0.48   0.628    -.0408331    .0676156
       2012  |  -.0015026   .0276966    -0.05   0.957    -.0557869    .0527818
       2013  |  -.0258424   .0291709    -0.89   0.376    -.0830164    .0313316
       2014  |   .0041424    .028944     0.14   0.886    -.0525868    .0608715
             |
  1.dmarital |  -.0136782   .0167758    -0.82   0.415    -.0465581    .0192017
             |
   schooling |
         12  |   .3304869   .0349931     9.44   0.000     .2619017    .3990722
         14  |   .4496378   .0388379    11.58   0.000     .3735169    .5257586
         16  |   .6347876    .036635    17.33   0.000     .5629843    .7065909
             |
  1.dregular |   .3546015   .0234171    15.14   0.000     .3087048    .4004982
    1.dunion |   .0244528   .0148853     1.64   0.100    -.0047219    .0536274
             |
         occ |
          2  |   .0149493   .5102254     0.03   0.977    -.9850742    1.014973
          3  |   .0246852   .5083805     0.05   0.961    -.9717224    1.021093
          4  |  -.1024148   .5107333    -0.20   0.841    -1.103434     .898604
          5  |   .0630091   .5102817     0.12   0.902    -.9371246    1.063143
          6  |   .0097932   .5102661     0.02   0.985    -.9903099    1.009896
          7  |   .0072969   .5108446     0.01   0.989    -.9939402    1.008534
          8  |   .0613238    .510558     0.12   0.904    -.9393514    1.061999
          9  |   .1976934   .5106702     0.39   0.699    -.8032018    1.198589
         10  |   .1690311   .5105534     0.33   0.741    -.8316351    1.169697
         11  |  -.1470672   .5111411    -0.29   0.774    -1.148885     .854751
         12  |   .0098234   .5150091     0.02   0.985    -.9995759    1.019223
             |
         ind |
          2  |  -.1114883   .3168894    -0.35   0.725    -.7325801    .5096034
          3  |   .5930136   .5374639     1.10   0.270    -.4603964    1.646424
          4  |   .2488834   .5135292     0.48   0.628    -.7576153    1.255382
          5  |   .2788305   .5135956     0.54   0.587    -.7277984    1.285459
          6  |   .2350621   .5120855     0.46   0.646    -.7686071    1.238731
          7  |   .3721988   .5155425     0.72   0.470    -.6382459    1.382644
          8  |   .3745244   .5139226     0.73   0.466    -.6327454    1.381794
          9  |    .413789   .5154664     0.80   0.422    -.5965065    1.424084
         10  |   .2336086   .5137944     0.45   0.649    -.7734099    1.240627
         11  |   .3418583   .5140856     0.66   0.506     -.665731    1.349448
         12  |   .3673356   .5143483     0.71   0.475    -.6407687     1.37544
         13  |   .3795335   .5143457     0.74   0.461    -.6285655    1.387633
         14  |    .302912   .5137588     0.59   0.555    -.7040368    1.309861
         15  |   .3621416    .514798     0.70   0.482     -.646844    1.371127
         16  |   .2904316   .5132752     0.57   0.572    -.7155694    1.296433
         17  |   .2219864   .5289203     0.42   0.675    -.8146784    1.258651
         18  |   .2830957   .5186546     0.55   0.585    -.7334486     1.29964
             |
       dsize |
          1  |   .0448574    .016216     2.77   0.006     .0130746    .0766402
          2  |   .1347877   .0163318     8.25   0.000     .1027779    .1667974
             |
  initialemp |   .0269986    .000606    44.55   0.000     .0258108    .0281864
       _cons |   5.365917   .0744294    72.09   0.000     5.220038    5.511796
-------------+----------------------------------------------------------------
snd2_lnvar   |
       _cons |  -1.209612   .0235416   -51.38   0.000    -1.255753   -1.163472
------------------------------------------------------------------------------

 ( 1)  [fst2_mean]_cons - [snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0276656   .0207148     1.34   0.182    -.0129348    .0682659
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst2 snd2
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp])*`X' ///
>                                 +[fst2_mean]_b[emptendif2]*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst2_mean]emptendif2 + 2*[fst2_mean]_cons - 2*[snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0552071   .0412965     1.34   0.181    -.0257325    .1361468
------------------------------------------------------------------------------

 ( 1)  25*[fst2_mean]emptendif2 + 5*[fst2_mean]_cons - 5*[snd2_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1375527   .1028483     1.34   0.181    -.0640263    .3391318
------------------------------------------------------------------------------

 ( 1)  100*[fst2_mean]emptendif2 + 10*[fst2_mean]_cons - 10*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2735552   .2049611     1.33   0.182    -.1281611    .6752715
------------------------------------------------------------------------------

 ( 1)  225*[fst2_mean]emptendif2 + 15*[fst2_mean]_cons - 15*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4080072   .3074239     1.33   0.184    -.1945326    1.010547
------------------------------------------------------------------------------

 ( 1)  400*[fst2_mean]emptendif2 + 20*[fst2_mean]_cons - 20*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .540909    .411323     1.32   0.188    -.2652693    1.347087
------------------------------------------------------------------------------

 ( 1)  625*[fst2_mean]emptendif2 + 25*[fst2_mean]_cons - 25*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6722604   .5177255     1.30   0.194    -.3424629    1.686984
------------------------------------------------------------------------------

. 
. ** cubic
. capture program drop coef

. program coef, rclass
  1.         suest fst3 snd3
  2.         lincom [fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst3, snd3

                                                Number of obs     =      8,794

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst3_mean    |
       dyear |
       2006  |  -.1033307   .0278025    -3.72   0.000    -.1578226   -.0488388
       2007  |  -.0739304   .0264985    -2.79   0.005    -.1258665   -.0219943
       2008  |  -.0864695   .0243052    -3.56   0.000    -.1341068   -.0388323
       2009  |  -.0644581   .0239925    -2.69   0.007    -.1114825   -.0174336
       2010  |  -.1186518   .0224028    -5.30   0.000    -.1625604   -.0747431
       2011  |  -.0744467    .022314    -3.34   0.001    -.1181813   -.0307121
       2012  |  -.0688198   .0209683    -3.28   0.001     -.109917   -.0277227
       2013  |  -.1013594   .0218697    -4.63   0.000    -.1442232   -.0584956
       2014  |  -.0600588   .0220414    -2.72   0.006    -.1032591   -.0168585
             |
  emptendif2 |   .0013557   .0009289     1.46   0.144     -.000465    .0031764
  empexpdif2 |  -.0011235   .0013823    -0.81   0.416    -.0038328    .0015859
  emptendif3 |  -.0000256   .0000163    -1.57   0.116    -.0000576    6.31e-06
  empexpdif3 |    .000015   .0000171     0.88   0.380    -.0000186    .0000486
       _cons |   .0575338   .0344525     1.67   0.095    -.0099918    .1250594
-------------+----------------------------------------------------------------
fst3_lnvar   |
       _cons |  -1.908234    .048702   -39.18   0.000    -2.003688    -1.81278
-------------+----------------------------------------------------------------
snd3_mean    |
        year |
       2005  |   .1009268   .0338494     2.98   0.003     .0345832    .1672704
       2006  |   .0720361   .0331914     2.17   0.030     .0069821    .1370901
       2007  |   .0326192   .0308256     1.06   0.290    -.0277978    .0930363
       2008  |    .025674   .0303036     0.85   0.397      -.03372     .085068
       2009  |   .0570257   .0280249     2.03   0.042      .002098    .1119534
       2010  |   .0140116   .0278853     0.50   0.615    -.0406425    .0686658
       2011  |   .0078104   .0281368     0.28   0.781    -.0473367    .0629574
       2012  |  -.0064122   .0281681    -0.23   0.820    -.0616206    .0487962
       2013  |  -.0305416   .0296286    -1.03   0.303    -.0886126    .0275295
       2014  |   .0009965   .0293408     0.03   0.973    -.0565104    .0585034
             |
  1.dmarital |  -.0237924   .0170878    -1.39   0.164    -.0572839    .0096991
             |
   schooling |
         12  |   .3626797    .036191    10.02   0.000     .2917466    .4336128
         14  |   .4877594    .039974    12.20   0.000     .4094118    .5661071
         16  |   .6769836   .0377605    17.93   0.000     .6029744    .7509929
             |
  1.dregular |   .3642447   .0235878    15.44   0.000     .3180134    .4104759
    1.dunion |    .024137   .0150921     1.60   0.110    -.0054429    .0537169
             |
         occ |
          2  |   .0263761   .5181624     0.05   0.959    -.9892035    1.041956
          3  |   .1163937    .515858     0.23   0.821    -.8946695    1.127457
          4  |  -.0098493   .5181956    -0.02   0.985    -1.025494    1.005795
          5  |   .1350779   .5177313     0.26   0.794    -.8796567    1.149813
          6  |    .094548   .5177258     0.18   0.855     -.920176    1.109272
          7  |   .0986136   .5183044     0.19   0.849    -.9172444    1.114472
          8  |   .1547779   .5180014     0.30   0.765    -.8604861    1.170042
          9  |   .2889365    .518134     0.56   0.577    -.7265875    1.304461
         10  |   .2578125   .5180168     0.50   0.619    -.7574818    1.273107
         11  |  -.0490571   .5186039    -0.09   0.925    -1.065502     .967388
         12  |   .0893472   .5225552     0.17   0.864    -.9348422    1.113537
             |
         ind |
          2  |  -.1555022   .3262331    -0.48   0.634    -.7949073     .483903
          3  |    .555916   .5447957     1.02   0.308     -.511864    1.623696
          4  |   .1824134   .5212442     0.35   0.726    -.8392064    1.204033
          5  |   .2098411   .5213114     0.40   0.687    -.8119104    1.231593
          6  |   .1681153    .519814     0.32   0.746    -.8507015    1.186932
          7  |   .3067712   .5232809     0.59   0.558    -.7188405    1.332383
          8  |   .3060706   .5216446     0.59   0.557     -.716334    1.328475
          9  |   .3562403   .5232562     0.68   0.496     -.669323    1.381804
         10  |   .1658848    .521512     0.32   0.750    -.8562599    1.188029
         11  |   .2743066   .5218075     0.53   0.599    -.7484173    1.297031
         12  |   .3033177   .5220216     0.58   0.561    -.7198259    1.326461
         13  |   .3088573   .5220159     0.59   0.554     -.714275     1.33199
         14  |   .2406183   .5214694     0.46   0.644    -.7814431     1.26268
         15  |   .2989291   .5225461     0.57   0.567    -.7252425    1.323101
         16  |   .2221715   .5210032     0.43   0.670     -.798976    1.243319
         17  |   .1470952   .5374909     0.27   0.784    -.9063677    1.200558
         18  |   .2237987   .5265027     0.43   0.671    -.8081275    1.255725
             |
       dsize |
          1  |   .0407451   .0165138     2.47   0.014     .0083787    .0731115
          2  |   .1277565   .0165946     7.70   0.000     .0952318    .1602813
             |
  initialemp |   .0469683   .0006127    76.66   0.000     .0457675    .0481692
       _cons |   5.227759   .0772402    67.68   0.000     5.076372    5.379147
-------------+----------------------------------------------------------------
snd3_lnvar   |
       _cons |  -1.180852   .0231411   -51.03   0.000    -1.226208   -1.135496
------------------------------------------------------------------------------

 ( 1)  [fst3_mean]_cons - [snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0105655   .0344739     0.31   0.759    -.0570021     .078133
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst3 snd3
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp])*`X' ///
>                                 +[fst3_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst3_mean]_b[emptendif3]*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst3_mean]emptendif2 + 8*[fst3_mean]emptendif3 + 2*[fst3_mean]_cons -
       2*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0263484   .0687825     0.38   0.702    -.1084628    .1611597
------------------------------------------------------------------------------

 ( 1)  25*[fst3_mean]emptendif2 + 125*[fst3_mean]emptendif3 + 5*[fst3_mean]_cons
       - 5*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .083514   .1721985     0.48   0.628     -.253989    .4210169
------------------------------------------------------------------------------

 ( 1)  100*[fst3_mean]emptendif2 + 1000*[fst3_mean]emptendif3 +
       10*[fst3_mean]_cons - 10*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2155821   .3483457     0.62   0.536    -.4671628     .898327
------------------------------------------------------------------------------

 ( 1)  225*[fst3_mean]emptendif2 + 3375*[fst3_mean]emptendif3 +
       15*[fst3_mean]_cons - 15*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3769759   .5313079     0.71   0.478    -.6643683     1.41832
------------------------------------------------------------------------------

 ( 1)  400*[fst3_mean]emptendif2 + 8000*[fst3_mean]emptendif3 +
       20*[fst3_mean]_cons - 20*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5484669   .7204679     0.76   0.446    -.8636241    1.960558
------------------------------------------------------------------------------

 ( 1)  625*[fst3_mean]emptendif2 + 15625*[fst3_mean]emptendif3 +
       25*[fst3_mean]_cons - 25*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7108265   .9133516     0.78   0.436     -1.07931    2.500963
------------------------------------------------------------------------------

. 
. ** quartic
. capture program drop coef

. program coef, rclass
  1.         suest fst4 snd4
  2.         lincom [fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst4, snd4

                                                Number of obs     =      8,794

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst4_mean    |
       dyear |
       2006  |  -.1026296   .0277882    -3.69   0.000    -.1570934   -.0481657
       2007  |  -.0721948   .0264137    -2.73   0.006    -.1239646   -.0204249
       2008  |  -.0860433   .0243205    -3.54   0.000    -.1337106   -.0383761
       2009  |   -.063254   .0240028    -2.64   0.008    -.1102986   -.0162095
       2010  |  -.1182534   .0224126    -5.28   0.000    -.1621813   -.0743256
       2011  |  -.0740585   .0223692    -3.31   0.001    -.1179013   -.0302156
       2012  |  -.0677656   .0210221    -3.22   0.001    -.1089681    -.026563
       2013  |  -.0998719   .0219411    -4.55   0.000    -.1428756   -.0568682
       2014  |  -.0582183    .022093    -2.64   0.008    -.1015198   -.0149167
             |
  emptendif2 |  -.0018409   .0021182    -0.87   0.385    -.0059924    .0023107
  empexpdif2 |  -.0046526   .0041641    -1.12   0.264    -.0128141    .0035088
  emptendif3 |   .0001194   .0000848     1.41   0.159    -.0000469    .0002857
  empexpdif3 |    .000109   .0001138     0.96   0.338    -.0001141    .0003321
  emptendif4 |  -1.88e-06   1.06e-06    -1.78   0.075    -3.95e-06    1.87e-07
  empexpdif4 |  -8.51e-07   1.07e-06    -0.79   0.427    -2.95e-06    1.25e-06
       _cons |   .1250464    .061245     2.04   0.041     .0050084    .2450843
-------------+----------------------------------------------------------------
fst4_lnvar   |
       _cons |  -1.908849   .0486938   -39.20   0.000    -2.004288   -1.813411
-------------+----------------------------------------------------------------
snd4_mean    |
        year |
       2005  |   .1008055    .033852     2.98   0.003     .0344567    .1671542
       2006  |   .0751184   .0331602     2.27   0.023     .0101257    .1401111
       2007  |   .0352445   .0308053     1.14   0.253    -.0251327    .0956217
       2008  |   .0242032   .0304235     0.80   0.426    -.0354258    .0838322
       2009  |   .0588655   .0280358     2.10   0.036     .0039164    .1138146
       2010  |   .0171868   .0279255     0.62   0.538    -.0375462    .0719198
       2011  |     .01102   .0281402     0.39   0.695    -.0441337    .0661738
       2012  |  -.0032963   .0281298    -0.12   0.907    -.0584298    .0518371
       2013  |   -.025819   .0295991    -0.87   0.383    -.0838322    .0321942
       2014  |   .0067203   .0292834     0.23   0.818    -.0506741    .0641146
             |
  1.dmarital |  -.0181891   .0169207    -1.07   0.282     -.051353    .0149748
             |
   schooling |
         12  |   .3674475   .0363057    10.12   0.000     .2962896    .4386054
         14  |   .4883753    .040061    12.19   0.000     .4098571    .5668935
         16  |    .679124   .0378796    17.93   0.000     .6048814    .7533666
             |
  1.dregular |   .3717881   .0233851    15.90   0.000     .3259542     .417622
    1.dunion |   .0213278   .0150649     1.42   0.157     -.008199    .0508545
             |
         occ |
          2  |   .1561762   .5229113     0.30   0.765    -.8687111    1.181063
          3  |    .180037   .5211065     0.35   0.730     -.841313    1.201387
          4  |   .0561674   .5234566     0.11   0.915    -.9697887    1.082123
          5  |   .2003795   .5230418     0.38   0.702    -.8247636    1.225523
          6  |   .1621486   .5230199     0.31   0.757    -.8629516    1.187249
          7  |   .1610473   .5236061     0.31   0.758    -.8652018    1.187296
          8  |   .2165477   .5233233     0.41   0.679     -.809147    1.242242
          9  |   .3549923   .5234182     0.68   0.498    -.6708886    1.380873
         10  |   .3230083    .523316     0.62   0.537    -.7026721    1.348689
         11  |   .0195929   .5238944     0.04   0.970    -1.007221    1.046407
         12  |   .1564218   .5277118     0.30   0.767    -.8778743    1.190718
             |
         ind |
          2  |  -.2113527   .3267263    -0.65   0.518    -.8517245    .4290191
          3  |   .4401487   .5497264     0.80   0.423    -.6372953    1.517593
          4  |     .09155   .5264679     0.17   0.862    -.9403082    1.123408
          5  |   .1168462   .5265353     0.22   0.824     -.915144    1.148836
          6  |   .0725386   .5249991     0.14   0.890    -.9564407    1.101518
          7  |   .2058383   .5283704     0.39   0.697    -.8297486    1.241425
          8  |   .2085053    .526855     0.40   0.692    -.8241115    1.241122
          9  |   .2589953   .5284322     0.49   0.624    -.7767128    1.294703
         10  |   .0689668   .5267317     0.13   0.896    -.9634085    1.101342
         11  |   .1791045   .5270334     0.34   0.734     -.853862    1.212071
         12  |   .1954296   .5272153     0.37   0.711    -.8378935    1.228753
         13  |   .2102056   .5272353     0.40   0.690    -.8231567    1.243568
         14  |   .1465142   .5266492     0.28   0.781    -.8856992    1.178728
         15  |   .1927236   .5277323     0.37   0.715    -.8416127     1.22706
         16  |   .1281272   .5262063     0.24   0.808    -.9032182    1.159473
         17  |   .0319558   .5430479     0.06   0.953    -1.032398     1.09631
         18  |   .1192527   .5317005     0.22   0.823    -.9228611    1.161366
             |
       dsize |
          1  |   .0421432   .0164001     2.57   0.010     .0099995    .0742869
          2  |   .1301889   .0165559     7.86   0.000       .09774    .1626379
             |
  initialemp |   .0969973   .0006118   158.54   0.000     .0957982    .0981965
       _cons |   5.054454   .0771029    65.55   0.000     4.903335    5.205573
-------------+----------------------------------------------------------------
snd4_lnvar   |
       _cons |  -1.183973   .0231113   -51.23   0.000     -1.22927   -1.138676
------------------------------------------------------------------------------

 ( 1)  [fst4_mean]_cons - [snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .028049   .0612467     0.46   0.647    -.0919923    .1480903
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst4 snd4
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp])*`X' ///
>                                 +[fst4_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif3]*`X'*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif4]*`X'*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst4_mean]emptendif2 + 8*[fst4_mean]emptendif3 +
       16*[fst4_mean]emptendif4 + 2*[fst4_mean]_cons - 2*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |     .04966   .1216243     0.41   0.683    -.1887193    .2880393
------------------------------------------------------------------------------

 ( 1)  25*[fst4_mean]emptendif2 + 125*[fst4_mean]emptendif3 +
       625*[fst4_mean]emptendif4 + 5*[fst4_mean]_cons - 5*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1079771   .3033357     0.36   0.722      -.48655    .7025042
------------------------------------------------------------------------------

 ( 1)  100*[fst4_mean]emptendif2 + 1000*[fst4_mean]emptendif3 +
       10000*[fst4_mean]emptendif4 + 10*[fst4_mean]_cons -
       10*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1970234   .6107716     0.32   0.747    -1.000067    1.394114
------------------------------------------------------------------------------

 ( 1)  225*[fst4_mean]emptendif2 + 3375*[fst4_mean]emptendif3 +
       50625*[fst4_mean]emptendif4 + 15*[fst4_mean]_cons -
       15*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3143758    .924884     0.34   0.734    -1.498364    2.127115
------------------------------------------------------------------------------

 ( 1)  400*[fst4_mean]emptendif2 + 8000*[fst4_mean]emptendif3 +
       160000*[fst4_mean]emptendif4 + 20*[fst4_mean]_cons -
       20*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4790439   1.242447     0.39   0.700    -1.956107    2.914194
------------------------------------------------------------------------------

 ( 1)  625*[fst4_mean]emptendif2 + 15625*[fst4_mean]emptendif3 +
       390625*[fst4_mean]emptendif4 + 25*[fst4_mean]_cons -
       25*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6818095   1.560441     0.44   0.662    -2.376598    3.740217
------------------------------------------------------------------------------

. 
end of do-file
Year Dummy Type: Dm2

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd $Inputfd

. 
. qui {

. 
end of do-file

. qui{

. 
. 
. * estimation
. forvalues i=1/4 {
  2.         **** 1st step
.         qui $FstReg ///
>                                 `contrl`i'' ///
>                                 if fst==1
  3.         est sto fst`i'
  4.         gen emptenB`i'=`LHSterm`i'' ///
>                                                                 $DmYear
  5.         gen intwemp`i'=realwage-emptenB`i'
  6.         
.         **** 2nd step
.         qui reg intwemp`i' ///
>                                 $SndReg
  7.         est sto snd`i'
  8. }
(1,076 missing values generated)
(2,498 missing values generated)
(1,157 missing values generated)
(2,567 missing values generated)
(1,157 missing values generated)
(2,567 missing values generated)
(1,157 missing values generated)
(2,567 missing values generated)

. 
. * calc. return
. ** linear
. capture program drop coef

. program coef, rclass
  1.         suest fst1 snd1
  2.         lincom [fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst1, snd1

                                                Number of obs     =      8,797

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst1_mean    |
       _cons |  -.0303238   .0051634    -5.87   0.000    -.0404439   -.0202036
-------------+----------------------------------------------------------------
fst1_lnvar   |
       _cons |  -1.904936   .0489449   -38.92   0.000    -2.000866   -1.809005
-------------+----------------------------------------------------------------
snd1_mean    |
        year |
       2005  |    .102239   .0376598     2.71   0.007     .0284271    .1760508
       2006  |   .1017003   .0372374     2.73   0.006     .0287164    .1746842
       2007  |   .1056441   .0341507     3.09   0.002       .03871    .1725782
       2008  |   .1038542   .0349501     2.97   0.003     .0353533    .1723552
       2009  |   .1346568   .0311834     4.32   0.000     .0735385    .1957752
       2010  |   .1062951   .0318624     3.34   0.001      .043846    .1687443
       2011  |   .1376761   .0310695     4.43   0.000     .0767809    .1985713
       2012  |   .1473861   .0309638     4.76   0.000     .0866982    .2080741
       2013  |   .1630845   .0322076     5.06   0.000     .0999589    .2262101
       2014  |   .2024487    .032063     6.31   0.000     .1396065     .265291
             |
  1.dmarital |   .3634895   .0172364    21.09   0.000     .3297067    .3972722
             |
   schooling |
         12  |   -.141668   .0310949    -4.56   0.000    -.2026128   -.0807232
         14  |  -.2842957    .036708    -7.74   0.000    -.3562421   -.2123494
         16  |  -.2287111   .0331938    -6.89   0.000    -.2937698   -.1636523
             |
  1.dregular |   .2059396   .0219052     9.40   0.000     .1630062     .248873
    1.dunion |   .0514131   .0159512     3.22   0.001     .0201494    .0826768
             |
         occ |
          2  |   .0679193   .4792717     0.14   0.887    -.8714361    1.007275
          3  |  -.4846158   .3072924    -1.58   0.115    -1.086898    .1176663
          4  |  -.5448762   .3093233    -1.76   0.078    -1.151139    .0613863
          5  |   .1561583   .3088261     0.51   0.613    -.4491297    .7614463
          6  |  -.2979417   .3086139    -0.97   0.334    -.9028138    .3069304
          7  |  -.5789087   .3094319    -1.87   0.061    -1.185384    .0275668
          8  |  -.5047944   .3083488    -1.64   0.102    -1.109147    .0995581
          9  |  -.4279965   .3095872    -1.38   0.167    -1.034776    .1787833
         10  |   -.329972   .3087954    -1.07   0.285    -.9351999    .2752559
         11  |  -.6014231    .311303    -1.93   0.053    -1.211566    .0087195
         12  |  -.3674364   .3218023    -1.14   0.254    -.9981572    .2632844
             |
         ind |
          2  |   .1687093    .254503     0.66   0.507    -.3301074     .667526
          3  |   .1164715    .367134     0.32   0.751     -.603098    .8360409
          4  |   .4937921   .3452798     1.43   0.153    -.1829438    1.170528
          5  |   .5931314   .3451861     1.72   0.086     -.083421    1.269684
          6  |   .5121128    .344667     1.49   0.137    -.1634222    1.187648
          7  |    .333966   .3478288     0.96   0.337     -.347766    1.015698
          8  |   .4776903   .3465152     1.38   0.168     -.201467    1.156848
          9  |   .6379889   .3509251     1.82   0.069    -.0498117     1.32579
         10  |    .446686   .3461784     1.29   0.197    -.2318113    1.125183
         11  |   .5842081   .3464529     1.69   0.092    -.0948271    1.263243
         12  |   .6553239   .3470484     1.89   0.059    -.0248784    1.335526
         13  |   .5710222   .3493047     1.63   0.102    -.1136024    1.255647
         14  |   .3408345   .3460227     0.99   0.325    -.3373576    1.019027
         15  |   .5721152   .3474657     1.65   0.100    -.1089049    1.253135
         16  |   .4983397   .3452165     1.44   0.149    -.1782722    1.174952
         17  |   .3675415   .3840677     0.96   0.339    -.3852173      1.1203
         18  |   .5262854   .3548979     1.48   0.138    -.1693017    1.221873
             |
       dsize |
          1  |   .1143947   .0173242     6.60   0.000       .08044    .1483494
          2  |   .3051127    .017239    17.70   0.000     .2713249    .3389006
             |
  initialemp |  -.0209485   .0005931   -35.32   0.000    -.0221109   -.0197861
       _cons |   7.494845    .162462    46.13   0.000     7.176425    7.813264
-------------+----------------------------------------------------------------
snd1_lnvar   |
       _cons |     -1.089   .0184189   -59.12   0.000    -1.125101     -1.0529
------------------------------------------------------------------------------

 ( 1)  [fst1_mean]_cons - [snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0093753   .0052056    -1.80   0.072     -.019578    .0008275
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst1 snd1
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp])*`X'
  4.         }
  5. end

. emprtn

 ( 1)  2*[fst1_mean]_cons - 2*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0187505   .0104112    -1.80   0.072    -.0391561     .001655
------------------------------------------------------------------------------

 ( 1)  5*[fst1_mean]_cons - 5*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0468763   .0260279    -1.80   0.072    -.0978901    .0041375
------------------------------------------------------------------------------

 ( 1)  10*[fst1_mean]_cons - 10*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0937526   .0520559    -1.80   0.072    -.1957803     .008275
------------------------------------------------------------------------------

 ( 1)  15*[fst1_mean]_cons - 15*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1406289   .0780838    -1.80   0.072    -.2936704    .0124125
------------------------------------------------------------------------------

 ( 1)  20*[fst1_mean]_cons - 20*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1875053   .1041118    -1.80   0.072    -.3915606      .01655
------------------------------------------------------------------------------

 ( 1)  25*[fst1_mean]_cons - 25*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2343816   .1301397    -1.80   0.072    -.4894507    .0206876
------------------------------------------------------------------------------

. 
. ** qadratic
. capture program drop coef

. program coef, rclass
  1.         suest fst2 snd2
  2.         lincom [fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst2, snd2

                                                Number of obs     =      8,794

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst2_mean    |
  emptendif2 |  -.0000211   .0002442    -0.09   0.931    -.0004998    .0004576
  empexpdif2 |  -.0001138   .0002535    -0.45   0.654    -.0006107    .0003831
       _cons |  -.0238583   .0149099    -1.60   0.110    -.0530812    .0053647
-------------+----------------------------------------------------------------
fst2_lnvar   |
       _cons |  -1.904223   .0489736   -38.88   0.000    -2.000209   -1.808236
-------------+----------------------------------------------------------------
snd2_mean    |
        year |
       2005  |   .1013045   .0375346     2.70   0.007     .0277381    .1748709
       2006  |   .0995023   .0371086     2.68   0.007     .0267708    .1722338
       2007  |   .1043644   .0340223     3.07   0.002     .0376819    .1710469
       2008  |    .102328   .0348376     2.94   0.003     .0340476    .1706085
       2009  |   .1333994   .0310536     4.30   0.000     .0725355    .1942632
       2010  |   .1045282   .0317484     3.29   0.001     .0423025    .1667538
       2011  |     .13538   .0309526     4.37   0.000     .0747141    .1960459
       2012  |   .1455464   .0308619     4.72   0.000     .0850583    .2060345
       2013  |   .1605058   .0321242     5.00   0.000     .0975435    .2234681
       2014  |   .2003555   .0319713     6.27   0.000      .137693     .263018
             |
  1.dmarital |   .3579335   .0170938    20.94   0.000     .3244302    .3914369
             |
   schooling |
         12  |  -.1542053   .0312342    -4.94   0.000    -.2154232   -.0929875
         14  |  -.2962162   .0367936    -8.05   0.000    -.3683303   -.2241022
         16  |  -.2414597   .0333043    -7.25   0.000    -.3067349   -.1761845
             |
  1.dregular |    .194396   .0219598     8.85   0.000     .1513555    .2374364
    1.dunion |   .0534777   .0158986     3.36   0.001      .022317    .0846384
             |
         occ |
          2  |   .0637301    .490131     0.13   0.897     -.896909    1.024369
          3  |  -.4996453   .3048375    -1.64   0.101    -1.097116    .0978253
          4  |  -.5573261    .306878    -1.82   0.069    -1.158796    .0441438
          5  |   .1401196   .3063864     0.46   0.647    -.4603867    .7406258
          6  |  -.3129854    .306161    -1.02   0.307    -.9130499    .2870791
          7  |  -.5935236   .3069952    -1.93   0.053    -1.195223    .0081759
          8  |   -.521232   .3059038    -1.70   0.088    -1.120793    .0783285
          9  |  -.4430816   .3071254    -1.44   0.149    -1.045036    .1588732
         10  |  -.3443106    .306339    -1.12   0.261     -.944724    .2561028
         11  |  -.6133175   .3088631    -1.99   0.047    -1.218678   -.0079569
         12  |  -.3844203   .3195016    -1.20   0.229    -1.010632    .2417914
             |
         ind |
          2  |   .1719108   .2520538     0.68   0.495    -.3221055    .6659272
          3  |   .1157627   .3653677     0.32   0.751    -.6003447    .8318702
          4  |    .502278   .3433531     1.46   0.144    -.1706816    1.175238
          5  |   .6000218   .3432557     1.75   0.080    -.0727471    1.272791
          6  |   .5188737   .3427413     1.51   0.130    -.1528869    1.190634
          7  |   .3398232   .3458953     0.98   0.326     -.338119    1.017765
          8  |    .484663   .3445882     1.41   0.160    -.1907175    1.160044
          9  |   .6444373   .3490138     1.85   0.065    -.0396172    1.328492
         10  |   .4519159   .3442601     1.31   0.189    -.2228215    1.126653
         11  |    .590937   .3445177     1.72   0.086    -.0843053    1.266179
         12  |   .6645881   .3451091     1.93   0.054    -.0118133    1.340989
         13  |    .583372   .3474081     1.68   0.093    -.0975353    1.264279
         14  |   .3477832   .3440836     1.01   0.312    -.3266083    1.022175
         15  |   .5807929   .3455265     1.68   0.093    -.0964265    1.258012
         16  |   .5060122   .3432875     1.47   0.140     -.166819    1.178843
         17  |   .3806387   .3817345     1.00   0.319    -.3675471    1.128824
         18  |   .5355583   .3530667     1.52   0.129    -.1564397    1.227556
             |
       dsize |
          1  |   .1155677   .0172769     6.69   0.000     .0817056    .1494298
          2  |   .3059505   .0172114    17.78   0.000     .2722169    .3396842
             |
  initialemp |  -.0151248   .0005934   -25.49   0.000    -.0162878   -.0139618
       _cons |   7.466718   .1629539    45.82   0.000     7.147334    7.786101
-------------+----------------------------------------------------------------
snd2_lnvar   |
       _cons |   -1.09297   .0184586   -59.21   0.000    -1.129148   -1.056792
------------------------------------------------------------------------------

 ( 1)  [fst2_mean]_cons - [snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0087335   .0149343    -0.58   0.559    -.0380041    .0205372
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst2 snd2
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp])*`X' ///
>                                 +[fst2_mean]_b[emptendif2]*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst2_mean]emptendif2 + 2*[fst2_mean]_cons - 2*[snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0175514   .0296408    -0.59   0.554    -.0756462    .0405434
------------------------------------------------------------------------------

 ( 1)  25*[fst2_mean]emptendif2 + 5*[fst2_mean]_cons - 5*[snd2_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0441952   .0733918    -0.60   0.547    -.1880405      .09965
------------------------------------------------------------------------------

 ( 1)  100*[fst2_mean]emptendif2 + 10*[fst2_mean]_cons - 10*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0894463   .1452094    -0.62   0.538    -.3740514    .1951588
------------------------------------------------------------------------------

 ( 1)  225*[fst2_mean]emptendif2 + 15*[fst2_mean]_cons - 15*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1357532   .2169787    -0.63   0.532    -.5610236    .2895173
------------------------------------------------------------------------------

 ( 1)  400*[fst2_mean]emptendif2 + 20*[fst2_mean]_cons - 20*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1831158   .2902492    -0.63   0.528    -.7519939    .3857622
------------------------------------------------------------------------------

 ( 1)  625*[fst2_mean]emptendif2 + 25*[fst2_mean]_cons - 25*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2315344   .3665395    -0.63   0.528    -.9499386    .4868699
------------------------------------------------------------------------------

. 
. ** cubic
. capture program drop coef

. program coef, rclass
  1.         suest fst3 snd3
  2.         lincom [fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst3, snd3

                                                Number of obs     =      8,794

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst3_mean    |
  emptendif2 |   .0013603   .0009295     1.46   0.143    -.0004614     .003182
  empexpdif2 |  -.0011746   .0013855    -0.85   0.397    -.0038901     .001541
  emptendif3 |  -.0000255   .0000163    -1.57   0.117    -.0000574    6.40e-06
  empexpdif3 |   .0000155   .0000172     0.90   0.366    -.0000181    .0000492
       _cons |  -.0202509   .0318156    -0.64   0.524    -.0826084    .0421065
-------------+----------------------------------------------------------------
fst3_lnvar   |
       _cons |  -1.904322   .0489033   -38.94   0.000    -2.000171   -1.808474
-------------+----------------------------------------------------------------
snd3_mean    |
        year |
       2005  |   .1015606   .0371888     2.73   0.006     .0286719    .1744494
       2006  |   .0999362   .0366413     2.73   0.006     .0281205     .171752
       2007  |   .1038681   .0336171     3.09   0.002     .0379798    .1697563
       2008  |   .1009116   .0343628     2.94   0.003     .0335618    .1682614
       2009  |   .1310129   .0306344     4.28   0.000     .0709707    .1910551
       2010  |   .1008809    .031325     3.22   0.001     .0394851    .1622767
       2011  |    .129994   .0305277     4.26   0.000     .0701608    .1898273
       2012  |   .1408819    .030411     4.63   0.000     .0812775    .2004863
       2013  |   .1561823   .0316679     4.93   0.000     .0941144    .2182502
       2014  |   .1976144   .0315042     6.27   0.000     .1358673    .2593615
             |
  1.dmarital |   .3485018   .0167819    20.77   0.000       .31561    .3813937
             |
   schooling |
         12  |   -.123316   .0311357    -3.96   0.000    -.1843408   -.0622912
         14  |  -.2600065   .0365771    -7.11   0.000    -.3316963   -.1883167
         16  |  -.2015034   .0331836    -6.07   0.000     -.266542   -.1364647
             |
  1.dregular |   .2037454   .0220185     9.25   0.000       .16059    .2469009
    1.dunion |   .0533254   .0157115     3.39   0.001     .0225315    .0841193
             |
         occ |
          2  |   .0742633   .4646945     0.16   0.873    -.8365212    .9850478
          3  |  -.4097566   .3151743    -1.30   0.194    -1.027487    .2079736
          4  |   -.466316   .3171741    -1.47   0.142    -1.087966    .1553338
          5  |   .2122944    .316706     0.67   0.503     -.408438    .8330267
          6  |  -.2294028   .3164814    -0.72   0.469    -.8496949    .3908894
          7  |  -.5042399   .3172966    -1.59   0.112     -1.12613    .1176499
          8  |   -.429668   .3162666    -1.36   0.174    -1.049539    .1902032
          9  |   -.354064   .3173925    -1.12   0.265    -.9761419    .2680138
         10  |  -.2572245   .3166631    -0.81   0.417    -.8778728    .3634239
         11  |  -.5167732   .3191618    -1.62   0.105    -1.142319    .1087724
         12  |  -.3062696   .3293558    -0.93   0.352    -.9517951    .3392559
             |
         ind |
          2  |   .1283408   .2530646     0.51   0.612    -.3676567    .6243382
          3  |   .0769626   .3733608     0.21   0.837    -.6548111    .8087363
          4  |   .4363531   .3503164     1.25   0.213    -.2502544    1.122961
          5  |   .5317674   .3502179     1.52   0.129    -.1546471    1.218182
          6  |   .4525976   .3496651     1.29   0.196    -.2327334    1.137929
          7  |   .2741808   .3527353     0.78   0.437    -.4171677    .9655292
          8  |    .416381   .3514739     1.18   0.236    -.2724951    1.105257
          9  |   .5874618   .3557096     1.65   0.099    -.1097163     1.28464
         10  |   .3846045   .3511752     1.10   0.273    -.3036863    1.072895
         11  |   .5239398   .3514162     1.49   0.136    -.1648232    1.212703
         12  |   .6011913   .3519701     1.71   0.088    -.0886575     1.29104
         13  |   .5131394   .3542296     1.45   0.147    -.1811377    1.207417
         14  |   .2854298   .3509818     0.81   0.416    -.4024818    .9733414
         15  |    .518095   .3523854     1.47   0.141    -.1725678    1.208758
         16  |   .4382001   .3502289     1.25   0.211     -.248236    1.124636
         17  |   .3060584   .3861603     0.79   0.428     -.450802    1.062919
         18  |   .4767091   .3598148     1.32   0.185    -.2285149    1.181933
             |
       dsize |
          1  |   .1116662   .0171036     6.53   0.000     .0781437    .1451888
          2  |   .2994182   .0170519    17.56   0.000      .265997    .3328393
             |
  initialemp |   .0056518   .0005923     9.54   0.000     .0044908    .0068127
       _cons |   7.329334   .1579317    46.41   0.000     7.019793    7.638874
-------------+----------------------------------------------------------------
snd3_lnvar   |
       _cons |  -1.110498   .0187458   -59.24   0.000    -1.147239   -1.073757
------------------------------------------------------------------------------

 ( 1)  [fst3_mean]_cons - [snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0259027   .0318305    -0.81   0.416    -.0882894     .036484
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst3 snd3
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp])*`X' ///
>                                 +[fst3_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst3_mean]_b[emptendif3]*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst3_mean]emptendif2 + 8*[fst3_mean]emptendif3 + 2*[fst3_mean]_cons -
       2*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0465684   .0633785    -0.73   0.462    -.1707879    .0776512
------------------------------------------------------------------------------

 ( 1)  25*[fst3_mean]emptendif2 + 125*[fst3_mean]emptendif3 + 5*[fst3_mean]_cons
       - 5*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0986958   .1583549    -0.62   0.533    -.4090658    .2116741
------------------------------------------------------------------------------

 ( 1)  100*[fst3_mean]emptendif2 + 1000*[fst3_mean]emptendif3 +
       10*[fst3_mean]_cons - 10*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1485139   .3200135    -0.46   0.643    -.7757287     .478701
------------------------------------------------------------------------------

 ( 1)  225*[fst3_mean]emptendif2 + 3375*[fst3_mean]emptendif3 +
       15*[fst3_mean]_cons - 15*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1685903   .4884558    -0.35   0.730    -1.125946    .7887656
------------------------------------------------------------------------------

 ( 1)  400*[fst3_mean]emptendif2 + 8000*[fst3_mean]emptendif3 +
       20*[fst3_mean]_cons - 20*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1780613   .6633446    -0.27   0.788    -1.478193     1.12207
------------------------------------------------------------------------------

 ( 1)  625*[fst3_mean]emptendif2 + 15625*[fst3_mean]emptendif3 +
       25*[fst3_mean]_cons - 25*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1960631   .8423012    -0.23   0.816    -1.846943    1.454817
------------------------------------------------------------------------------

. 
. ** quartic
. capture program drop coef

. program coef, rclass
  1.         suest fst4 snd4
  2.         lincom [fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst4, snd4

                                                Number of obs     =      8,794

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst4_mean    |
  emptendif2 |  -.0017271   .0021165    -0.82   0.414    -.0058753    .0024211
  empexpdif2 |  -.0050028   .0041722    -1.20   0.230    -.0131802    .0031746
  emptendif3 |   .0001149   .0000847     1.36   0.175    -.0000511    .0002809
  empexpdif3 |   .0001189   .0001141     1.04   0.297    -.0001047    .0003425
  emptendif4 |  -1.82e-06   1.05e-06    -1.73   0.083    -3.89e-06    2.39e-07
  empexpdif4 |  -9.46e-07   1.07e-06    -0.88   0.378    -3.05e-06    1.16e-06
       _cons |   .0508996   .0602164     0.85   0.398    -.0671224    .1689216
-------------+----------------------------------------------------------------
fst4_lnvar   |
       _cons |  -1.904939   .0488957   -38.96   0.000    -2.000773   -1.809105
-------------+----------------------------------------------------------------
snd4_mean    |
        year |
       2005  |   .1012939   .0371382     2.73   0.006     .0285043    .1740835
       2006  |   .1026026   .0365825     2.80   0.005     .0309023    .1743029
       2007  |   .1056842   .0335289     3.15   0.002     .0399688    .1713995
       2008  |   .0986606   .0342385     2.88   0.004     .0315544    .1657667
       2009  |   .1319888   .0305361     4.32   0.000     .0721392    .1918384
       2010  |   .1030894   .0312639     3.30   0.001     .0418133    .1643654
       2011  |   .1317727   .0304439     4.33   0.000     .0721038    .1914416
       2012  |   .1423237   .0302997     4.70   0.000     .0829373      .20171
       2013  |    .158799   .0315888     5.03   0.000     .0968862    .2207119
       2014  |   .2010722   .0314584     6.39   0.000     .1394148    .2627297
             |
  1.dmarital |   .3497975    .016888    20.71   0.000     .3166976    .3828973
             |
   schooling |
         12  |  -.1118187   .0310787    -3.60   0.000    -.1727318   -.0509056
         14  |   -.249645   .0365433    -6.83   0.000    -.3212685   -.1780215
         16  |  -.1882089   .0331263    -5.68   0.000    -.2531352   -.1232826
             |
  1.dregular |   .2134817   .0219786     9.71   0.000     .1704045    .2565589
    1.dunion |   .0498431   .0157362     3.17   0.002     .0190008    .0806855
             |
         occ |
          2  |   .2032331    .470013     0.43   0.665    -.7179755    1.124442
          3  |  -.3390177   .3130664    -1.08   0.279    -.9526167    .2745812
          4  |  -.3941549   .3151073    -1.25   0.211    -1.011754    .2234439
          5  |   .2779512   .3145921     0.88   0.377     -.338638    .8945404
          6  |  -.1571292   .3143811    -0.50   0.617    -.7733049    .4590465
          7  |   -.433765   .3151961    -1.38   0.169    -1.051538     .184008
          8  |  -.3600491   .3141553    -1.15   0.252    -.9757822    .2556841
          9  |    -.27961    .315296    -0.89   0.375    -.8975788    .3383589
         10  |  -.1851014   .3145668    -0.59   0.556     -.801641    .4314382
         11  |  -.4421656    .317214    -1.39   0.163    -1.063894    .1795624
         12  |  -.2335131   .3273991    -0.71   0.476    -.8752034    .4081773
             |
         ind |
          2  |   .0702762   .2523021     0.28   0.781    -.4242268    .5647791
          3  |  -.0299816   .3728309    -0.08   0.936    -.7607167    .7007536
          4  |   .3434152   .3497131     0.98   0.326    -.3420099     1.02884
          5  |   .4364879   .3496199     1.25   0.212    -.2487545     1.12173
          6  |   .3551283   .3490587     1.02   0.309    -.3290142    1.039271
          7  |   .1752701   .3521558     0.50   0.619    -.5149427    .8654829
          8  |   .3189619   .3508511     0.91   0.363    -.3686936    1.006617
          9  |   .4886825   .3553969     1.38   0.169    -.2078826    1.185248
         10  |   .2865015   .3505625     0.82   0.414    -.4005884    .9735914
         11  |   .4273156   .3508063     1.22   0.223    -.2602521    1.114883
         12  |   .4911548   .3513832     1.40   0.162    -.1975437    1.179853
         13  |   .4129711   .3534792     1.17   0.243    -.2798353    1.105778
         14  |   .1919769   .3504057     0.55   0.584    -.4948057    .8787596
         15  |   .4109262   .3517591     1.17   0.243    -.2785089    1.100361
         16  |   .3426313   .3496424     0.98   0.327    -.3426551    1.027918
         17  |   .1904262   .3861167     0.49   0.622    -.5663486    .9472011
         18  |   .3703516   .3591076     1.03   0.302    -.3334863     1.07419
             |
       dsize |
          1  |   .1120724    .017249     6.50   0.000      .078265    .1458798
          2  |   .2998233   .0171068    17.53   0.000     .2662947     .333352
             |
  initialemp |   .0595415   .0005912   100.72   0.000     .0583828    .0607002
       _cons |   7.118417   .1606526    44.31   0.000     6.803543     7.43329
-------------+----------------------------------------------------------------
snd4_lnvar   |
       _cons |   -1.10583   .0187168   -59.08   0.000    -1.142514   -1.069145
------------------------------------------------------------------------------

 ( 1)  [fst4_mean]_cons - [snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0086419    .060225    -0.14   0.886    -.1266808    .1093969
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst4 snd4
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp])*`X' ///
>                                 +[fst4_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif3]*`X'*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif4]*`X'*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst4_mean]emptendif2 + 8*[fst4_mean]emptendif3 +
       16*[fst4_mean]emptendif4 + 2*[fst4_mean]_cons - 2*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0233022   .1195989    -0.19   0.846    -.2577118    .2111073
------------------------------------------------------------------------------

 ( 1)  25*[fst4_mean]emptendif2 + 125*[fst4_mean]emptendif3 +
       625*[fst4_mean]emptendif4 + 5*[fst4_mean]_cons - 5*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0731645   .2983379    -0.25   0.806    -.6578961    .5115671
------------------------------------------------------------------------------

 ( 1)  100*[fst4_mean]emptendif2 + 1000*[fst4_mean]emptendif3 +
       10000*[fst4_mean]emptendif4 + 10*[fst4_mean]_cons -
       10*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1624713   .6009141    -0.27   0.787    -1.340241    1.015299
------------------------------------------------------------------------------

 ( 1)  225*[fst4_mean]emptendif2 + 3375*[fst4_mean]emptendif3 +
       50625*[fst4_mean]emptendif4 + 15*[fst4_mean]_cons -
       15*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2227975   .9100973    -0.24   0.807    -2.006555     1.56096
------------------------------------------------------------------------------

 ( 1)  400*[fst4_mean]emptendif2 + 8000*[fst4_mean]emptendif3 +
       160000*[fst4_mean]emptendif4 + 20*[fst4_mean]_cons -
       20*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2363916   1.222503    -0.19   0.847    -2.632453     2.15967
------------------------------------------------------------------------------

 ( 1)  625*[fst4_mean]emptendif2 + 15625*[fst4_mean]emptendif3 +
       390625*[fst4_mean]emptendif4 + 25*[fst4_mean]_cons -
       25*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2128729   1.535087    -0.14   0.890    -3.221588    2.795842
------------------------------------------------------------------------------

. 
end of do-file
Year Dummy Type: Det

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd $Inputfd

. 
. qui {

. 
end of do-file

      Source |       SS           df       MS      Number of obs   =     9,904
-------------+----------------------------------   F(10, 9893)     =      2.29
       Model |  7.45171494        10  .745171494   Prob > F        =    0.0111
    Residual |  3217.42046     9,893  .325221921   R-squared       =    0.0023
-------------+----------------------------------   Adj R-squared   =    0.0013
       Total |  3224.87217     9,903  .325645984   Root MSE        =    .57028

------------------------------------------------------------------------------
    realwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        year |
       2005  |   .0900887   .0317075     2.84   0.005     .0279355    .1522419
       2006  |   .0911021   .0331091     2.75   0.006     .0262016    .1560027
       2007  |   .0720265    .030619     2.35   0.019      .012007     .132046
       2008  |   .0718688   .0310787     2.31   0.021     .0109482    .1327894
       2009  |   .1111747   .0273285     4.07   0.000     .0576053     .164744
       2010  |   .0799636   .0277165     2.89   0.004     .0256337    .1342935
       2011  |   .0924639   .0280334     3.30   0.001     .0375127    .1474151
       2012  |   .0686744   .0275276     2.49   0.013     .0147148    .1226341
       2013  |    .073155   .0289099     2.53   0.011     .0164858    .1298242
       2014  |   .1173181   .0284494     4.12   0.000     .0615514    .1730847
             |
       _cons |   7.469356    .022098   338.01   0.000     7.426039    7.512672
------------------------------------------------------------------------------
(1,604 missing values generated)
(9,904 real changes made)

. qui{

. 
. 
. * estimation
. forvalues i=1/4 {
  2.         **** 1st step
.         qui $FstReg ///
>                                 `contrl`i'' ///
>                                 if fst==1
  3.         est sto fst`i'
  4.         gen emptenB`i'=`LHSterm`i'' ///
>                                                                 $DmYear
  5.         gen intwemp`i'=realwage-emptenB`i'
  6.         
.         **** 2nd step
.         qui reg intwemp`i' ///
>                                 $SndReg
  7.         est sto snd`i'
  8. }
(1,076 missing values generated)
(2,498 missing values generated)
(1,157 missing values generated)
(2,567 missing values generated)
(1,157 missing values generated)
(2,567 missing values generated)
(1,157 missing values generated)
(2,567 missing values generated)

. 
. * calc. return
. ** linear
. capture program drop coef

. program coef, rclass
  1.         suest fst1 snd1
  2.         lincom [fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst1, snd1

                                                Number of obs     =      8,797

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst1_mean    |
       _cons |   -.037886   .0051559    -7.35   0.000    -.0479914   -.0277806
-------------+----------------------------------------------------------------
fst1_lnvar   |
       _cons |  -1.907856   .0486495   -39.22   0.000    -2.003207   -1.812505
-------------+----------------------------------------------------------------
snd1_mean    |
        year |
       2005  |   .0122285   .0402674     0.30   0.761    -.0666942    .0911511
       2006  |   .0132947   .0399646     0.33   0.739    -.0650345    .0916239
       2007  |   .0404615    .036737     1.10   0.271    -.0315416    .1124646
       2008  |   .0392191   .0376197     1.04   0.297    -.0345142    .1129524
       2009  |   .0305865   .0335669     0.91   0.362    -.0352034    .0963764
       2010  |   .0346722   .0342542     1.01   0.311    -.0324648    .1018093
       2011  |   .0569403   .0334556     1.70   0.089    -.0086315    .1225121
       2012  |    .092843   .0333284     2.79   0.005     .0275205    .1581656
       2013  |   .1078422   .0346215     3.11   0.002     .0399853    .1756992
       2014  |    .103991   .0345033     3.01   0.003     .0363658    .1716163
             |
  1.dmarital |   .3992162   .0184846    21.60   0.000     .3629871    .4354452
             |
   schooling |
         12  |  -.1881219   .0333956    -5.63   0.000     -.253576   -.1226678
         14  |  -.3558455   .0394083    -9.03   0.000    -.4330844   -.2786067
         16  |  -.3127945    .035632    -8.78   0.000    -.3826319   -.2429572
             |
  1.dregular |   .1905711   .0236775     8.05   0.000      .144164    .2369781
    1.dunion |   .0541877   .0170662     3.18   0.001     .0207386    .0876368
             |
         occ |
          2  |   .0724335   .5047628     0.14   0.886    -.9168833     1.06175
          3  |   -.534889    .304064    -1.76   0.079    -1.130843    .0610655
          4  |  -.5884863    .306313    -1.92   0.055    -1.188849    .0118761
          5  |   .1636873   .3057057     0.54   0.592    -.4354848    .7628594
          6  |  -.3288559   .3054666    -1.08   0.282    -.9275593    .2698476
          7  |  -.6365467   .3064318    -2.08   0.038    -1.237142   -.0359514
          8  |  -.5606644   .3051637    -1.84   0.066    -1.158774    .0374454
          9  |  -.4894744   .3065898    -1.60   0.110    -1.090379    .1114306
         10  |  -.3792071   .3056492    -1.24   0.215    -.9782686    .2198544
         11  |  -.6461448   .3086306    -2.09   0.036     -1.25105     -.04124
         12  |  -.4052072   .3201662    -1.27   0.206    -1.032722    .2223071
             |
         ind |
          2  |   .1960083   .2648034     0.74   0.459    -.3229969    .7150134
          3  |   .0708473   .3715399     0.19   0.849    -.6573574    .7990521
          4  |   .5181721   .3484772     1.49   0.137    -.1648306    1.201175
          5  |   .6240523   .3483328     1.79   0.073    -.0586675    1.306772
          6  |   .5394326   .3478887     1.55   0.121    -.1424168    1.221282
          7  |   .3309183   .3512546     0.94   0.346    -.3575281    1.019365
          8  |   .4883146   .3498268     1.40   0.163    -.1973334    1.173962
          9  |   .6601952   .3546466     1.86   0.063    -.0348994     1.35529
         10  |   .4677284   .3495188     1.34   0.181    -.2173158    1.152773
         11  |   .6082035   .3497608     1.74   0.082    -.0773152    1.293722
         12  |   .6839562   .3505055     1.95   0.051     -.003022    1.370934
         13  |    .590631   .3530917     1.67   0.094     -.101416    1.282678
         14  |   .3452032   .3493041     0.99   0.323    -.3394203    1.029827
         15  |   .5931757   .3508569     1.69   0.091    -.0944911    1.280843
         16  |   .5190829   .3484221     1.49   0.136    -.1638118    1.201978
         17  |   .3828238   .3927852     0.97   0.330    -.3870211    1.152669
         18  |   .5506025   .3592477     1.53   0.125    -.1535099    1.254715
             |
       dsize |
          1  |   .1211678    .018512     6.55   0.000      .084885    .1574506
          2  |   .3215462   .0183578    17.52   0.000     .2855655    .3575268
             |
  initialemp |  -.0250473   .0006287   -39.84   0.000    -.0262795   -.0238152
       _cons |   .2273663    .175815     1.29   0.196    -.1172247    .5719573
-------------+----------------------------------------------------------------
snd1_lnvar   |
       _cons |  -.9598465    .017319   -55.42   0.000    -.9937912   -.9259019
------------------------------------------------------------------------------

 ( 1)  [fst1_mean]_cons - [snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0128387   .0052014    -2.47   0.014    -.0230332   -.0026441
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst1 snd1
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp])*`X'
  4.         }
  5. end

. emprtn

 ( 1)  2*[fst1_mean]_cons - 2*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0256773   .0104028    -2.47   0.014    -.0460664   -.0052883
------------------------------------------------------------------------------

 ( 1)  5*[fst1_mean]_cons - 5*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0641934    .026007    -2.47   0.014    -.1151661   -.0132207
------------------------------------------------------------------------------

 ( 1)  10*[fst1_mean]_cons - 10*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1283867   .0520139    -2.47   0.014    -.2303322   -.0264413
------------------------------------------------------------------------------

 ( 1)  15*[fst1_mean]_cons - 15*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1925801   .0780209    -2.47   0.014    -.3454983    -.039662
------------------------------------------------------------------------------

 ( 1)  20*[fst1_mean]_cons - 20*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2567735   .1040279    -2.47   0.014    -.4606644   -.0528826
------------------------------------------------------------------------------

 ( 1)  25*[fst1_mean]_cons - 25*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.3209669   .1300348    -2.47   0.014    -.5758304   -.0661033
------------------------------------------------------------------------------

. 
. ** qadratic
. capture program drop coef

. program coef, rclass
  1.         suest fst2 snd2
  2.         lincom [fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst2, snd2

                                                Number of obs     =      8,794

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst2_mean    |
  emptendif2 |  -.0000304   .0002442    -0.12   0.901    -.0005091    .0004482
  empexpdif2 |  -.0001097   .0002531    -0.43   0.665    -.0006058    .0003864
       _cons |  -.0313478   .0148795    -2.11   0.035    -.0605111   -.0021844
-------------+----------------------------------------------------------------
fst2_lnvar   |
       _cons |  -1.907116   .0486777   -39.18   0.000    -2.002522   -1.811709
-------------+----------------------------------------------------------------
snd2_mean    |
        year |
       2005  |   .0113411   .0401687     0.28   0.778    -.0673881    .0900703
       2006  |   .0111471   .0398639     0.28   0.780    -.0669848    .0892789
       2007  |   .0392516   .0366399     1.07   0.284    -.0325614    .1110645
       2008  |   .0378124    .037539     1.01   0.314    -.0357628    .1113876
       2009  |   .0293899    .033462     0.88   0.380    -.0361945    .0949743
       2010  |   .0329506    .034163     0.96   0.335    -.0340077    .0999088
       2011  |   .0547132   .0333629     1.64   0.101    -.0106769    .1201032
       2012  |   .0910767   .0332523     2.74   0.006     .0259035      .15625
       2013  |   .1053871   .0345646     3.05   0.002     .0376418    .1731323
       2014  |   .1020512   .0344404     2.96   0.003     .0345491    .1695532
             |
  1.dmarital |   .3939357   .0183405    21.48   0.000     .3579889    .4298825
             |
   schooling |
         12  |   -.200671   .0335897    -5.97   0.000    -.2665056   -.1348363
         14  |  -.3680179   .0395465    -9.31   0.000    -.4455276   -.2905083
         16  |  -.3260005   .0357964    -9.11   0.000    -.3961602   -.2558408
             |
  1.dregular |    .178555   .0237673     7.51   0.000     .1319719    .2251381
    1.dunion |   .0562512   .0170249     3.30   0.001      .022883    .0896193
             |
         occ |
          2  |   .0665759   .5163483     0.13   0.897    -.9454481      1.0786
          3  |  -.5501779   .3026185    -1.82   0.069    -1.143299    .0429435
          4  |  -.6010712   .3048827    -1.97   0.049     -1.19863   -.0035121
          5  |   .1480289    .304282     0.49   0.627    -.4483529    .7444106
          6  |  -.3440294   .3040286    -1.13   0.258    -.9399146    .2518557
          7  |  -.6516089   .3050124    -2.14   0.033    -1.249422   -.0537955
          8  |  -.5775026   .3037394    -1.90   0.057    -1.172821    .0178158
          9  |  -.5050744   .3051395    -1.66   0.098    -1.103137     .092988
         10  |  -.3939187   .3042079    -1.29   0.195    -.9901553    .2023179
         11  |  -.6583541   .3072006    -2.14   0.032    -1.260456   -.0562521
         12  |  -.4223909   .3188499    -1.32   0.185    -1.047325    .2025433
             |
         ind |
          2  |   .2002345   .2626428     0.76   0.446    -.3145359     .715005
          3  |    .071695   .3705893     0.19   0.847    -.6546466    .7980366
          4  |   .5275827   .3474379     1.52   0.129    -.1533831    1.208549
          5  |   .6320923   .3472888     1.82   0.069    -.0485812    1.312766
          6  |    .547218   .3468453     1.58   0.115    -.1325862    1.227022
          7  |    .337574    .350197     0.96   0.335    -.3487996    1.023948
          8  |   .4960844   .3487814     1.42   0.155    -.1875145    1.179683
          9  |   .6675558   .3536036     1.89   0.059    -.0254946    1.360606
         10  |   .4739952   .3484864     1.36   0.174    -.2090256    1.157016
         11  |   .6160359   .3487071     1.77   0.077    -.0674174    1.299489
         12  |   .6945585   .3494505     1.99   0.047     .0096482    1.379469
         13  |   .6039544   .3520843     1.72   0.086    -.0861182    1.294027
         14  |   .3530228   .3482469     1.01   0.311    -.3295286    1.035574
         15  |   .6029198   .3497981     1.72   0.085    -.0826718    1.288511
         16  |   .5275759   .3473778     1.52   0.129     -.153272    1.208424
         17  |   .3970202   .3912653     1.01   0.310    -.3698457    1.163886
         18  |   .5610712   .3583043     1.57   0.117    -.1411924    1.263335
             |
       dsize |
          1  |   .1222772   .0184743     6.62   0.000     .0860683    .1584861
          2  |   .3224749   .0183408    17.58   0.000     .2865277    .3584221
             |
  initialemp |  -.0194448   .0006297   -30.88   0.000    -.0206789   -.0182107
       _cons |   .2001323   .1761983     1.14   0.256      -.14521    .5454745
-------------+----------------------------------------------------------------
snd2_lnvar   |
       _cons |  -.9621977   .0173428   -55.48   0.000    -.9961891   -.9282064
------------------------------------------------------------------------------

 ( 1)  [fst2_mean]_cons - [snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0119029   .0149074    -0.80   0.425    -.0411209     .017315
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst2 snd2
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp])*`X' ///
>                                 +[fst2_mean]_b[emptendif2]*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst2_mean]emptendif2 + 2*[fst2_mean]_cons - 2*[snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0239277   .0295868    -0.81   0.419    -.0819167    .0340614
------------------------------------------------------------------------------

 ( 1)  25*[fst2_mean]emptendif2 + 5*[fst2_mean]_cons - 5*[snd2_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0602758   .0732563    -0.82   0.411    -.2038556     .083304
------------------------------------------------------------------------------

 ( 1)  100*[fst2_mean]emptendif2 + 10*[fst2_mean]_cons - 10*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1220739    .144938    -0.84   0.400    -.4061472    .1619993
------------------------------------------------------------------------------

 ( 1)  225*[fst2_mean]emptendif2 + 15*[fst2_mean]_cons - 15*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1853944   .2165733    -0.86   0.392    -.6098702    .2390815
------------------------------------------------------------------------------

 ( 1)  400*[fst2_mean]emptendif2 + 20*[fst2_mean]_cons - 20*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2502371   .2897141    -0.86   0.388    -.8180663    .3175921
------------------------------------------------------------------------------

 ( 1)  625*[fst2_mean]emptendif2 + 25*[fst2_mean]_cons - 25*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.3166021   .3658812    -0.87   0.387    -1.033716    .4005119
------------------------------------------------------------------------------

. 
. ** cubic
. capture program drop coef

. program coef, rclass
  1.         suest fst3 snd3
  2.         lincom [fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst3, snd3

                                                Number of obs     =      8,794

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst3_mean    |
  emptendif2 |   .0013966   .0009284     1.50   0.133     -.000423    .0032163
  empexpdif2 |  -.0011114   .0013802    -0.81   0.421    -.0038166    .0015938
  emptendif3 |  -.0000264   .0000163    -1.62   0.105    -.0000583    5.50e-06
  empexpdif3 |   .0000149   .0000171     0.87   0.386    -.0000187    .0000484
       _cons |  -.0296228   .0317218    -0.93   0.350    -.0917963    .0325507
-------------+----------------------------------------------------------------
fst3_lnvar   |
       _cons |  -1.907242   .0486071   -39.24   0.000    -2.002511   -1.811974
-------------+----------------------------------------------------------------
snd3_mean    |
        year |
       2005  |   .0117674   .0397383     0.30   0.767    -.0661183     .089653
       2006  |   .0117655   .0393189     0.30   0.765    -.0652982    .0888292
       2007  |    .038907   .0361555     1.08   0.282    -.0319565    .1097704
       2008  |   .0365464   .0369785     0.99   0.323      -.03593    .1090229
       2009  |   .0270921   .0329642     0.82   0.411    -.0375166    .0917007
       2010  |   .0294033   .0336608     0.87   0.382    -.0365706    .0953772
       2011  |   .0493968   .0328561     1.50   0.133    -.0150001    .1137936
       2012  |   .0865211   .0327212     2.64   0.008     .0223888    .1506535
       2013  |   .1011035   .0340247     2.97   0.003     .0344162    .1677907
       2014  |   .0993802   .0338962     2.93   0.003      .032945    .1658155
             |
  1.dmarital |   .3847074    .017983    21.39   0.000     .3494614    .4199534
             |
   schooling |
         12  |  -.1686989   .0333503    -5.06   0.000    -.2340643   -.1033335
         14  |  -.3306319   .0391907    -8.44   0.000    -.4074442   -.2538197
         16  |  -.2847488   .0355421    -8.01   0.000    -.3544101   -.2150875
             |
  1.dregular |   .1879084   .0238177     7.89   0.000     .1412266    .2345902
    1.dunion |    .055895   .0167985     3.33   0.001     .0229707    .0888194
             |
         occ |
          2  |    .079443   .4882411     0.16   0.871    -.8774919    1.036378
          3  |  -.4568283    .312966    -1.46   0.144     -1.07023    .1565739
          4  |   -.506774   .3151826    -1.61   0.108    -1.124521    .1109726
          5  |   .2221898   .3146117     0.71   0.480    -.3944379    .8388175
          6  |  -.2574987    .314358    -0.82   0.413    -.8736291    .3586317
          7  |  -.5588225   .3153142    -1.77   0.076    -1.176827     .059182
          8  |  -.4825923   .3141202    -1.54   0.124    -1.098257     .133072
          9  |   -.412356   .3154059    -1.31   0.191     -1.03054    .2058281
         10  |  -.3036592   .3145413    -0.97   0.334    -.9201489    .3128305
         11  |   -.558643   .3174951    -1.76   0.078    -1.180922    .0636359
         12  |  -.3413697   .3285965    -1.04   0.299     -.985407    .3026676
             |
         ind |
          2  |   .1561235   .2622578     0.60   0.552    -.3578924    .6701393
          3  |   .0332213   .3781643     0.09   0.930     -.707967    .7744096
          4  |   .4601838   .3538154     1.30   0.193    -.2332817    1.153649
          5  |    .562254   .3536655     1.59   0.112    -.1309178    1.255426
          6  |   .4793476   .3531767     1.36   0.175    -.2128659    1.171561
          7  |   .2706248   .3564367     0.76   0.448    -.4279784     .969228
          8  |   .4263289   .3550719     1.20   0.230    -.2695992    1.122257
          9  |   .6091516   .3596665     1.69   0.090    -.0957817    1.314085
         10  |   .4052817   .3548064     1.14   0.253    -.2901261     1.10069
         11  |   .5475026   .3550122     1.54   0.123    -.1483085    1.243314
         12  |    .629837   .3557163     1.77   0.077    -.0673541    1.327028
         13  |   .5321119   .3583088     1.49   0.138    -.1701604    1.234384
         14  |   .2895131   .3545525     0.82   0.414    -.4053971    .9844233
         15  |   .5387252   .3560553     1.51   0.130    -.1591304    1.236581
         16  |   .4582501   .3537283     1.30   0.195    -.2350446    1.151545
         17  |   .3207827   .3947097     0.81   0.416    -.4528341    1.094399
         18  |   .5011474   .3644094     1.38   0.169    -.2130819    1.215377
             |
       dsize |
          1  |   .1181839   .0182522     6.48   0.000     .0824103    .1539575
          2  |   .3155876   .0181375    17.40   0.000     .2800387    .3511364
             |
  initialemp |  -.0000972   .0006279    -0.15   0.877    -.0013278    .0011335
       _cons |    .068372   .1705838     0.40   0.689    -.2659661    .4027101
-------------+----------------------------------------------------------------
snd3_lnvar   |
       _cons |  -.9831653   .0176415   -55.73   0.000    -1.017742   -.9485887
------------------------------------------------------------------------------

 ( 1)  [fst3_mean]_cons - [snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0295256   .0317374    -0.93   0.352    -.0917298    .0326785
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst3 snd3
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp])*`X' ///
>                                 +[fst3_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst3_mean]_b[emptendif3]*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst3_mean]emptendif2 + 8*[fst3_mean]emptendif3 + 2*[fst3_mean]_cons -
       2*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0536761   .0631887    -0.85   0.396    -.1775237    .0701714
------------------------------------------------------------------------------

 ( 1)  25*[fst3_mean]emptendif2 + 125*[fst3_mean]emptendif3 + 5*[fst3_mean]_cons
       - 5*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1160153   .1578684    -0.73   0.462    -.4254317     .193401
------------------------------------------------------------------------------

 ( 1)  100*[fst3_mean]emptendif2 + 1000*[fst3_mean]emptendif3 +
       10*[fst3_mean]_cons - 10*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1820169   .3190048    -0.57   0.568    -.8072547     .443221
------------------------------------------------------------------------------

 ( 1)  225*[fst3_mean]emptendif2 + 3375*[fst3_mean]emptendif3 +
       15*[fst3_mean]_cons - 15*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2178224   .4868936    -0.45   0.655    -1.172116    .7364715
------------------------------------------------------------------------------

 ( 1)  400*[fst3_mean]emptendif2 + 8000*[fst3_mean]emptendif3 +
       20*[fst3_mean]_cons - 20*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2432497   .6611979    -0.37   0.713    -1.539174    1.052674
------------------------------------------------------------------------------

 ( 1)  625*[fst3_mean]emptendif2 + 15625*[fst3_mean]emptendif3 +
       25*[fst3_mean]_cons - 25*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2781165   .8395418    -0.33   0.740    -1.923588    1.367355
------------------------------------------------------------------------------

. 
. ** quartic
. capture program drop coef

. program coef, rclass
  1.         suest fst4 snd4
  2.         lincom [fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst4, snd4

                                                Number of obs     =      8,794

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst4_mean    |
  emptendif2 |  -.0018511   .0021141    -0.88   0.381    -.0059947    .0022924
  empexpdif2 |  -.0044906   .0041576    -1.08   0.280    -.0126394    .0036581
  emptendif3 |   .0001209   .0000847     1.43   0.153     -.000045    .0002868
  empexpdif3 |   .0001043   .0001137     0.92   0.359    -.0001185    .0003271
  emptendif4 |  -1.91e-06   1.05e-06    -1.81   0.070    -3.97e-06    1.54e-07
  empexpdif4 |  -8.06e-07   1.07e-06    -0.75   0.451    -2.90e-06    1.29e-06
       _cons |    .037262   .0600263     0.62   0.535    -.0803873    .1549113
-------------+----------------------------------------------------------------
fst4_lnvar   |
       _cons |  -1.907858   .0486026   -39.25   0.000    -2.003117   -1.812599
-------------+----------------------------------------------------------------
snd4_mean    |
        year |
       2005  |   .0117264   .0396681     0.30   0.768    -.0660216    .0894744
       2006  |   .0146177   .0392421     0.37   0.710    -.0622954    .0915307
       2007  |   .0407318   .0360466     1.13   0.258    -.0299182    .1113819
       2008  |   .0341931    .036824     0.93   0.353    -.0379807    .1063669
       2009  |   .0281097   .0328457     0.86   0.392    -.0362667     .092486
       2010  |   .0315982    .033583     0.94   0.347    -.0342232    .0974196
       2011  |   .0512549   .0327561     1.56   0.118    -.0129458    .1154557
       2012  |   .0879665    .032595     2.70   0.007     .0240814    .1518516
       2013  |   .1036976   .0339348     3.06   0.002     .0371865    .1702086
       2014  |   .1028731   .0338417     3.04   0.002     .0365445    .1692016
             |
  1.dmarital |     .38613   .0181052    21.33   0.000     .3506445    .4216155
             |
   schooling |
         12  |  -.1586178   .0332737    -4.77   0.000    -.2238331   -.0934025
         14  |  -.3216809   .0391392    -8.22   0.000    -.3983924   -.2449694
         16  |  -.2726854   .0354627    -7.69   0.000     -.342191   -.2031798
             |
  1.dregular |   .1973845   .0238008     8.29   0.000     .1507358    .2440332
    1.dunion |   .0528652   .0168157     3.14   0.002     .0199071    .0858233
             |
         occ |
          2  |   .2091659   .4936648     0.42   0.672    -.7583993    1.176731
          3  |  -.3872118   .3095124    -1.25   0.211    -.9938449    .2194213
          4  |  -.4355805   .3117771    -1.40   0.162    -1.046652    .1754914
          5  |    .286329   .3111431     0.92   0.357    -.3235002    .8961583
          6  |  -.1862357   .3109052    -0.60   0.549    -.7955988    .4231273
          7  |  -.4895532   .3118628    -1.57   0.116    -1.100793    .1216867
          8  |  -.4141862   .3106485    -1.33   0.182    -1.023046    .1946737
          9  |  -.3389275   .3119607    -1.09   0.277    -.9503593    .2725042
         10  |  -.2326128   .3110913    -0.75   0.455    -.8423405     .377115
         11  |  -.4845364   .3142332    -1.54   0.123    -1.100422    .1313494
         12  |  -.2698552   .3254034    -0.83   0.407    -.9076342    .3679239
             |
         ind |
          2  |   .0963369   .2615425     0.37   0.713    -.4162769    .6089507
          3  |  -.0787403   .3770142    -0.21   0.835    -.8176746     .660194
          4  |   .3657015    .352527     1.04   0.300    -.3252387    1.056642
          5  |   .4645872   .3523828     1.32   0.187    -.2260704    1.155245
          6  |   .3795598   .3518927     1.08   0.281    -.3101373    1.069257
          7  |   .1690503   .3551956     0.48   0.634    -.5271203    .8652209
          8  |   .3265624   .3537648     0.92   0.356    -.3668038    1.019929
          9  |   .5084493   .3587241     1.42   0.156     -.194637    1.211536
         10  |     .30497   .3535098     0.86   0.388    -.3878965    .9978364
         11  |   .4484541   .3537175     1.27   0.205    -.2448195    1.141728
         12  |   .5175675   .3544495     1.46   0.144    -.1771407    1.212276
         13  |   .4303383   .3568615     1.21   0.228    -.2690973    1.129774
         14  |   .1940884    .353303     0.55   0.583    -.4983727    .8865496
         15  |   .4289357   .3547443     1.21   0.227    -.2663504    1.124222
         16  |   .3609908   .3524623     1.02   0.306    -.3298226    1.051804
         17  |   .2027724   .3940541     0.51   0.607    -.5695594    .9751042
         18  |    .392846   .3630228     1.08   0.279    -.3186656    1.104358
             |
       dsize |
          1  |   .1188278   .0184066     6.46   0.000     .0827514    .1549041
          2  |   .3160335   .0181902    17.37   0.000     .2803813    .3516857
             |
  initialemp |   .0486156   .0006266    77.59   0.000     .0473875    .0498437
       _cons |  -.1219061   .1740873    -0.70   0.484    -.4631108    .2192987
-------------+----------------------------------------------------------------
snd4_lnvar   |
       _cons |   -.979295   .0176032   -55.63   0.000    -1.013797   -.9447933
------------------------------------------------------------------------------

 ( 1)  [fst4_mean]_cons - [snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0113536   .0600365    -0.19   0.850    -.1290229    .1063157
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst4 snd4
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp])*`X' ///
>                                 +[fst4_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif3]*`X'*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif4]*`X'*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst4_mean]emptendif2 + 8*[fst4_mean]emptendif3 +
       16*[fst4_mean]emptendif4 + 2*[fst4_mean]_cons - 2*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.029175   .1192185    -0.24   0.807     -.262839     .204489
------------------------------------------------------------------------------

 ( 1)  25*[fst4_mean]emptendif2 + 125*[fst4_mean]emptendif3 +
       625*[fst4_mean]emptendif4 + 5*[fst4_mean]_cons - 5*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0891263   .2973764    -0.30   0.764    -.6719733    .4937207
------------------------------------------------------------------------------

 ( 1)  100*[fst4_mean]emptendif2 + 1000*[fst4_mean]emptendif3 +
       10000*[fst4_mean]emptendif4 + 10*[fst4_mean]_cons -
       10*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1968379   .5989606    -0.33   0.742    -1.370779    .9771034
------------------------------------------------------------------------------

 ( 1)  225*[fst4_mean]emptendif2 + 3375*[fst4_mean]emptendif3 +
       50625*[fst4_mean]emptendif4 + 15*[fst4_mean]_cons -
       15*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.275424    .907127    -0.30   0.761     -2.05336    1.502512
------------------------------------------------------------------------------

 ( 1)  400*[fst4_mean]emptendif2 + 8000*[fst4_mean]emptendif3 +
       160000*[fst4_mean]emptendif4 + 20*[fst4_mean]_cons -
       20*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.3058225   1.218503    -0.25   0.802    -2.694044    2.082399
------------------------------------------------------------------------------

 ( 1)  625*[fst4_mean]emptendif2 + 15625*[fst4_mean]emptendif3 +
       390625*[fst4_mean]emptendif4 + 25*[fst4_mean]_cons -
       25*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2976204   1.530067    -0.19   0.846    -3.296496    2.701255
------------------------------------------------------------------------------

. 
end of do-file

. 
end of do-file

. sum hatwage

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hatwage |      9,904    3.26e-10    .5699943  -2.014663    3.21941

. plot intwemp2 emptenure

 3.64524 +  
         |                                             *
         |                                   *    *             *
         |   *             *                   *      *             *
         |   *                        *       *  **    *         *
         |               *     *  *** * * ** **          ** **   **  **
    i    | **  *   **  **   * *** *** ***  * **  *** *** ** *** *** *** *  *
    n    | **  *** **  *** ** ***  ** *** ** *** *** *** ** *** *** *** **
    t    | **  *** *** *** ** *** *** *** ** *** *** *** ** *** *** *** **
    w    | *** *** *** *** ** *** *** *** ** *** *** *** ** *** *** *** *
    e    | *** *** *** *** ** *** *** *** ** *** *** *** ** *** *** *** **
    m    | *** *** *** *** ** *** *** *** ** *** *** *** ** *** *** *** *
    p    | *** *** *** *** ** *** *** *** ** *** *** *** **      ** *
    2    | *** *** *** *** ** *** *** *** ** *** ***  **      *         *
         | *** *** *** *** ** *** *** *** ** *** ***  *   *
         | *** *** *** *** ** *** *** *** ** *   **    *      *
         | *** *** *** *** *    * **  ***  * * * *
         | *** *** *** *** **  **     *   *       *
         | *** *** ***   *    *   * * **
         | ***   * *** *
 -1.9437 + ***
          +----------------------------------------------------------------+
                0                  Tenure months                        47


. do "C:\Users\AYAKAN~1\AppData\Local\Temp\STD2e98_000000.tmp"

. ** changing control variables
. qui{

. 
. local charList pred infr all

. foreach eq_i of local charList{
  2.         global SndReg ``eq_i'' ///
>                                                         i. year initialemp
  3.         
.         dis "Controls: `eq_i'"
  4.         do "$Code\ReadData.do"
  5.         
.         do "$Code\EstTopel.do"
  6.         
.         *** output tex all results
.         quietly {
  7.         **** coefficients 
.         esttab fst1 fst2 fst3 fst4 ///
>         using "$Output\topel_`eq_i'.tex", ///
>         se star(* 0.1 ** 0.05 *** 0.01) b(4) ///
>         keep( ///
>                         _cons emptendif2 emptendif3 emptendif4 ///
>                         empexpdif2 empexpdif3 empexpdif4 ///
>                         ) ///
>         order( ///
>                         _cons emptendif2 emptendif3 emptendif4 ///
>                         empexpdif2 empexpdif3 empexpdif4 ///
>                         ) ///
>         coeflabel( ///
>                         _cons "Constant" ///
>                         emptendif2 "Emp.ten.$^{2}\times 100$" ///
>                         emptendif3 "Emp.ten.$^{3}\times 1000$" ///
>                         emptendif4 "Emp.ten.$^{4}\times 10000$" ///
>                         empexpdif2 "Experience$^{2}\times 100$" ///
>                         empexpdif3 "Experience$^{3}\times 1000$" ///
>                         empexpdif4 "Experience$^{4}\times 10000$" ///
>                         ) ///
>         transform( ///
>                         emptendif2 100*@ 100 ///
>                         emptendif3 1000*@ 1000 ///
>                         emptendif4 10000*@ 10000 ///
>                         empexpdif2 100*@ 100 ///
>                         empexpdif3 1000*@ 1000 ///
>                         empexpdif4 10000*@ 10000 ///
>                         ) ///
>         nodep nonote nomtitles ///
>         title("Estimation Results, using the Method of 2SFD Estimation.") ///
>         replace
  8.         }
  9. }
Controls: pred

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd $Inputfd

. 
. qui {

. 
end of do-file

. qui{

. 
. 
. * estimation
. forvalues i=1/4 {
  2.         **** 1st step
.         qui $FstReg ///
>                                 `contrl`i'' ///
>                                 if fst==1
  3.         est sto fst`i'
  4.         gen emptenB`i'=`LHSterm`i'' ///
>                                                                 $DmYear
  5.         gen intwemp`i'=realwage-emptenB`i'
  6.         
.         **** 2nd step
.         qui reg intwemp`i' ///
>                                 $SndReg
  7.         est sto snd`i'
  8. }
(1,076 missing values generated)
(2,498 missing values generated)
(1,157 missing values generated)
(2,567 missing values generated)
(1,157 missing values generated)
(2,567 missing values generated)
(1,157 missing values generated)
(2,567 missing values generated)

. 
. * calc. return
. ** linear
. capture program drop coef

. program coef, rclass
  1.         suest fst1 snd1
  2.         lincom [fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst1, snd1

                                                Number of obs     =      8,940

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst1_mean    |
       _cons |  -.0303238   .0051634    -5.87   0.000    -.0404439   -.0202036
-------------+----------------------------------------------------------------
fst1_lnvar   |
       _cons |  -1.904936   .0489449   -38.92   0.000    -2.000866   -1.809005
-------------+----------------------------------------------------------------
snd1_mean    |
   schooling |
         12  |    -.01491   .0323934    -0.46   0.645       -.0784    .0485799
         14  |  -.1484079   .0384493    -3.86   0.000    -.2237672   -.0730485
         16  |   .0584443    .033669     1.74   0.083    -.0075458    .1244344
             |
        year |
       2005  |    .120595   .0407774     2.96   0.003     .0406727    .2005172
       2006  |   .1172379   .0410342     2.86   0.004     .0368124    .1976634
       2007  |   .1233646   .0378766     3.26   0.001     .0491278    .1976013
       2008  |   .1320327   .0385963     3.42   0.001     .0563853    .2076801
       2009  |   .1357404   .0345155     3.93   0.000     .0680913    .2033895
       2010  |   .1048912   .0352569     2.98   0.003      .035789    .1739934
       2011  |   .1301356   .0347602     3.74   0.000      .062007    .1982643
       2012  |   .1208161     .03418     3.53   0.000     .0538245    .1878078
       2013  |   .1420123   .0354667     4.00   0.000     .0724988    .2115257
       2014  |   .1792838   .0354202     5.06   0.000     .1098614    .2487062
             |
  initialemp |  -.0297338   .0005511   -53.96   0.000    -.0308139   -.0286537
       _cons |   8.187039   .0422166   193.93   0.000     8.104296    8.269782
-------------+----------------------------------------------------------------
snd1_lnvar   |
       _cons |  -.8139053   .0152942   -53.22   0.000    -.8438814   -.7839292
------------------------------------------------------------------------------

 ( 1)  [fst1_mean]_cons - [snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    -.00059    .005211    -0.11   0.910    -.0108033    .0096234
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst1 snd1
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp])*`X'
  4.         }
  5. end

. emprtn

 ( 1)  2*[fst1_mean]_cons - 2*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0011799    .010422    -0.11   0.910    -.0216066    .0192468
------------------------------------------------------------------------------

 ( 1)  5*[fst1_mean]_cons - 5*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0029498   .0260549    -0.11   0.910    -.0540164    .0481169
------------------------------------------------------------------------------

 ( 1)  10*[fst1_mean]_cons - 10*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0058995   .0521098    -0.11   0.910    -.1080328    .0962338
------------------------------------------------------------------------------

 ( 1)  15*[fst1_mean]_cons - 15*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0088493   .0781647    -0.11   0.910    -.1620492    .1443507
------------------------------------------------------------------------------

 ( 1)  20*[fst1_mean]_cons - 20*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.011799   .1042196    -0.11   0.910    -.2160656    .1924676
------------------------------------------------------------------------------

 ( 1)  25*[fst1_mean]_cons - 25*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0147488   .1302745    -0.11   0.910     -.270082    .2405845
------------------------------------------------------------------------------

. 
. ** qadratic
. capture program drop coef

. program coef, rclass
  1.         suest fst2 snd2
  2.         lincom [fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst2, snd2

                                                Number of obs     =      8,937

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst2_mean    |
  emptendif2 |  -.0000211   .0002442    -0.09   0.931    -.0004998    .0004576
  empexpdif2 |  -.0001138   .0002535    -0.45   0.654    -.0006107    .0003831
       _cons |  -.0238583   .0149099    -1.60   0.110    -.0530812    .0053647
-------------+----------------------------------------------------------------
fst2_lnvar   |
       _cons |  -1.904223   .0489735   -38.88   0.000    -2.000209   -1.808237
-------------+----------------------------------------------------------------
snd2_mean    |
   schooling |
         12  |  -.0276319   .0326226    -0.85   0.397    -.0915711    .0363073
         14  |   -.159898   .0385835    -4.14   0.000    -.2355204   -.0842757
         16  |   .0456519     .03387     1.35   0.178     -.020732    .1120359
             |
        year |
       2005  |   .1188805   .0405744     2.93   0.003     .0393562    .1984048
       2006  |   .1144869   .0408269     2.80   0.005     .0344677    .1945061
       2007  |   .1217537   .0376691     3.23   0.001     .0479237    .1955837
       2008  |   .1300466   .0384067     3.39   0.001     .0547708    .2053223
       2009  |   .1342288   .0343129     3.91   0.000     .0669768    .2014808
       2010  |   .1030449   .0350766     2.94   0.003      .034296    .1717938
       2011  |   .1275785   .0345834     3.69   0.000     .0597962    .1953607
       2012  |   .1188473   .0340163     3.49   0.000     .0521765     .185518
       2013  |   .1392226   .0353096     3.94   0.000     .0700171    .2084281
       2014  |   .1765698    .035253     5.01   0.000     .1074752    .2456645
             |
  initialemp |  -.0238096   .0005524   -43.10   0.000    -.0248924   -.0227268
       _cons |   8.136573   .0422618   192.53   0.000     8.053742    8.219405
-------------+----------------------------------------------------------------
snd2_lnvar   |
       _cons |  -.8195234   .0152969   -53.57   0.000    -.8495047   -.7895421
------------------------------------------------------------------------------

 ( 1)  [fst2_mean]_cons - [snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0000487   .0149368    -0.00   0.997    -.0293242    .0292268
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst2 snd2
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp])*`X' ///
>                                 +[fst2_mean]_b[emptendif2]*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst2_mean]emptendif2 + 2*[fst2_mean]_cons - 2*[snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0001818   .0296461    -0.01   0.995    -.0582872    .0579235
------------------------------------------------------------------------------

 ( 1)  25*[fst2_mean]emptendif2 + 5*[fst2_mean]_cons - 5*[snd2_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0007713    .073407    -0.01   0.992    -.1446464    .1431037
------------------------------------------------------------------------------

 ( 1)  100*[fst2_mean]emptendif2 + 10*[fst2_mean]_cons - 10*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0025985   .1452456    -0.02   0.986    -.2872746    .2820776
------------------------------------------------------------------------------

 ( 1)  225*[fst2_mean]emptendif2 + 15*[fst2_mean]_cons - 15*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0054815   .2170414    -0.03   0.980    -.4308748    .4199118
------------------------------------------------------------------------------

 ( 1)  400*[fst2_mean]emptendif2 + 20*[fst2_mean]_cons - 20*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0094203   .2903433    -0.03   0.974    -.5784828    .5596422
------------------------------------------------------------------------------

 ( 1)  625*[fst2_mean]emptendif2 + 25*[fst2_mean]_cons - 25*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0144149   .3666694    -0.04   0.969    -.7330738    .7042439
------------------------------------------------------------------------------

. 
. ** cubic
. capture program drop coef

. program coef, rclass
  1.         suest fst3 snd3
  2.         lincom [fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst3, snd3

                                                Number of obs     =      8,937

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst3_mean    |
  emptendif2 |   .0013603   .0009295     1.46   0.143    -.0004614     .003182
  empexpdif2 |  -.0011746   .0013855    -0.85   0.397    -.0038901     .001541
  emptendif3 |  -.0000255   .0000163    -1.57   0.117    -.0000574    6.40e-06
  empexpdif3 |   .0000155   .0000172     0.90   0.366    -.0000181    .0000492
       _cons |  -.0202509   .0318156    -0.64   0.524    -.0826083    .0421065
-------------+----------------------------------------------------------------
fst3_lnvar   |
       _cons |  -1.904322   .0489032   -38.94   0.000    -2.000171   -1.808474
-------------+----------------------------------------------------------------
snd3_mean    |
   schooling |
         12  |   .0010592    .032361     0.03   0.974    -.0623672    .0644856
         14  |  -.1255167   .0382047    -3.29   0.001    -.2003965   -.0506369
         16  |   .0800849   .0336285     2.38   0.017     .0141744    .1459955
             |
        year |
       2005  |    .117962   .0400475     2.95   0.003     .0394703    .1964536
       2006  |   .1134365   .0401896     2.82   0.005     .0346664    .1922066
       2007  |   .1202179     .03707     3.24   0.001     .0475622    .1928737
       2008  |   .1278966   .0377838     3.38   0.001     .0538417    .2019515
       2009  |   .1317661   .0337468     3.90   0.000     .0656235    .1979086
       2010  |   .0991313   .0344994     2.87   0.004     .0315137    .1667489
       2011  |   .1221639   .0340108     3.59   0.000     .0555039    .1888238
       2012  |   .1143632   .0334345     3.42   0.001     .0488327    .1798937
       2013  |   .1347853   .0347401     3.88   0.000     .0666959    .2028747
       2014  |   .1740476   .0346723     5.02   0.000     .1060911     .242004
             |
  initialemp |   -.003015   .0005481    -5.50   0.000    -.0040893   -.0019407
       _cons |   8.020269   .0416382   192.62   0.000      7.93866    8.101878
-------------+----------------------------------------------------------------
snd3_lnvar   |
       _cons |  -.8426017   .0155459   -54.20   0.000     -.873071   -.8121324
------------------------------------------------------------------------------

 ( 1)  [fst3_mean]_cons - [snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0172359   .0318269    -0.54   0.588    -.0796155    .0451437
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst3 snd3
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp])*`X' ///
>                                 +[fst3_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst3_mean]_b[emptendif3]*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst3_mean]emptendif2 + 8*[fst3_mean]emptendif3 + 2*[fst3_mean]_cons -
       2*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0292348   .0633707    -0.46   0.645     -.153439    .0949695
------------------------------------------------------------------------------

 ( 1)  25*[fst3_mean]emptendif2 + 125*[fst3_mean]emptendif3 + 5*[fst3_mean]_cons
       - 5*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0553619   .1583339    -0.35   0.727    -.3656906    .2549669
------------------------------------------------------------------------------

 ( 1)  100*[fst3_mean]emptendif2 + 1000*[fst3_mean]emptendif3 +
       10*[fst3_mean]_cons - 10*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0618459   .3199681    -0.19   0.847    -.6889718      .56528
------------------------------------------------------------------------------

 ( 1)  225*[fst3_mean]emptendif2 + 3375*[fst3_mean]emptendif3 +
       15*[fst3_mean]_cons - 15*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0385884   .4883856    -0.08   0.937    -.9958066    .9186298
------------------------------------------------------------------------------

 ( 1)  400*[fst3_mean]emptendif2 + 8000*[fst3_mean]emptendif3 +
       20*[fst3_mean]_cons - 20*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0047254   .6632512    -0.01   0.994    -1.304674    1.295223
------------------------------------------------------------------------------

 ( 1)  625*[fst3_mean]emptendif2 + 15625*[fst3_mean]emptendif3 +
       25*[fst3_mean]_cons - 25*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0206068   .8421881     0.02   0.980    -1.630052    1.671265
------------------------------------------------------------------------------

. 
. ** quartic
. capture program drop coef

. program coef, rclass
  1.         suest fst4 snd4
  2.         lincom [fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst4, snd4

                                                Number of obs     =      8,937

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst4_mean    |
  emptendif2 |  -.0017271   .0021165    -0.82   0.414    -.0058753    .0024211
  empexpdif2 |  -.0050028   .0041722    -1.20   0.230    -.0131802    .0031746
  emptendif3 |   .0001149   .0000847     1.36   0.175    -.0000511    .0002809
  empexpdif3 |   .0001189   .0001141     1.04   0.297    -.0001047    .0003425
  emptendif4 |  -1.82e-06   1.05e-06    -1.73   0.083    -3.89e-06    2.39e-07
  empexpdif4 |  -9.46e-07   1.07e-06    -0.88   0.378    -3.05e-06    1.16e-06
       _cons |   .0508996   .0602164     0.85   0.398    -.0671223    .1689215
-------------+----------------------------------------------------------------
fst4_lnvar   |
       _cons |  -1.904939   .0488956   -38.96   0.000    -2.000773   -1.809105
-------------+----------------------------------------------------------------
snd4_mean    |
   schooling |
         12  |   .0121473   .0321756     0.38   0.706    -.0509156    .0752102
         14  |  -.1149857   .0380574    -3.02   0.003    -.1895769   -.0403944
         16  |   .0930093   .0334328     2.78   0.005     .0274822    .1585363
             |
        year |
       2005  |   .1189538   .0399489     2.98   0.003     .0406553    .1972522
       2006  |   .1166531   .0401408     2.91   0.004     .0379786    .1953275
       2007  |   .1221206   .0369318     3.31   0.001     .0497356    .1945055
       2008  |   .1263283    .037653     3.36   0.001     .0525297    .2001269
       2009  |    .133284   .0336313     3.96   0.000     .0673678    .1992002
       2010  |   .1016379   .0344103     2.95   0.003      .034195    .1690808
       2011  |   .1247279   .0339162     3.68   0.000     .0582534    .1912025
       2012  |   .1168961   .0333279     3.51   0.000     .0515747    .1822175
       2013  |   .1373385   .0346626     3.96   0.000     .0694011    .2052759
       2014  |   .1781735   .0346252     5.15   0.000     .1103095    .2460376
             |
  initialemp |   .0508189   .0005436    93.49   0.000     .0497535    .0518843
       _cons |   7.792552   .0412312   189.00   0.000     7.711741    7.873364
-------------+----------------------------------------------------------------
snd4_lnvar   |
       _cons |  -.8397108     .01546   -54.32   0.000    -.8700119   -.8094098
------------------------------------------------------------------------------

 ( 1)  [fst4_mean]_cons - [snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0000806   .0602196     0.00   0.999    -.1179475    .1181088
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst4 snd4
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp])*`X' ///
>                                 +[fst4_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif3]*`X'*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif4]*`X'*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst4_mean]emptendif2 + 8*[fst4_mean]emptendif3 +
       16*[fst4_mean]emptendif4 + 2*[fst4_mean]_cons - 2*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0058571   .1195871    -0.05   0.961    -.2402435    .2285293
------------------------------------------------------------------------------

 ( 1)  25*[fst4_mean]emptendif2 + 125*[fst4_mean]emptendif3 +
       625*[fst4_mean]emptendif4 + 5*[fst4_mean]_cons - 5*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0295516   .2983057    -0.10   0.921      -.61422    .5551167
------------------------------------------------------------------------------

 ( 1)  100*[fst4_mean]emptendif2 + 1000*[fst4_mean]emptendif3 +
       10000*[fst4_mean]emptendif4 + 10*[fst4_mean]_cons -
       10*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0752455   .6008442    -0.13   0.900    -1.252879    1.102388
------------------------------------------------------------------------------

 ( 1)  225*[fst4_mean]emptendif2 + 3375*[fst4_mean]emptendif3 +
       50625*[fst4_mean]emptendif4 + 15*[fst4_mean]_cons -
       15*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0919589   .9099895    -0.10   0.920    -1.875506    1.691588
------------------------------------------------------------------------------

 ( 1)  400*[fst4_mean]emptendif2 + 8000*[fst4_mean]emptendif3 +
       160000*[fst4_mean]emptendif4 + 20*[fst4_mean]_cons -
       20*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0619401    1.22236    -0.05   0.960    -2.457721    2.333841
------------------------------------------------------------------------------

 ( 1)  625*[fst4_mean]emptendif2 + 15625*[fst4_mean]emptendif3 +
       390625*[fst4_mean]emptendif4 + 25*[fst4_mean]_cons -
       25*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0051915   1.534912     0.00   0.997    -3.003182    3.013565
------------------------------------------------------------------------------

. 
end of do-file
Controls: infr

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd $Inputfd

. 
. qui {

. 
end of do-file

. qui{

. 
. 
. * estimation
. forvalues i=1/4 {
  2.         **** 1st step
.         qui $FstReg ///
>                                 `contrl`i'' ///
>                                 if fst==1
  3.         est sto fst`i'
  4.         gen emptenB`i'=`LHSterm`i'' ///
>                                                                 $DmYear
  5.         gen intwemp`i'=realwage-emptenB`i'
  6.         
.         **** 2nd step
.         qui reg intwemp`i' ///
>                                 $SndReg
  7.         est sto snd`i'
  8. }
(1,076 missing values generated)
(2,498 missing values generated)
(1,157 missing values generated)
(2,567 missing values generated)
(1,157 missing values generated)
(2,567 missing values generated)
(1,157 missing values generated)
(2,567 missing values generated)

. 
. * calc. return
. ** linear
. capture program drop coef

. program coef, rclass
  1.         suest fst1 snd1
  2.         lincom [fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst1, snd1

                                                Number of obs     =      8,863

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst1_mean    |
       _cons |  -.0303238   .0051634    -5.87   0.000    -.0404439   -.0202036
-------------+----------------------------------------------------------------
fst1_lnvar   |
       _cons |  -1.904936   .0489449   -38.92   0.000    -2.000866   -1.809005
-------------+----------------------------------------------------------------
snd1_mean    |
  1.dmarital |   .4894066   .0179984    27.19   0.000     .4541304    .5246828
             |
   schooling |
         12  |  -.0329733   .0314359    -1.05   0.294    -.0945867      .02864
         14  |  -.1307228   .0374926    -3.49   0.000     -.204207   -.0572387
         16  |   .0510373   .0326113     1.57   0.118    -.0128797    .1149544
             |
    1.dunion |   .0996912   .0154962     6.43   0.000     .0693193    .1300631
             |
        year |
       2005  |   .1130064   .0390096     2.90   0.004      .036549    .1894639
       2006  |   .1119323   .0388659     2.88   0.004     .0357565     .188108
       2007  |   .1162695   .0358672     3.24   0.001     .0459712    .1865679
       2008  |   .1260199   .0365258     3.45   0.001     .0544306    .1976092
       2009  |   .1433083   .0327682     4.37   0.000     .0790837    .2075328
       2010  |   .1141533   .0335552     3.40   0.001     .0483863    .1799203
       2011  |   .1439605   .0331021     4.35   0.000     .0790815    .2088395
       2012  |   .1323603   .0325595     4.07   0.000     .0685449    .1961757
       2013  |   .1548954   .0339566     4.56   0.000     .0883416    .2214491
       2014  |   .1945082   .0338367     5.75   0.000     .1281894    .2608269
             |
  initialemp |  -.0279207   .0005662   -49.31   0.000    -.0290305   -.0268109
       _cons |   7.735518   .0435905   177.46   0.000     7.650082    7.820954
-------------+----------------------------------------------------------------
snd1_lnvar   |
       _cons |  -.9028764   .0161761   -55.82   0.000    -.9345809   -.8711719
------------------------------------------------------------------------------

 ( 1)  [fst1_mean]_cons - [snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.002403   .0052125    -0.46   0.645    -.0126193    .0078132
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst1 snd1
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp])*`X'
  4.         }
  5. end

. emprtn

 ( 1)  2*[fst1_mean]_cons - 2*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0048061   .0104249    -0.46   0.645    -.0252385    .0156264
------------------------------------------------------------------------------

 ( 1)  5*[fst1_mean]_cons - 5*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0120152   .0260623    -0.46   0.645    -.0630963     .039066
------------------------------------------------------------------------------

 ( 1)  10*[fst1_mean]_cons - 10*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0240304   .0521246    -0.46   0.645    -.1261927    .0781319
------------------------------------------------------------------------------

 ( 1)  15*[fst1_mean]_cons - 15*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0360456   .0781869    -0.46   0.645     -.189289    .1171979
------------------------------------------------------------------------------

 ( 1)  20*[fst1_mean]_cons - 20*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0480608   .1042492    -0.46   0.645    -.2523854    .1562639
------------------------------------------------------------------------------

 ( 1)  25*[fst1_mean]_cons - 25*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.060076   .1303115    -0.46   0.645    -.3154817    .1953298
------------------------------------------------------------------------------

. 
. ** qadratic
. capture program drop coef

. program coef, rclass
  1.         suest fst2 snd2
  2.         lincom [fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst2, snd2

                                                Number of obs     =      8,860

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst2_mean    |
  emptendif2 |  -.0000211   .0002442    -0.09   0.931    -.0004998    .0004576
  empexpdif2 |  -.0001138   .0002535    -0.45   0.654    -.0006107    .0003831
       _cons |  -.0238583   .0149099    -1.60   0.110    -.0530812    .0053647
-------------+----------------------------------------------------------------
fst2_lnvar   |
       _cons |  -1.904223   .0489736   -38.88   0.000    -2.000209   -1.808237
-------------+----------------------------------------------------------------
snd2_mean    |
  1.dmarital |   .4822219   .0178399    27.03   0.000     .4472563    .5171874
             |
   schooling |
         12  |  -.0459108    .031604    -1.45   0.146    -.1078535    .0160318
         14  |  -.1427132   .0375869    -3.80   0.000    -.2163821   -.0690443
         16  |   .0383031   .0327579     1.17   0.242    -.0259012    .1025073
             |
    1.dunion |   .1014076   .0154557     6.56   0.000     .0711149    .1317003
             |
        year |
       2005  |   .1114511   .0388608     2.87   0.004     .0352853     .187617
       2006  |    .109422   .0387128     2.83   0.005     .0335463    .1852976
       2007  |   .1147942   .0357122     3.21   0.001     .0447995    .1847889
       2008  |   .1240205   .0363893     3.41   0.001     .0526989    .1953421
       2009  |    .141523   .0326162     4.34   0.000     .0775963    .2054496
       2010  |   .1119663   .0334282     3.35   0.001     .0464483    .1774844
       2011  |   .1411214    .032974     4.28   0.000     .0764936    .2057492
       2012  |   .1300679   .0324381     4.01   0.000     .0664903    .1936455
       2013  |   .1517588   .0338489     4.48   0.000     .0854162    .2181015
       2014  |   .1916663   .0337175     5.68   0.000     .1255812    .2577515
             |
  initialemp |   -.021992   .0005673   -38.76   0.000     -.023104   -.0208801
       _cons |   7.690688    .043554   176.58   0.000     7.605324    7.776052
-------------+----------------------------------------------------------------
snd2_lnvar   |
       _cons |   -.906719   .0161969   -55.98   0.000    -.9384644   -.8749737
------------------------------------------------------------------------------

 ( 1)  [fst2_mean]_cons - [snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0018662    .014936    -0.12   0.901    -.0311402    .0274078
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst2 snd2
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp])*`X' ///
>                                 +[fst2_mean]_b[emptendif2]*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst2_mean]emptendif2 + 2*[fst2_mean]_cons - 2*[snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0038169   .0296447    -0.13   0.898    -.0619194    .0542855
------------------------------------------------------------------------------

 ( 1)  25*[fst2_mean]emptendif2 + 5*[fst2_mean]_cons - 5*[snd2_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.009859   .0734034    -0.13   0.893    -.1537271    .1340091
------------------------------------------------------------------------------

 ( 1)  100*[fst2_mean]emptendif2 + 10*[fst2_mean]_cons - 10*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0207739   .1452391    -0.14   0.886    -.3054372    .2638895
------------------------------------------------------------------------------

 ( 1)  225*[fst2_mean]emptendif2 + 15*[fst2_mean]_cons - 15*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0327445   .2170327    -0.15   0.880    -.4581208    .3926317
------------------------------------------------------------------------------

 ( 1)  400*[fst2_mean]emptendif2 + 20*[fst2_mean]_cons - 20*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.045771   .2903332    -0.16   0.875    -.6148136    .5232716
------------------------------------------------------------------------------

 ( 1)  625*[fst2_mean]emptendif2 + 25*[fst2_mean]_cons - 25*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0598533   .3666586    -0.16   0.870    -.7784909    .6587843
------------------------------------------------------------------------------

. 
. ** cubic
. capture program drop coef

. program coef, rclass
  1.         suest fst3 snd3
  2.         lincom [fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst3, snd3

                                                Number of obs     =      8,860

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst3_mean    |
  emptendif2 |   .0013603   .0009295     1.46   0.143    -.0004614     .003182
  empexpdif2 |  -.0011746   .0013855    -0.85   0.397    -.0038901     .001541
  emptendif3 |  -.0000255   .0000163    -1.57   0.117    -.0000574    6.40e-06
  empexpdif3 |   .0000155   .0000172     0.90   0.366    -.0000181    .0000492
       _cons |  -.0202509   .0318156    -0.64   0.524    -.0826083    .0421065
-------------+----------------------------------------------------------------
fst3_lnvar   |
       _cons |  -1.904322   .0489033   -38.94   0.000    -2.000171   -1.808474
-------------+----------------------------------------------------------------
snd3_mean    |
  1.dmarital |   .4713511   .0175392    26.87   0.000      .436975    .5057273
             |
   schooling |
         12  |  -.0167596   .0314001    -0.53   0.594    -.0783026    .0447834
         14  |  -.1084692   .0372638    -2.91   0.004    -.1815049   -.0354334
         16  |   .0730152   .0325725     2.24   0.025     .0091742    .1368562
             |
    1.dunion |   .1006833   .0152771     6.59   0.000     .0707407    .1306258
             |
        year |
       2005  |    .110755   .0384208     2.88   0.004     .0354517    .1860583
       2006  |   .1086169   .0381686     2.85   0.004     .0338077     .183426
       2007  |   .1134782   .0352113     3.22   0.001     .0444654     .182491
       2008  |   .1217104   .0358522     3.39   0.001     .0514413    .1919795
       2009  |   .1389157    .032146     4.32   0.000     .0759107    .2019206
       2010  |   .1079898   .0329384     3.28   0.001     .0434317    .1725479
       2011  |    .135165   .0324817     4.16   0.000      .071502     .198828
       2012  |   .1255844   .0319263     3.93   0.000       .06301    .1881588
       2013  |    .147323   .0333344     4.42   0.000     .0819888    .2126573
       2014  |   .1889406   .0332049     5.69   0.000     .1238602    .2540211
             |
  initialemp |  -.0011928   .0005629    -2.12   0.034    -.0022961   -.0000895
       _cons |   7.583441   .0429045   176.75   0.000     7.499349    7.667532
-------------+----------------------------------------------------------------
snd3_lnvar   |
       _cons |  -.9280799   .0164479   -56.43   0.000    -.9603171   -.8958426
------------------------------------------------------------------------------

 ( 1)  [fst3_mean]_cons - [snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0190581   .0318249    -0.60   0.549    -.0814337    .0433175
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst3 snd3
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp])*`X' ///
>                                 +[fst3_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst3_mean]_b[emptendif3]*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst3_mean]emptendif2 + 8*[fst3_mean]emptendif3 + 2*[fst3_mean]_cons -
       2*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0328793   .0633668    -0.52   0.604    -.1570759    .0913174
------------------------------------------------------------------------------

 ( 1)  25*[fst3_mean]emptendif2 + 125*[fst3_mean]emptendif3 + 5*[fst3_mean]_cons
       - 5*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.064473   .1583248    -0.41   0.684     -.374784    .2458379
------------------------------------------------------------------------------

 ( 1)  100*[fst3_mean]emptendif2 + 1000*[fst3_mean]emptendif3 +
       10*[fst3_mean]_cons - 10*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0800683   .3199519    -0.25   0.802    -.7071625    .5470259
------------------------------------------------------------------------------

 ( 1)  225*[fst3_mean]emptendif2 + 3375*[fst3_mean]emptendif3 +
       15*[fst3_mean]_cons - 15*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0659219   .4883637    -0.13   0.893    -1.023097    .8912534
------------------------------------------------------------------------------

 ( 1)  400*[fst3_mean]emptendif2 + 8000*[fst3_mean]emptendif3 +
       20*[fst3_mean]_cons - 20*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0411702   .6632243    -0.06   0.951    -1.341066    1.258725
------------------------------------------------------------------------------

 ( 1)  625*[fst3_mean]emptendif2 + 15625*[fst3_mean]emptendif3 +
       25*[fst3_mean]_cons - 25*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0249491   .8421561    -0.03   0.976    -1.675545    1.625646
------------------------------------------------------------------------------

. 
. ** quartic
. capture program drop coef

. program coef, rclass
  1.         suest fst4 snd4
  2.         lincom [fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst4, snd4

                                                Number of obs     =      8,860

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst4_mean    |
  emptendif2 |  -.0017271   .0021165    -0.82   0.414    -.0058753    .0024211
  empexpdif2 |  -.0050028   .0041722    -1.20   0.230    -.0131802    .0031746
  emptendif3 |   .0001149   .0000847     1.36   0.175    -.0000511    .0002809
  empexpdif3 |   .0001189   .0001141     1.04   0.297    -.0001047    .0003425
  emptendif4 |  -1.82e-06   1.05e-06    -1.73   0.083    -3.89e-06    2.39e-07
  empexpdif4 |  -9.46e-07   1.07e-06    -0.88   0.378    -3.05e-06    1.16e-06
       _cons |   .0508996   .0602164     0.85   0.398    -.0671224    .1689215
-------------+----------------------------------------------------------------
fst4_lnvar   |
       _cons |  -1.904939   .0488956   -38.96   0.000    -2.000773   -1.809105
-------------+----------------------------------------------------------------
snd4_mean    |
  1.dmarital |   .4732225   .0176098    26.87   0.000     .4387079    .5077371
             |
   schooling |
         12  |  -.0053819   .0311795    -0.17   0.863    -.0664926    .0557288
         14  |  -.0978139   .0371003    -2.64   0.008    -.1705292   -.0250987
         16  |   .0857346   .0323569     2.65   0.008     .0223162    .1491529
             |
    1.dunion |   .0977216   .0152353     6.41   0.000     .0678611    .1275822
             |
        year |
       2005  |   .1117073   .0383752     2.91   0.004     .0364932    .1869214
       2006  |   .1116774   .0381656     2.93   0.003     .0368741    .1864806
       2007  |   .1148773    .035124     3.27   0.001     .0460355     .183719
       2008  |   .1201235   .0357582     3.36   0.001     .0500388    .1902083
       2009  |   .1405079   .0320818     4.38   0.000     .0776287    .2033871
       2010  |   .1106238   .0329076     3.36   0.001     .0461262    .1751215
       2011  |   .1374058   .0324263     4.24   0.000     .0738514    .2009601
       2012  |   .1280791   .0318567     4.02   0.000     .0656411     .190517
       2013  |    .150498    .033292     4.52   0.000      .085247    .2157491
       2014  |    .193109   .0331847     5.82   0.000     .1280681    .2581499
             |
  initialemp |   .0526155   .0005599    93.97   0.000      .051518     .053713
       _cons |   7.355263    .042553   172.85   0.000     7.271861    7.438666
-------------+----------------------------------------------------------------
snd4_lnvar   |
       _cons |  -.9255053   .0164139   -56.39   0.000    -.9576759   -.8933346
------------------------------------------------------------------------------

 ( 1)  [fst4_mean]_cons - [snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0017159   .0602188    -0.03   0.977    -.1197425    .1163107
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst4 snd4
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp])*`X' ///
>                                 +[fst4_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif3]*`X'*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif4]*`X'*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst4_mean]emptendif2 + 8*[fst4_mean]emptendif3 +
       16*[fst4_mean]emptendif4 + 2*[fst4_mean]_cons - 2*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0094502   .1195853    -0.08   0.937    -.2438332    .2249328
------------------------------------------------------------------------------

 ( 1)  25*[fst4_mean]emptendif2 + 125*[fst4_mean]emptendif3 +
       625*[fst4_mean]emptendif4 + 5*[fst4_mean]_cons - 5*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0385345   .2983009    -0.13   0.897    -.6231935    .5461245
------------------------------------------------------------------------------

 ( 1)  100*[fst4_mean]emptendif2 + 1000*[fst4_mean]emptendif3 +
       10000*[fst4_mean]emptendif4 + 10*[fst4_mean]_cons -
       10*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0932112   .6008343    -0.16   0.877    -1.270825    1.084402
------------------------------------------------------------------------------

 ( 1)  225*[fst4_mean]emptendif2 + 3375*[fst4_mean]emptendif3 +
       50625*[fst4_mean]emptendif4 + 15*[fst4_mean]_cons -
       15*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1189074   .9099752    -0.13   0.896    -1.902426    1.664611
------------------------------------------------------------------------------

 ( 1)  400*[fst4_mean]emptendif2 + 8000*[fst4_mean]emptendif3 +
       160000*[fst4_mean]emptendif4 + 20*[fst4_mean]_cons -
       20*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0978714   1.222342    -0.08   0.936    -2.493618    2.297875
------------------------------------------------------------------------------

 ( 1)  625*[fst4_mean]emptendif2 + 15625*[fst4_mean]emptendif3 +
       390625*[fst4_mean]emptendif4 + 25*[fst4_mean]_cons -
       25*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0397226   1.534892    -0.03   0.979    -3.048057    2.968611
------------------------------------------------------------------------------

. 
end of do-file
Controls: all

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd $Inputfd

. 
. qui {

. 
end of do-file

. qui{

. 
. 
. * estimation
. forvalues i=1/4 {
  2.         **** 1st step
.         qui $FstReg ///
>                                 `contrl`i'' ///
>                                 if fst==1
  3.         est sto fst`i'
  4.         gen emptenB`i'=`LHSterm`i'' ///
>                                                                 $DmYear
  5.         gen intwemp`i'=realwage-emptenB`i'
  6.         
.         **** 2nd step
.         qui reg intwemp`i' ///
>                                 $SndReg
  7.         est sto snd`i'
  8. }
(1,076 missing values generated)
(2,498 missing values generated)
(1,157 missing values generated)
(2,567 missing values generated)
(1,157 missing values generated)
(2,567 missing values generated)
(1,157 missing values generated)
(2,567 missing values generated)

. 
. * calc. return
. ** linear
. capture program drop coef

. program coef, rclass
  1.         suest fst1 snd1
  2.         lincom [fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst1, snd1

                                                Number of obs     =      8,797

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst1_mean    |
       _cons |  -.0303238   .0051634    -5.87   0.000    -.0404439   -.0202036
-------------+----------------------------------------------------------------
fst1_lnvar   |
       _cons |  -1.904936   .0489449   -38.92   0.000    -2.000866   -1.809005
-------------+----------------------------------------------------------------
snd1_mean    |
  1.dmarital |   .3634895   .0172364    21.09   0.000     .3297067    .3972722
             |
   schooling |
         12  |   -.141668   .0310949    -4.56   0.000    -.2026128   -.0807232
         14  |  -.2842957    .036708    -7.74   0.000    -.3562421   -.2123494
         16  |  -.2287111   .0331938    -6.89   0.000    -.2937698   -.1636523
             |
  1.dregular |   .2059396   .0219052     9.40   0.000     .1630062     .248873
    1.dunion |   .0514131   .0159512     3.22   0.001     .0201494    .0826768
             |
         occ |
          2  |   .0679193   .4792717     0.14   0.887    -.8714361    1.007275
          3  |  -.4846158   .3072924    -1.58   0.115    -1.086898    .1176663
          4  |  -.5448762   .3093233    -1.76   0.078    -1.151139    .0613863
          5  |   .1561583   .3088261     0.51   0.613    -.4491297    .7614463
          6  |  -.2979417   .3086139    -0.97   0.334    -.9028138    .3069304
          7  |  -.5789087   .3094319    -1.87   0.061    -1.185384    .0275668
          8  |  -.5047944   .3083488    -1.64   0.102    -1.109147    .0995581
          9  |  -.4279965   .3095872    -1.38   0.167    -1.034776    .1787833
         10  |   -.329972   .3087954    -1.07   0.285    -.9351999    .2752559
         11  |  -.6014231    .311303    -1.93   0.053    -1.211566    .0087195
         12  |  -.3674364   .3218023    -1.14   0.254    -.9981572    .2632844
             |
         ind |
          2  |   .1687093    .254503     0.66   0.507    -.3301074     .667526
          3  |   .1164715    .367134     0.32   0.751     -.603098    .8360409
          4  |   .4937921   .3452798     1.43   0.153    -.1829438    1.170528
          5  |   .5931314   .3451861     1.72   0.086     -.083421    1.269684
          6  |   .5121128    .344667     1.49   0.137    -.1634222    1.187648
          7  |    .333966   .3478288     0.96   0.337     -.347766    1.015698
          8  |   .4776903   .3465152     1.38   0.168     -.201467    1.156848
          9  |   .6379889   .3509251     1.82   0.069    -.0498117     1.32579
         10  |    .446686   .3461784     1.29   0.197    -.2318113    1.125183
         11  |   .5842081   .3464529     1.69   0.092    -.0948271    1.263243
         12  |   .6553239   .3470484     1.89   0.059    -.0248784    1.335526
         13  |   .5710222   .3493047     1.63   0.102    -.1136024    1.255647
         14  |   .3408345   .3460227     0.99   0.325    -.3373576    1.019027
         15  |   .5721152   .3474657     1.65   0.100    -.1089049    1.253135
         16  |   .4983397   .3452165     1.44   0.149    -.1782722    1.174952
         17  |   .3675415   .3840677     0.96   0.339    -.3852173      1.1203
         18  |   .5262854   .3548979     1.48   0.138    -.1693017    1.221873
             |
       dsize |
          1  |   .1143947   .0173242     6.60   0.000       .08044    .1483494
          2  |   .3051127    .017239    17.70   0.000     .2713249    .3389006
             |
        year |
       2005  |    .102239   .0376598     2.71   0.007     .0284271    .1760508
       2006  |   .1017003   .0372374     2.73   0.006     .0287164    .1746842
       2007  |   .1056441   .0341507     3.09   0.002       .03871    .1725782
       2008  |   .1038542   .0349501     2.97   0.003     .0353533    .1723552
       2009  |   .1346568   .0311834     4.32   0.000     .0735385    .1957752
       2010  |   .1062951   .0318624     3.34   0.001      .043846    .1687443
       2011  |   .1376761   .0310695     4.43   0.000     .0767809    .1985713
       2012  |   .1473861   .0309638     4.76   0.000     .0866982    .2080741
       2013  |   .1630845   .0322076     5.06   0.000     .0999589    .2262101
       2014  |   .2024487    .032063     6.31   0.000     .1396065     .265291
             |
  initialemp |  -.0209485   .0005931   -35.32   0.000    -.0221109   -.0197861
       _cons |   7.494845    .162462    46.13   0.000     7.176425    7.813264
-------------+----------------------------------------------------------------
snd1_lnvar   |
       _cons |     -1.089   .0184189   -59.12   0.000    -1.125101     -1.0529
------------------------------------------------------------------------------

 ( 1)  [fst1_mean]_cons - [snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0093753   .0052056    -1.80   0.072     -.019578    .0008275
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst1 snd1
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp])*`X'
  4.         }
  5. end

. emprtn

 ( 1)  2*[fst1_mean]_cons - 2*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0187505   .0104112    -1.80   0.072    -.0391561     .001655
------------------------------------------------------------------------------

 ( 1)  5*[fst1_mean]_cons - 5*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0468763   .0260279    -1.80   0.072    -.0978901    .0041375
------------------------------------------------------------------------------

 ( 1)  10*[fst1_mean]_cons - 10*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0937526   .0520559    -1.80   0.072    -.1957803     .008275
------------------------------------------------------------------------------

 ( 1)  15*[fst1_mean]_cons - 15*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1406289   .0780838    -1.80   0.072    -.2936704    .0124125
------------------------------------------------------------------------------

 ( 1)  20*[fst1_mean]_cons - 20*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1875053   .1041118    -1.80   0.072    -.3915606      .01655
------------------------------------------------------------------------------

 ( 1)  25*[fst1_mean]_cons - 25*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2343816   .1301397    -1.80   0.072    -.4894507    .0206876
------------------------------------------------------------------------------

. 
. ** qadratic
. capture program drop coef

. program coef, rclass
  1.         suest fst2 snd2
  2.         lincom [fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst2, snd2

                                                Number of obs     =      8,794

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst2_mean    |
  emptendif2 |  -.0000211   .0002442    -0.09   0.931    -.0004998    .0004576
  empexpdif2 |  -.0001138   .0002535    -0.45   0.654    -.0006107    .0003831
       _cons |  -.0238583   .0149099    -1.60   0.110    -.0530812    .0053647
-------------+----------------------------------------------------------------
fst2_lnvar   |
       _cons |  -1.904223   .0489736   -38.88   0.000    -2.000209   -1.808236
-------------+----------------------------------------------------------------
snd2_mean    |
  1.dmarital |   .3579335   .0170938    20.94   0.000     .3244302    .3914369
             |
   schooling |
         12  |  -.1542053   .0312342    -4.94   0.000    -.2154232   -.0929875
         14  |  -.2962162   .0367936    -8.05   0.000    -.3683303   -.2241022
         16  |  -.2414597   .0333043    -7.25   0.000    -.3067349   -.1761845
             |
  1.dregular |    .194396   .0219598     8.85   0.000     .1513555    .2374364
    1.dunion |   .0534777   .0158986     3.36   0.001      .022317    .0846384
             |
         occ |
          2  |   .0637301    .490131     0.13   0.897     -.896909    1.024369
          3  |  -.4996453   .3048375    -1.64   0.101    -1.097116    .0978253
          4  |  -.5573261    .306878    -1.82   0.069    -1.158796    .0441438
          5  |   .1401196   .3063864     0.46   0.647    -.4603867    .7406258
          6  |  -.3129854    .306161    -1.02   0.307    -.9130499    .2870791
          7  |  -.5935236   .3069952    -1.93   0.053    -1.195223    .0081759
          8  |   -.521232   .3059038    -1.70   0.088    -1.120793    .0783285
          9  |  -.4430816   .3071254    -1.44   0.149    -1.045036    .1588732
         10  |  -.3443106    .306339    -1.12   0.261     -.944724    .2561028
         11  |  -.6133175   .3088631    -1.99   0.047    -1.218678   -.0079569
         12  |  -.3844203   .3195016    -1.20   0.229    -1.010632    .2417914
             |
         ind |
          2  |   .1719108   .2520538     0.68   0.495    -.3221055    .6659272
          3  |   .1157627   .3653677     0.32   0.751    -.6003447    .8318702
          4  |    .502278   .3433531     1.46   0.144    -.1706816    1.175238
          5  |   .6000218   .3432557     1.75   0.080    -.0727471    1.272791
          6  |   .5188737   .3427413     1.51   0.130    -.1528869    1.190634
          7  |   .3398232   .3458953     0.98   0.326     -.338119    1.017765
          8  |    .484663   .3445882     1.41   0.160    -.1907175    1.160044
          9  |   .6444373   .3490138     1.85   0.065    -.0396172    1.328492
         10  |   .4519159   .3442601     1.31   0.189    -.2228215    1.126653
         11  |    .590937   .3445177     1.72   0.086    -.0843053    1.266179
         12  |   .6645881   .3451091     1.93   0.054    -.0118133    1.340989
         13  |    .583372   .3474081     1.68   0.093    -.0975353    1.264279
         14  |   .3477832   .3440836     1.01   0.312    -.3266083    1.022175
         15  |   .5807929   .3455265     1.68   0.093    -.0964265    1.258012
         16  |   .5060122   .3432875     1.47   0.140     -.166819    1.178843
         17  |   .3806387   .3817345     1.00   0.319    -.3675471    1.128824
         18  |   .5355583   .3530667     1.52   0.129    -.1564397    1.227556
             |
       dsize |
          1  |   .1155677   .0172769     6.69   0.000     .0817056    .1494298
          2  |   .3059505   .0172114    17.78   0.000     .2722169    .3396842
             |
        year |
       2005  |   .1013045   .0375346     2.70   0.007     .0277381    .1748709
       2006  |   .0995023   .0371086     2.68   0.007     .0267708    .1722338
       2007  |   .1043644   .0340223     3.07   0.002     .0376819    .1710469
       2008  |    .102328   .0348376     2.94   0.003     .0340476    .1706085
       2009  |   .1333994   .0310536     4.30   0.000     .0725355    .1942632
       2010  |   .1045282   .0317484     3.29   0.001     .0423025    .1667538
       2011  |     .13538   .0309526     4.37   0.000     .0747141    .1960459
       2012  |   .1455464   .0308619     4.72   0.000     .0850583    .2060345
       2013  |   .1605058   .0321242     5.00   0.000     .0975435    .2234681
       2014  |   .2003555   .0319713     6.27   0.000      .137693     .263018
             |
  initialemp |  -.0151248   .0005934   -25.49   0.000    -.0162878   -.0139618
       _cons |   7.466718   .1629539    45.82   0.000     7.147334    7.786101
-------------+----------------------------------------------------------------
snd2_lnvar   |
       _cons |   -1.09297   .0184586   -59.21   0.000    -1.129148   -1.056792
------------------------------------------------------------------------------

 ( 1)  [fst2_mean]_cons - [snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0087335   .0149343    -0.58   0.559    -.0380041    .0205372
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst2 snd2
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp])*`X' ///
>                                 +[fst2_mean]_b[emptendif2]*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst2_mean]emptendif2 + 2*[fst2_mean]_cons - 2*[snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0175514   .0296408    -0.59   0.554    -.0756462    .0405434
------------------------------------------------------------------------------

 ( 1)  25*[fst2_mean]emptendif2 + 5*[fst2_mean]_cons - 5*[snd2_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0441952   .0733918    -0.60   0.547    -.1880405      .09965
------------------------------------------------------------------------------

 ( 1)  100*[fst2_mean]emptendif2 + 10*[fst2_mean]_cons - 10*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0894463   .1452094    -0.62   0.538    -.3740514    .1951588
------------------------------------------------------------------------------

 ( 1)  225*[fst2_mean]emptendif2 + 15*[fst2_mean]_cons - 15*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1357532   .2169787    -0.63   0.532    -.5610236    .2895173
------------------------------------------------------------------------------

 ( 1)  400*[fst2_mean]emptendif2 + 20*[fst2_mean]_cons - 20*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1831158   .2902492    -0.63   0.528    -.7519939    .3857622
------------------------------------------------------------------------------

 ( 1)  625*[fst2_mean]emptendif2 + 25*[fst2_mean]_cons - 25*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2315344   .3665395    -0.63   0.528    -.9499386    .4868699
------------------------------------------------------------------------------

. 
. ** cubic
. capture program drop coef

. program coef, rclass
  1.         suest fst3 snd3
  2.         lincom [fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst3, snd3

                                                Number of obs     =      8,794

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst3_mean    |
  emptendif2 |   .0013603   .0009295     1.46   0.143    -.0004614     .003182
  empexpdif2 |  -.0011746   .0013855    -0.85   0.397    -.0038901     .001541
  emptendif3 |  -.0000255   .0000163    -1.57   0.117    -.0000574    6.40e-06
  empexpdif3 |   .0000155   .0000172     0.90   0.366    -.0000181    .0000492
       _cons |  -.0202509   .0318156    -0.64   0.524    -.0826084    .0421065
-------------+----------------------------------------------------------------
fst3_lnvar   |
       _cons |  -1.904322   .0489033   -38.94   0.000    -2.000171   -1.808474
-------------+----------------------------------------------------------------
snd3_mean    |
  1.dmarital |   .3485018   .0167819    20.77   0.000       .31561    .3813937
             |
   schooling |
         12  |   -.123316   .0311357    -3.96   0.000    -.1843408   -.0622912
         14  |  -.2600065   .0365771    -7.11   0.000    -.3316963   -.1883167
         16  |  -.2015034   .0331836    -6.07   0.000     -.266542   -.1364647
             |
  1.dregular |   .2037454   .0220185     9.25   0.000       .16059    .2469009
    1.dunion |   .0533254   .0157115     3.39   0.001     .0225315    .0841193
             |
         occ |
          2  |   .0742633   .4646945     0.16   0.873    -.8365212    .9850478
          3  |  -.4097566   .3151743    -1.30   0.194    -1.027487    .2079736
          4  |   -.466316   .3171741    -1.47   0.142    -1.087966    .1553338
          5  |   .2122944    .316706     0.67   0.503     -.408438    .8330267
          6  |  -.2294028   .3164814    -0.72   0.469    -.8496949    .3908894
          7  |  -.5042399   .3172966    -1.59   0.112     -1.12613    .1176499
          8  |   -.429668   .3162666    -1.36   0.174    -1.049539    .1902032
          9  |   -.354064   .3173925    -1.12   0.265    -.9761419    .2680138
         10  |  -.2572245   .3166631    -0.81   0.417    -.8778728    .3634239
         11  |  -.5167732   .3191618    -1.62   0.105    -1.142319    .1087724
         12  |  -.3062696   .3293558    -0.93   0.352    -.9517951    .3392559
             |
         ind |
          2  |   .1283408   .2530646     0.51   0.612    -.3676567    .6243382
          3  |   .0769626   .3733608     0.21   0.837    -.6548111    .8087363
          4  |   .4363531   .3503164     1.25   0.213    -.2502544    1.122961
          5  |   .5317674   .3502179     1.52   0.129    -.1546471    1.218182
          6  |   .4525976   .3496651     1.29   0.196    -.2327334    1.137929
          7  |   .2741808   .3527353     0.78   0.437    -.4171677    .9655292
          8  |    .416381   .3514739     1.18   0.236    -.2724951    1.105257
          9  |   .5874618   .3557096     1.65   0.099    -.1097163     1.28464
         10  |   .3846045   .3511752     1.10   0.273    -.3036863    1.072895
         11  |   .5239398   .3514162     1.49   0.136    -.1648232    1.212703
         12  |   .6011913   .3519701     1.71   0.088    -.0886575     1.29104
         13  |   .5131394   .3542296     1.45   0.147    -.1811377    1.207417
         14  |   .2854298   .3509818     0.81   0.416    -.4024818    .9733414
         15  |    .518095   .3523854     1.47   0.141    -.1725678    1.208758
         16  |   .4382001   .3502289     1.25   0.211     -.248236    1.124636
         17  |   .3060584   .3861603     0.79   0.428     -.450802    1.062919
         18  |   .4767091   .3598148     1.32   0.185    -.2285149    1.181933
             |
       dsize |
          1  |   .1116662   .0171036     6.53   0.000     .0781437    .1451888
          2  |   .2994182   .0170519    17.56   0.000      .265997    .3328393
             |
        year |
       2005  |   .1015606   .0371888     2.73   0.006     .0286719    .1744494
       2006  |   .0999362   .0366413     2.73   0.006     .0281205     .171752
       2007  |   .1038681   .0336171     3.09   0.002     .0379798    .1697563
       2008  |   .1009116   .0343628     2.94   0.003     .0335618    .1682614
       2009  |   .1310129   .0306344     4.28   0.000     .0709707    .1910551
       2010  |   .1008809    .031325     3.22   0.001     .0394851    .1622767
       2011  |    .129994   .0305277     4.26   0.000     .0701608    .1898273
       2012  |   .1408819    .030411     4.63   0.000     .0812775    .2004863
       2013  |   .1561823   .0316679     4.93   0.000     .0941144    .2182502
       2014  |   .1976144   .0315042     6.27   0.000     .1358673    .2593615
             |
  initialemp |   .0056518   .0005923     9.54   0.000     .0044908    .0068127
       _cons |   7.329334   .1579317    46.41   0.000     7.019793    7.638874
-------------+----------------------------------------------------------------
snd3_lnvar   |
       _cons |  -1.110498   .0187458   -59.24   0.000    -1.147239   -1.073757
------------------------------------------------------------------------------

 ( 1)  [fst3_mean]_cons - [snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0259027   .0318305    -0.81   0.416    -.0882894     .036484
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst3 snd3
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp])*`X' ///
>                                 +[fst3_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst3_mean]_b[emptendif3]*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst3_mean]emptendif2 + 8*[fst3_mean]emptendif3 + 2*[fst3_mean]_cons -
       2*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0465684   .0633785    -0.73   0.462    -.1707879    .0776512
------------------------------------------------------------------------------

 ( 1)  25*[fst3_mean]emptendif2 + 125*[fst3_mean]emptendif3 + 5*[fst3_mean]_cons
       - 5*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0986958   .1583549    -0.62   0.533    -.4090658    .2116741
------------------------------------------------------------------------------

 ( 1)  100*[fst3_mean]emptendif2 + 1000*[fst3_mean]emptendif3 +
       10*[fst3_mean]_cons - 10*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1485139   .3200135    -0.46   0.643    -.7757287     .478701
------------------------------------------------------------------------------

 ( 1)  225*[fst3_mean]emptendif2 + 3375*[fst3_mean]emptendif3 +
       15*[fst3_mean]_cons - 15*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1685903   .4884558    -0.35   0.730    -1.125946    .7887656
------------------------------------------------------------------------------

 ( 1)  400*[fst3_mean]emptendif2 + 8000*[fst3_mean]emptendif3 +
       20*[fst3_mean]_cons - 20*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1780613   .6633446    -0.27   0.788    -1.478193     1.12207
------------------------------------------------------------------------------

 ( 1)  625*[fst3_mean]emptendif2 + 15625*[fst3_mean]emptendif3 +
       25*[fst3_mean]_cons - 25*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1960631   .8423012    -0.23   0.816    -1.846943    1.454817
------------------------------------------------------------------------------

. 
. ** quartic
. capture program drop coef

. program coef, rclass
  1.         suest fst4 snd4
  2.         lincom [fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst4, snd4

                                                Number of obs     =      8,794

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst4_mean    |
  emptendif2 |  -.0017271   .0021165    -0.82   0.414    -.0058753    .0024211
  empexpdif2 |  -.0050028   .0041722    -1.20   0.230    -.0131802    .0031746
  emptendif3 |   .0001149   .0000847     1.36   0.175    -.0000511    .0002809
  empexpdif3 |   .0001189   .0001141     1.04   0.297    -.0001047    .0003425
  emptendif4 |  -1.82e-06   1.05e-06    -1.73   0.083    -3.89e-06    2.39e-07
  empexpdif4 |  -9.46e-07   1.07e-06    -0.88   0.378    -3.05e-06    1.16e-06
       _cons |   .0508996   .0602164     0.85   0.398    -.0671224    .1689216
-------------+----------------------------------------------------------------
fst4_lnvar   |
       _cons |  -1.904939   .0488957   -38.96   0.000    -2.000773   -1.809105
-------------+----------------------------------------------------------------
snd4_mean    |
  1.dmarital |   .3497975    .016888    20.71   0.000     .3166976    .3828973
             |
   schooling |
         12  |  -.1118187   .0310787    -3.60   0.000    -.1727318   -.0509056
         14  |   -.249645   .0365433    -6.83   0.000    -.3212685   -.1780215
         16  |  -.1882089   .0331263    -5.68   0.000    -.2531352   -.1232826
             |
  1.dregular |   .2134817   .0219786     9.71   0.000     .1704045    .2565589
    1.dunion |   .0498431   .0157362     3.17   0.002     .0190008    .0806855
             |
         occ |
          2  |   .2032331    .470013     0.43   0.665    -.7179755    1.124442
          3  |  -.3390177   .3130664    -1.08   0.279    -.9526167    .2745812
          4  |  -.3941549   .3151073    -1.25   0.211    -1.011754    .2234439
          5  |   .2779512   .3145921     0.88   0.377     -.338638    .8945404
          6  |  -.1571292   .3143811    -0.50   0.617    -.7733049    .4590465
          7  |   -.433765   .3151961    -1.38   0.169    -1.051538     .184008
          8  |  -.3600491   .3141553    -1.15   0.252    -.9757822    .2556841
          9  |    -.27961    .315296    -0.89   0.375    -.8975788    .3383589
         10  |  -.1851014   .3145668    -0.59   0.556     -.801641    .4314382
         11  |  -.4421656    .317214    -1.39   0.163    -1.063894    .1795624
         12  |  -.2335131   .3273991    -0.71   0.476    -.8752034    .4081773
             |
         ind |
          2  |   .0702762   .2523021     0.28   0.781    -.4242268    .5647791
          3  |  -.0299816   .3728309    -0.08   0.936    -.7607167    .7007536
          4  |   .3434152   .3497131     0.98   0.326    -.3420099     1.02884
          5  |   .4364879   .3496199     1.25   0.212    -.2487545     1.12173
          6  |   .3551283   .3490587     1.02   0.309    -.3290142    1.039271
          7  |   .1752701   .3521558     0.50   0.619    -.5149427    .8654829
          8  |   .3189619   .3508511     0.91   0.363    -.3686936    1.006617
          9  |   .4886825   .3553969     1.38   0.169    -.2078826    1.185248
         10  |   .2865015   .3505625     0.82   0.414    -.4005884    .9735914
         11  |   .4273156   .3508063     1.22   0.223    -.2602521    1.114883
         12  |   .4911548   .3513832     1.40   0.162    -.1975437    1.179853
         13  |   .4129711   .3534792     1.17   0.243    -.2798353    1.105778
         14  |   .1919769   .3504057     0.55   0.584    -.4948057    .8787596
         15  |   .4109262   .3517591     1.17   0.243    -.2785089    1.100361
         16  |   .3426313   .3496424     0.98   0.327    -.3426551    1.027918
         17  |   .1904262   .3861167     0.49   0.622    -.5663486    .9472011
         18  |   .3703516   .3591076     1.03   0.302    -.3334863     1.07419
             |
       dsize |
          1  |   .1120724    .017249     6.50   0.000      .078265    .1458798
          2  |   .2998233   .0171068    17.53   0.000     .2662947     .333352
             |
        year |
       2005  |   .1012939   .0371382     2.73   0.006     .0285043    .1740835
       2006  |   .1026026   .0365825     2.80   0.005     .0309023    .1743029
       2007  |   .1056842   .0335289     3.15   0.002     .0399688    .1713995
       2008  |   .0986606   .0342385     2.88   0.004     .0315544    .1657667
       2009  |   .1319888   .0305361     4.32   0.000     .0721392    .1918384
       2010  |   .1030894   .0312639     3.30   0.001     .0418133    .1643654
       2011  |   .1317727   .0304439     4.33   0.000     .0721038    .1914416
       2012  |   .1423237   .0302997     4.70   0.000     .0829373      .20171
       2013  |    .158799   .0315888     5.03   0.000     .0968862    .2207119
       2014  |   .2010722   .0314584     6.39   0.000     .1394148    .2627297
             |
  initialemp |   .0595415   .0005912   100.72   0.000     .0583828    .0607002
       _cons |   7.118417   .1606526    44.31   0.000     6.803543     7.43329
-------------+----------------------------------------------------------------
snd4_lnvar   |
       _cons |   -1.10583   .0187168   -59.08   0.000    -1.142514   -1.069145
------------------------------------------------------------------------------

 ( 1)  [fst4_mean]_cons - [snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0086419    .060225    -0.14   0.886    -.1266808    .1093969
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst4 snd4
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp])*`X' ///
>                                 +[fst4_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif3]*`X'*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif4]*`X'*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst4_mean]emptendif2 + 8*[fst4_mean]emptendif3 +
       16*[fst4_mean]emptendif4 + 2*[fst4_mean]_cons - 2*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0233022   .1195989    -0.19   0.846    -.2577118    .2111073
------------------------------------------------------------------------------

 ( 1)  25*[fst4_mean]emptendif2 + 125*[fst4_mean]emptendif3 +
       625*[fst4_mean]emptendif4 + 5*[fst4_mean]_cons - 5*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0731645   .2983379    -0.25   0.806    -.6578961    .5115671
------------------------------------------------------------------------------

 ( 1)  100*[fst4_mean]emptendif2 + 1000*[fst4_mean]emptendif3 +
       10000*[fst4_mean]emptendif4 + 10*[fst4_mean]_cons -
       10*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1624713   .6009141    -0.27   0.787    -1.340241    1.015299
------------------------------------------------------------------------------

 ( 1)  225*[fst4_mean]emptendif2 + 3375*[fst4_mean]emptendif3 +
       50625*[fst4_mean]emptendif4 + 15*[fst4_mean]_cons -
       15*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2227975   .9100973    -0.24   0.807    -2.006555     1.56096
------------------------------------------------------------------------------

 ( 1)  400*[fst4_mean]emptendif2 + 8000*[fst4_mean]emptendif3 +
       160000*[fst4_mean]emptendif4 + 20*[fst4_mean]_cons -
       20*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2363916   1.222503    -0.19   0.847    -2.632453     2.15967
------------------------------------------------------------------------------

 ( 1)  625*[fst4_mean]emptendif2 + 15625*[fst4_mean]emptendif3 +
       390625*[fst4_mean]emptendif4 + 25*[fst4_mean]_cons -
       25*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2128729   1.535087    -0.14   0.890    -3.221588    2.795842
------------------------------------------------------------------------------

. 
end of do-file

. 
end of do-file

