---------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submit
> tion\Log\EstTopel.log
  log type:  text
 opened on:  18 Dec 2018, 19:56:44

. {
. qui{
. 
. do "$Code\ReadData.do"

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd $Inputfd

. 
. qui {

. 
end of do-file
. do "$Code\EstTopel.do"

. qui{

. 
. 
. * estimation
. forvalues i=1/4 {
  2.         **** 1st step
.         qui $FstReg ///
>                                 `contrl`i'' ///
>                                 if fst==1
  3.         est sto fst`i'
  4.         gen emptenB`i'=`LHSterm`i'' ///
>                                                                 $DmYear
  5.         gen intwemp`i'=realwage-emptenB`i'
  6.         
.         **** 2nd step
.         qui reg intwemp`i' ///
>                                 $SndReg
  7.         est sto snd`i'
  8. }
(1,076 missing values generated)
(2,498 missing values generated)
(1,157 missing values generated)
(2,567 missing values generated)
(1,157 missing values generated)
(2,567 missing values generated)
(1,157 missing values generated)
(2,567 missing values generated)

. 
. * calc. return
. ** linear
. capture program drop coef

. program coef, rclass
  1.         suest fst1 snd1
  2.         lincom [fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst1, snd1

                                                Number of obs     =      8,797

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst1_mean    |
       _cons |  -.0303238   .0051634    -5.87   0.000    -.0404439   -.0202036
-------------+----------------------------------------------------------------
fst1_lnvar   |
       _cons |  -1.904936   .0489449   -38.92   0.000    -2.000866   -1.809005
-------------+----------------------------------------------------------------
snd1_mean    |
  1.dmarital |   .4222186   .0232896    18.13   0.000     .3765718    .4678654
             |
   schooling |
         12  |   .2166753   .0911278     2.38   0.017     .0380682    .3952825
         14  |    .067305   .0912768     0.74   0.461    -.1115942    .2462042
         16  |   .1167928   .0889645     1.31   0.189    -.0575745    .2911601
             |
  1.dregular |   .3652546   .0428811     8.52   0.000     .2812092       .4493
    1.dunion |   .0461724   .0162808     2.84   0.005     .0142626    .0780821
             |
         occ |
          2  |   .0263001   .4428713     0.06   0.953    -.8417117    .8943118
          3  |  -.5565257   .3584415    -1.55   0.121    -1.259058    .1460066
          4  |  -.5856085   .3600133    -1.63   0.104    -1.291222    .1200045
          5  |   .0701759   .3600429     0.19   0.845    -.6354951    .7758469
          6  |  -.3716153   .3596776    -1.03   0.302     -1.07657    .3333399
          7  |  -.6459845   .3604216    -1.79   0.073    -1.352398    .0604289
          8  |  -.5705382   .3593943    -1.59   0.112    -1.274938    .1338618
          9  |   -.458601   .3602437    -1.27   0.203    -1.164666    .2474636
         10  |   -.419977   .3600147    -1.17   0.243    -1.125593     .285639
         11  |  -.6309144   .3617749    -1.74   0.081     -1.33998    .0781514
         12  |  -.4505011    .371125    -1.21   0.225    -1.177893    .2768905
             |
         ind |
          2  |   6.952113   .3068706    22.65   0.000     6.350658    7.553569
          3  |   6.975701   .4118952    16.94   0.000     6.168401    7.783001
          4  |   7.285584   .3941471    18.48   0.000     6.513069    8.058098
          5  |   7.380471   .3945042    18.71   0.000     6.607257    8.153685
          6  |   7.300611   .3939016    18.53   0.000     6.528578    8.072644
          7  |   7.085375   .4003483    17.70   0.000     6.300707    7.870043
          8  |   7.257526   .3964704    18.31   0.000     6.480459    8.034594
          9  |   7.371919   .4049185    18.21   0.000     6.578294    8.165545
         10  |   7.225928   .3961404    18.24   0.000     6.449507    8.002348
         11  |    7.36087    .396622    18.56   0.000     6.583505    8.138235
         12  |   7.423348   .3980133    18.65   0.000     6.643256     8.20344
         13  |   7.335129   .4004004    18.32   0.000     6.550359      8.1199
         14  |   7.106997   .3972341    17.89   0.000     6.328432    7.885561
         15  |   7.397116   .3926724    18.84   0.000     6.627492     8.16674
         16  |   7.242169   .3988188    18.16   0.000     6.460498    8.023839
         17  |   7.299197   .4190633    17.42   0.000     6.477848    8.120546
         18  |   7.277767    .406299    17.91   0.000     6.481435    8.074098
             |
       dsize |
          1  |   .1274684   .0178871     7.13   0.000     .0924104    .1625265
          2  |   .3239912   .0180697    17.93   0.000     .2885752    .3594073
             |
        year |
       2005  |   .2994544   .0587357     5.10   0.000     .1843345    .4145743
       2006  |   .3169374   .0633436     5.00   0.000     .1927863    .4410885
       2007  |    .321743   .0612918     5.25   0.000     .2016133    .4418727
       2008  |   .3043942   .0588411     5.17   0.000     .1890677    .4197208
       2009  |   .3284059    .053928     6.09   0.000     .2227089    .4341029
       2010  |   .3143376    .057638     5.45   0.000     .2013692    .4273061
       2011  |   .3523238   .0583688     6.04   0.000      .237923    .4667246
       2012  |   .3586689   .0577875     6.21   0.000     .2454076    .4719303
       2013  |   .3702581   .0582649     6.35   0.000      .256061    .4844552
       2014  |   .4066413   .0561645     7.24   0.000     .2965609    .5167218
             |
  initialemp |  -.0163615   .0012083   -13.54   0.000    -.0187296   -.0139934
-------------+----------------------------------------------------------------
snd1_lnvar   |
       _cons |  -.8444591   .0507955   -16.62   0.000    -.9440164   -.7449017
------------------------------------------------------------------------------

 ( 1)  [fst1_mean]_cons - [snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0139623   .0053071    -2.63   0.009     -.024364   -.0035606
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst1 snd1
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp])*`X'
  4.         }
  5. end

. emprtn

 ( 1)  2*[fst1_mean]_cons - 2*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0279245   .0106142    -2.63   0.009    -.0487279   -.0071211
------------------------------------------------------------------------------

 ( 1)  5*[fst1_mean]_cons - 5*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0698113   .0265354    -2.63   0.009    -.1218198   -.0178028
------------------------------------------------------------------------------

 ( 1)  10*[fst1_mean]_cons - 10*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1396227   .0530709    -2.63   0.009    -.2436397   -.0356057
------------------------------------------------------------------------------

 ( 1)  15*[fst1_mean]_cons - 15*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.209434   .0796063    -2.63   0.009    -.3654595   -.0534085
------------------------------------------------------------------------------

 ( 1)  20*[fst1_mean]_cons - 20*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2792453   .1061417    -2.63   0.009    -.4872793   -.0712114
------------------------------------------------------------------------------

 ( 1)  25*[fst1_mean]_cons - 25*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.3490567   .1326772    -2.63   0.009    -.6090991   -.0890142
------------------------------------------------------------------------------

. 
. ** qadratic
. capture program drop coef

. program coef, rclass
  1.         suest fst2 snd2
  2.         lincom [fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst2, snd2

                                                Number of obs     =      8,794

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst2_mean    |
  emptendif2 |  -.0000211   .0002442    -0.09   0.931    -.0004998    .0004576
  empexpdif2 |  -.0001138   .0002535    -0.45   0.654    -.0006107    .0003831
       _cons |  -.0238583   .0149099    -1.60   0.110    -.0530812    .0053647
-------------+----------------------------------------------------------------
fst2_lnvar   |
       _cons |  -1.904223   .0489736   -38.88   0.000    -2.000209   -1.808236
-------------+----------------------------------------------------------------
snd2_mean    |
  1.dmarital |   .4164423   .0231541    17.99   0.000     .3710612    .4618234
             |
   schooling |
         12  |   .2027932   .0908444     2.23   0.026     .0247415    .3808449
         14  |    .054065   .0910051     0.59   0.552    -.1243018    .2324318
         16  |   .1027475   .0886923     1.16   0.247    -.0710862    .2765812
             |
  1.dregular |   .3531131   .0428075     8.25   0.000      .269212    .4370142
    1.dunion |   .0482567    .016231     2.97   0.003     .0164445    .0800688
             |
         occ |
          2  |   .0222672   .4501024     0.05   0.961    -.8599173    .9044516
          3  |  -.5712854   .3551803    -1.61   0.108    -1.267426    .1248553
          4  |  -.5979055   .3567613    -1.68   0.094    -1.297145    .1013338
          5  |   .0544598   .3567952     0.15   0.879     -.644846    .7537656
          6  |  -.3863825   .3564187    -1.08   0.278     -1.08495    .3121853
          7  |  -.6603477   .3571738    -1.85   0.064    -1.360395       .0397
          8  |  -.5867291   .3561412    -1.65   0.099    -1.284753    .1112948
          9  |  -.4735712   .3569795    -1.33   0.185    -1.173238    .2260957
         10  |  -.4339778   .3567533    -1.22   0.224    -1.133202    .2652459
         11  |  -.6426982   .3585249    -1.79   0.073    -1.345394    .0599976
         12  |  -.4671733   .3680039    -1.27   0.204    -1.188448    .2541011
             |
         ind |
          2  |   6.929858   .3029266    22.88   0.000     6.336132    7.523583
          3  |    6.94925   .4083101    17.02   0.000     6.148977    7.749524
          4  |   7.268581    .390953    18.59   0.000     6.502327    8.034835
          5  |   7.361889    .391309    18.81   0.000     6.594938    8.128841
          6  |   7.281896   .3907071    18.64   0.000     6.516124    8.047668
          7  |   7.065895   .3971477    17.79   0.000       6.2875     7.84429
          8  |   7.239055   .3932822    18.41   0.000     6.468237    8.009874
          9  |   7.353096   .4017653    18.30   0.000     6.565651    8.140542
         10  |   7.205716   .3929582    18.34   0.000     6.435532      7.9759
         11  |   7.342167   .3934254    18.66   0.000     6.571068    8.113267
         12  |   7.407213   .3948198    18.76   0.000      6.63338    8.181045
         13  |   7.322095   .3972371    18.43   0.000     6.543524    8.100665
         14  |   7.088553   .3940354    17.99   0.000     6.316258    7.860848
         15  |    7.38018   .3894713    18.95   0.000      6.61683     8.14353
         16  |   7.224532   .3956282    18.26   0.000     6.449116    7.999949
         17  |    7.28628    .415586    17.53   0.000     6.471747    8.100814
         18  |   7.261702   .4032049    18.01   0.000     6.471435    8.051969
             |
       dsize |
          1  |   .1285923   .0178385     7.21   0.000     .0936296    .1635551
          2  |   .3247582   .0180373    18.00   0.000     .2894057    .3601107
             |
        year |
       2005  |   .2977798   .0585318     5.09   0.000     .1830596       .4125
       2006  |   .3139317   .0631158     4.97   0.000      .190227    .4376363
       2007  |   .3196523    .061059     5.24   0.000     .1999788    .4393259
       2008  |   .3021155   .0586439     5.15   0.000     .1871755    .4170554
       2009  |   .3264213   .0537235     6.08   0.000     .2211253    .4317174
       2010  |   .3117899   .0574299     5.43   0.000     .1992293    .4243505
       2011  |   .3492221   .0581508     6.01   0.000     .2352487    .4631954
       2012  |   .3560363   .0575727     6.18   0.000     .2431959    .4688767
       2013  |   .3669019   .0580889     6.32   0.000     .2530498     .480754
       2014  |   .4037818   .0559759     7.21   0.000     .2940711    .5134926
             |
  initialemp |   -.010555    .001205    -8.76   0.000    -.0129168   -.0081933
-------------+----------------------------------------------------------------
snd2_lnvar   |
       _cons |  -.8491981    .050698   -16.75   0.000    -.9485643   -.7498319
------------------------------------------------------------------------------

 ( 1)  [fst2_mean]_cons - [snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0133033   .0149773    -0.89   0.374    -.0426582    .0160517
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst2 snd2
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp])*`X' ///
>                                 +[fst2_mean]_b[emptendif2]*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst2_mean]emptendif2 + 2*[fst2_mean]_cons - 2*[snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.026691   .0297273    -0.90   0.369    -.0849554    .0315735
------------------------------------------------------------------------------

 ( 1)  25*[fst2_mean]emptendif2 + 5*[fst2_mean]_cons - 5*[snd2_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0670442   .0736097    -0.91   0.362    -.2113165    .0772282
------------------------------------------------------------------------------

 ( 1)  100*[fst2_mean]emptendif2 + 10*[fst2_mean]_cons - 10*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1351442   .1456481    -0.93   0.353    -.4206091    .1503208
------------------------------------------------------------------------------

 ( 1)  225*[fst2_mean]emptendif2 + 15*[fst2_mean]_cons - 15*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |     -.2043   .2176365    -0.94   0.348    -.6308597    .2222597
------------------------------------------------------------------------------

 ( 1)  400*[fst2_mean]emptendif2 + 20*[fst2_mean]_cons - 20*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2745116   .2911197    -0.94   0.346    -.8450958    .2960726
------------------------------------------------------------------------------

 ( 1)  625*[fst2_mean]emptendif2 + 25*[fst2_mean]_cons - 25*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.3457791   .3676121    -0.94   0.347    -1.066286    .3747273
------------------------------------------------------------------------------

. 
. ** cubic
. capture program drop coef

. program coef, rclass
  1.         suest fst3 snd3
  2.         lincom [fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst3, snd3

                                                Number of obs     =      8,794

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst3_mean    |
  emptendif2 |   .0013603   .0009295     1.46   0.143    -.0004614     .003182
  empexpdif2 |  -.0011746   .0013855    -0.85   0.397    -.0038901     .001541
  emptendif3 |  -.0000255   .0000163    -1.57   0.117    -.0000574    6.40e-06
  empexpdif3 |   .0000155   .0000172     0.90   0.366    -.0000181    .0000492
       _cons |  -.0202509   .0318156    -0.64   0.524    -.0826084    .0421065
-------------+----------------------------------------------------------------
fst3_lnvar   |
       _cons |  -1.904322   .0489033   -38.94   0.000    -2.000171   -1.808474
-------------+----------------------------------------------------------------
snd3_mean    |
  1.dmarital |    .405934   .0227365    17.85   0.000     .3613713    .4504968
             |
   schooling |
         12  |    .227114   .0894281     2.54   0.011     .0518382    .4023897
         14  |   .0838297   .0896029     0.94   0.349    -.0917888    .2594482
         16  |   .1363706   .0873373     1.56   0.118    -.0348073    .3075486
             |
  1.dregular |   .3595422   .0422816     8.50   0.000     .2766719    .4424126
    1.dunion |   .0482004   .0160333     3.01   0.003     .0167757    .0796252
             |
         occ |
          2  |   .0335632   .4345165     0.08   0.938    -.8180734    .8851998
          3  |  -.4800785   .3646717    -1.32   0.188    -1.194822    .2346648
          4  |  -.5061487   .3662471    -1.38   0.167     -1.22398    .2116824
          5  |   .1282107   .3662654     0.35   0.726    -.5896562    .8460776
          6  |  -.3014494   .3659001    -0.82   0.410      -1.0186    .4157016
          7  |  -.5698345   .3666471    -1.55   0.120     -1.28845    .1487807
          8  |    -.49396    .365661    -1.35   0.177    -1.210642    .2227225
          9  |  -.3839927   .3664353    -1.05   0.295    -1.102193    .3342072
         10  |  -.3452419   .3662281    -0.94   0.346    -1.063036     .372552
         11  |  -.5456133   .3680031    -1.48   0.138    -1.266886    .1756595
         12  |     -.3875   .3771466    -1.03   0.304    -1.126694    .3516938
             |
         ind |
          2  |   6.761945   .3057175    22.12   0.000     6.162749     7.36114
          3  |   6.784717    .418264    16.22   0.000     5.964935      7.6045
          4  |   7.078159   .3985261    17.76   0.000     6.297062    7.859256
          5  |    7.16922   .3988731    17.97   0.000     6.387443    7.950997
          6  |   7.091184   .3982324    17.81   0.000     6.310662    7.871705
          7  |   6.876496   .4044192    17.00   0.000     6.083849    7.669143
          8  |   7.046496   .4007159    17.58   0.000     6.261107    7.831885
          9  |   7.172685   .4088011    17.55   0.000     6.371449     7.97392
         10  |   7.014138   .4004551    17.52   0.000     6.229261    7.799016
         11  |   7.150951   .4008785    17.84   0.000     6.365243    7.936658
         12  |   7.219755   .4021818    17.95   0.000     6.431493    8.008017
         13  |   7.127873    .404587    17.62   0.000     6.334897    7.920849
         14  |   6.902173   .4014299    17.19   0.000     6.115385    7.688961
         15  |   7.192377    .397146    18.11   0.000     6.413985    7.970769
         16  |   7.033103   .4029394    17.45   0.000     6.243356     7.82285
         17  |    7.08464   .4213938    16.81   0.000     6.258723    7.910556
         18  |   7.079095   .4103859    17.25   0.000     6.274754    7.883437
             |
       dsize |
          1  |   .1244512   .0176413     7.05   0.000     .0898749    .1590275
          2  |   .3178798   .0178461    17.81   0.000     .2829022    .3528574
             |
        year |
       2005  |   .2944209   .0576828     5.10   0.000     .1813647    .4074771
       2006  |   .3104202   .0621067     5.00   0.000     .1886932    .4321472
       2007  |   .3151948   .0601164     5.24   0.000     .1973689    .4330207
       2008  |    .297023   .0576455     5.15   0.000     .1840399    .4100062
       2009  |   .3204833   .0528265     6.07   0.000     .2169453    .4240214
       2010  |   .3043292   .0564725     5.39   0.000      .193645    .4150133
       2011  |   .3399016   .0571522     5.95   0.000     .2278853    .4519178
       2012  |   .3474989   .0565696     6.14   0.000     .2366246    .4583732
       2013  |   .3587808   .0570592     6.29   0.000     .2469469    .4706148
       2014  |   .3972978   .0550086     7.22   0.000      .289483    .5051126
             |
  initialemp |   .0101375    .001188     8.53   0.000     .0078091    .0124658
-------------+----------------------------------------------------------------
snd3_lnvar   |
       _cons |  -.8709386   .0500051   -17.42   0.000    -.9689469   -.7729303
------------------------------------------------------------------------------

 ( 1)  [fst3_mean]_cons - [snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0303884   .0318439    -0.95   0.340    -.0928013    .0320245
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst3 snd3
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp])*`X' ///
>                                 +[fst3_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst3_mean]_b[emptendif3]*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst3_mean]emptendif2 + 8*[fst3_mean]emptendif3 + 2*[fst3_mean]_cons -
       2*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0555398   .0634048    -0.88   0.381    -.1798108    .0687312
------------------------------------------------------------------------------

 ( 1)  25*[fst3_mean]emptendif2 + 125*[fst3_mean]emptendif3 + 5*[fst3_mean]_cons
       - 5*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1211244   .1584187    -0.76   0.445    -.4316194    .1893706
------------------------------------------------------------------------------

 ( 1)  100*[fst3_mean]emptendif2 + 1000*[fst3_mean]emptendif3 +
       10*[fst3_mean]_cons - 10*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1933709   .3201344    -0.60   0.546    -.8208227    .4340809
------------------------------------------------------------------------------

 ( 1)  225*[fst3_mean]emptendif2 + 3375*[fst3_mean]emptendif3 +
       15*[fst3_mean]_cons - 15*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2358759   .4886276    -0.48   0.629    -1.193568    .7218165
------------------------------------------------------------------------------

 ( 1)  400*[fst3_mean]emptendif2 + 8000*[fst3_mean]emptendif3 +
       20*[fst3_mean]_cons - 20*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2677755   .6635629    -0.40   0.687    -1.568335    1.032784
------------------------------------------------------------------------------

 ( 1)  625*[fst3_mean]emptendif2 + 15625*[fst3_mean]emptendif3 +
       25*[fst3_mean]_cons - 25*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.3082058   .8425643    -0.37   0.715    -1.959602     1.34319
------------------------------------------------------------------------------

. 
. ** quartic
. capture program drop coef

. program coef, rclass
  1.         suest fst4 snd4
  2.         lincom [fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst4, snd4

                                                Number of obs     =      8,794

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst4_mean    |
  emptendif2 |  -.0017271   .0021165    -0.82   0.414    -.0058753    .0024211
  empexpdif2 |  -.0050028   .0041722    -1.20   0.230    -.0131802    .0031746
  emptendif3 |   .0001149   .0000847     1.36   0.175    -.0000511    .0002809
  empexpdif3 |   .0001189   .0001141     1.04   0.297    -.0001047    .0003425
  emptendif4 |  -1.82e-06   1.05e-06    -1.73   0.083    -3.89e-06    2.39e-07
  empexpdif4 |  -9.46e-07   1.07e-06    -0.88   0.378    -3.05e-06    1.16e-06
       _cons |   .0508996   .0602164     0.85   0.398    -.0671224    .1689216
-------------+----------------------------------------------------------------
fst4_lnvar   |
       _cons |  -1.904939   .0488957   -38.96   0.000    -2.000773   -1.809105
-------------+----------------------------------------------------------------
snd4_mean    |
  1.dmarital |   .4055769   .0225204    18.01   0.000     .3614378    .4497161
             |
   schooling |
         12  |   .2285269   .0871552     2.62   0.009     .0577058     .399348
         14  |   .0842966    .087414     0.96   0.335    -.0870316    .2556248
         16  |   .1399421   .0851553     1.64   0.100    -.0269592    .3068434
             |
  1.dregular |   .3647951   .0413548     8.82   0.000     .2837411    .4458491
    1.dunion |   .0448656   .0160336     2.80   0.005     .0134403     .076291
             |
         occ |
          2  |   .1637042   .4386168     0.37   0.709     -.695969    1.023377
          3  |   -.407316   .3615291    -1.13   0.260      -1.1159    .3012679
          4  |  -.4328415   .3631577    -1.19   0.233    -1.144617    .2789346
          5  |   .1962872   .3631136     0.54   0.589    -.5154024    .9079769
          6  |  -.2271026   .3627685    -0.63   0.531    -.9381157    .4839105
          7  |  -.4974719   .3635171    -1.37   0.171    -1.209952    .2150084
          8  |  -.4224909   .3625255    -1.17   0.244    -1.133028    .2880461
          9  |  -.3086773   .3633203    -0.85   0.396    -1.020772    .4034174
         10  |  -.2705859   .3630936    -0.75   0.456    -.9822362    .4410644
         11  |  -.4701758    .365018    -1.29   0.198    -1.185598    .2452464
         12  |  -.3124059   .3741547    -0.83   0.404    -1.045736     .420924
             |
         ind |
          2  |   6.512984   .2995236    21.74   0.000     5.925929     7.10004
          3  |   6.484744   .4147124    15.64   0.000     5.671922    7.297565
          4  |    6.79409   .3939118    17.25   0.000     6.022036    7.566143
          5  |   6.882934   .3942401    17.46   0.000     6.110237     7.65563
          6  |   6.802675   .3935931    17.28   0.000     6.031247    7.574103
          7  |    6.58759   .3997111    16.48   0.000     5.804171     7.37101
          8  |   6.758281   .3960284    17.07   0.000      5.98208    7.534483
          9  |   6.884402   .4042461    17.03   0.000     6.092094    7.676709
         10  |   6.725256   .3957632    16.99   0.000     5.949575    7.500938
         11  |    6.86362   .3962155    17.32   0.000     6.087052    7.640189
         12  |   6.919255   .3975057    17.41   0.000     6.140159    7.698352
         13  |   6.837352   .3997432    17.10   0.000     6.053869    7.620834
         14  |   6.618309    .396751    16.68   0.000     5.840692    7.395927
         15  |   6.893142   .3926553    17.56   0.000     6.123552    7.662732
         16  |   6.747752   .3981448    16.95   0.000     5.967402    7.528102
         17  |    6.77394   .4179983    16.21   0.000     5.954678    7.593201
         18  |    6.78274   .4056176    16.72   0.000     5.987744    7.577736
             |
       dsize |
          1  |   .1244895   .0177514     7.01   0.000     .0896974    .1592816
          2  |   .3177537   .0178525    17.80   0.000     .2827634     .352744
             |
        year |
       2005  |   .2886042   .0567064     5.09   0.000     .1774617    .3997467
       2006  |   .3070294   .0609608     5.04   0.000     .1875485    .4265103
       2007  |   .3109295   .0588923     5.28   0.000     .1955028    .4263563
       2008  |   .2891285    .056552     5.11   0.000     .1782885    .3999685
       2009  |   .3160068   .0517818     6.10   0.000     .2145163    .4174974
       2010  |   .3006829   .0553292     5.43   0.000     .1922397    .4091261
       2011  |   .3356397   .0559313     6.00   0.000     .2260164     .445263
       2012  |   .3429948   .0553885     6.19   0.000     .2344354    .4515543
       2013  |   .3555674   .0558951     6.36   0.000      .246015    .4651197
       2014  |   .3950093   .0538905     7.33   0.000     .2893859    .5006327
             |
  initialemp |   .0638981   .0011612    55.03   0.000     .0616222    .0661741
-------------+----------------------------------------------------------------
snd4_lnvar   |
       _cons |  -.8793814   .0479296   -18.35   0.000    -.9733216   -.7854411
------------------------------------------------------------------------------

 ( 1)  [fst4_mean]_cons - [snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0129986   .0602346    -0.22   0.829    -.1310561     .105059
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst4 snd4
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp])*`X' ///
>                                 +[fst4_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif3]*`X'*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif4]*`X'*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst4_mean]emptendif2 + 8*[fst4_mean]emptendif3 +
       16*[fst4_mean]emptendif4 + 2*[fst4_mean]_cons - 2*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0320155   .1196185    -0.27   0.789    -.2664634    .2024325
------------------------------------------------------------------------------

 ( 1)  25*[fst4_mean]emptendif2 + 125*[fst4_mean]emptendif3 +
       625*[fst4_mean]emptendif4 + 5*[fst4_mean]_cons - 5*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0949476   .2983878    -0.32   0.750     -.679777    .4898817
------------------------------------------------------------------------------

 ( 1)  100*[fst4_mean]emptendif2 + 1000*[fst4_mean]emptendif3 +
       10000*[fst4_mean]emptendif4 + 10*[fst4_mean]_cons -
       10*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2060375   .6010141    -0.34   0.732    -1.384004    .9719285
------------------------------------------------------------------------------

 ( 1)  225*[fst4_mean]emptendif2 + 3375*[fst4_mean]emptendif3 +
       50625*[fst4_mean]emptendif4 + 15*[fst4_mean]_cons -
       15*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2881469   .9102448    -0.32   0.752    -2.072194      1.4959
------------------------------------------------------------------------------

 ( 1)  400*[fst4_mean]emptendif2 + 8000*[fst4_mean]emptendif3 +
       160000*[fst4_mean]emptendif4 + 20*[fst4_mean]_cons -
       20*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.323524   1.222695    -0.26   0.791    -2.719962    2.072914
------------------------------------------------------------------------------

 ( 1)  625*[fst4_mean]emptendif2 + 15625*[fst4_mean]emptendif3 +
       390625*[fst4_mean]emptendif4 + 25*[fst4_mean]_cons -
       25*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.3217884   1.535321    -0.21   0.834    -3.330961    2.687385
------------------------------------------------------------------------------

. 
end of do-file
. 
. *** output tex all results
. quietly {
. }

.  
. 
. log close
      name:  <unnamed>
       log:  C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submit
> tion\Log\EstTopel.log
  log type:  text
 closed on:  18 Dec 2018, 19:56:47
---------------------------------------------------------------------------------
