---------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submit
> tion\Log\EstTopel.log
  log type:  text
 opened on:  13 Feb 2019, 17:57:43

. ** changing time treand
. qui{

. 
. local dmList Sum Sum2 Dm Dm2 Det

. foreach eq_i of local dmList{
  2.         global DmYear `dmYear`eq_i''
  3.         global FstReg `fstReg`eq_i''
  4.         global SndReg `sndReg`eq_i''
  5.         
.         dis "Year Dummy Type: `eq_i'"
  6.         do "$Code\ReadData.do"
  7.         
.         if "`eq_i'"=="Det"{
  8.                 reg realwage i.year
  9.                 predict hatwage, re
 10.                 replace realwage=hatwage
 11.         }
 12.         
.         do "$Code\EstTopel.do"
 13.         
.         *** output tex all results
.         quietly {
 14.         **** coefficients 
.         esttab fst1 fst2 fst3 fst4 ///
>         using "$Output\topel_`eq_i'.tex", ///
>         se star(* 0.1 ** 0.05 *** 0.01) b(4) ///
>         keep( ///
>                         _cons emptendif2 emptendif3 emptendif4 ///
>                         empexpdif2 empexpdif3 empexpdif4 ///
>                         ) ///
>         order( ///
>                         _cons emptendif2 emptendif3 emptendif4 ///
>                         empexpdif2 empexpdif3 empexpdif4 ///
>                         ) ///
>         coeflabel( ///
>                         _cons "Constant" ///
>                         emptendif2 "Emp.ten.$^{2}\times 100$" ///
>                         emptendif3 "Emp.ten.$^{3}\times 1000$" ///
>                         emptendif4 "Emp.ten.$^{4}\times 10000$" ///
>                         empexpdif2 "Experience$^{2}\times 100$" ///
>                         empexpdif3 "Experience$^{3}\times 1000$" ///
>                         empexpdif4 "Experience$^{4}\times 10000$" ///
>                         ) ///
>         transform( ///
>                         emptendif2 100*@ 100 ///
>                         emptendif3 1000*@ 1000 ///
>                         emptendif4 10000*@ 10000 ///
>                         empexpdif2 100*@ 100 ///
>                         empexpdif3 1000*@ 1000 ///
>                         empexpdif4 10000*@ 10000 ///
>                         ) ///
>         nodep nonote nomtitles ///
>         title("Estimation Results, using the Method of 2SFD Estimation.") ///
>         replace
 15.         }
 16. }
Year Dummy Type: Sum

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd $Inputfd

. 
. qui {

. 
end of do-file

. qui{

. 
. 
. * estimation
. forvalues i=1/4 {
  2.         **** 1st step
.         qui $FstReg ///
>                                 `contrl`i'' ///
>                                 if fst==1
  3.         est sto fst`i'
  4.         gen emptenB`i'=`LHSterm`i'' ///
>                                                                 $DmYear
  5.         gen intwemp`i'=realwage-emptenB`i'
  6.         
.         **** 2nd step
.         qui reg intwemp`i' ///
>                                 $SndReg
  7.         est sto snd`i'
  8. }
(865 missing values generated)
(1,564 missing values generated)
(930 missing values generated)
(1,624 missing values generated)
(930 missing values generated)
(1,624 missing values generated)
(930 missing values generated)
(1,624 missing values generated)

. 
. * calc. return
. ** linear
. capture program drop coef

. program coef, rclass
  1.         suest fst1 snd1
  2.         lincom [fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst1, snd1

                                                Number of obs     =      7,827

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst1_mean    |
       y2004 |          0  (omitted)
       y2005 |          0  (omitted)
       y2006 |  -.0842869   .0296247    -2.85   0.004    -.1423503   -.0262235
       y2007 |   .0127293   .0316068     0.40   0.687    -.0492188    .0746774
       y2008 |  -.0041072   .0275095    -0.15   0.881    -.0580248    .0498104
       y2009 |   .0295854    .024464     1.21   0.227    -.0183631    .0775339
       y2010 |  -.0579204   .0225544    -2.57   0.010    -.1021262   -.0137146
       y2011 |   .0566146   .0221987     2.55   0.011      .013106    .1001233
       y2012 |   .0036676   .0201565     0.18   0.856    -.0358383    .0431735
       y2013 |   -.035299   .0196541    -1.80   0.072    -.0738203    .0032223
       y2014 |   .0336794   .0209717     1.61   0.108    -.0074244    .0747831
       _cons |   .0374955   .0174829     2.14   0.032     .0032296    .0717613
-------------+----------------------------------------------------------------
fst1_lnvar   |
       _cons |  -2.001921    .056534   -35.41   0.000    -2.112725   -1.891116
-------------+----------------------------------------------------------------
snd1_mean    |
  1.dmarital |   .0428241   .0160219     2.67   0.008     .0114217    .0742265
             |
   schooling |
         12  |   .2982257   .0332736     8.96   0.000     .2330107    .3634407
         14  |   .3912636   .0371244    10.54   0.000     .3185011    .4640262
         16  |    .560658   .0348061    16.11   0.000     .4924393    .6288768
             |
  1.dregular |   .3831793   .0217354    17.63   0.000     .3405787    .4257799
    1.dunion |   .0182392   .0144904     1.26   0.208    -.0101613    .0466398
             |
         occ |
          2  |   .0533496     .67494     0.08   0.937    -1.269508    1.376208
          3  |    .116411   .6685351     0.17   0.862    -1.193894    1.426716
          4  |   -.023824   .6697857    -0.04   0.972     -1.33658    1.288932
          5  |    .207293   .6694469     0.31   0.757    -1.104799    1.519385
          6  |    .111404   .6694095     0.17   0.868    -1.200615    1.423422
          7  |   .0992385   .6697793     0.15   0.882    -1.213505    1.411982
          8  |   .1228275   .6694234     0.18   0.854    -1.189218    1.434873
          9  |   .2413315   .6698356     0.36   0.719    -1.071522    1.554185
         10  |   .2557774   .6694826     0.38   0.702    -1.056384    1.567939
         11  |  -.0646472   .6699874    -0.10   0.923    -1.377798    1.248504
         12  |   .1544855   .6724174     0.23   0.818    -1.163428    1.472399
             |
         ind |
          2  |  -.1220838   .2741651    -0.45   0.656    -.6594375    .4152699
          3  |   .3675962    .687538     0.53   0.593    -.9799535    1.715146
          4  |   .1586116   .6713447     0.24   0.813      -1.1572    1.474423
          5  |   .1695637   .6713182     0.25   0.801    -1.146196    1.485323
          6  |    .132763   .6707087     0.20   0.843    -1.181802    1.447328
          7  |   .2801764   .6730863     0.42   0.677    -1.039048    1.599401
          8  |   .2283472   .6717513     0.34   0.734    -1.088261    1.544956
          9  |   .3105505    .673454     0.46   0.645    -1.009395    1.630496
         10  |   .1551399   .6716181     0.23   0.817    -1.161207    1.471487
         11  |   .2326361   .6718288     0.35   0.729    -1.084124    1.549396
         12  |   .2530894   .6720486     0.38   0.706    -1.064102     1.57028
         13  |   .2534357    .672006     0.38   0.706    -1.063672    1.570543
         14  |   .1348291   .6715303     0.20   0.841    -1.181346    1.451004
         15  |   .2440873   .6720852     0.36   0.716    -1.073176     1.56135
         16  |   .1831946   .6712491     0.27   0.785    -1.132429    1.498819
         17  |   .0147766   .6821987     0.02   0.983    -1.322308    1.351861
         18  |   .2118113   .6742606     0.31   0.753    -1.109715    1.533338
             |
       dsize |
          1  |    .027127   .0159727     1.70   0.089    -.0041788    .0584329
          2  |   .1294393   .0159737     8.10   0.000     .0981314    .1607472
             |
  initialemp |   .0155747   .0005882    26.48   0.000     .0144218    .0167276
       _cons |   5.774715   .0664575    86.89   0.000      5.64446    5.904969
-------------+----------------------------------------------------------------
snd1_lnvar   |
       _cons |  -1.372752   .0267182   -51.38   0.000    -1.425119   -1.320386
------------------------------------------------------------------------------

 ( 1)  [fst1_mean]_cons - [snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0219208   .0175055     1.25   0.210    -.0123893    .0562309
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst1 snd1
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp])*`X'
  4.         }
  5. end

. emprtn

 ( 1)  2*[fst1_mean]_cons - 2*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0438416    .035011     1.25   0.210    -.0247787    .1124618
------------------------------------------------------------------------------

 ( 1)  5*[fst1_mean]_cons - 5*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1096039   .0875274     1.25   0.210    -.0619466    .2811544
------------------------------------------------------------------------------

 ( 1)  10*[fst1_mean]_cons - 10*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2192078   .1750548     1.25   0.210    -.1238933    .5623088
------------------------------------------------------------------------------

 ( 1)  15*[fst1_mean]_cons - 15*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3288117   .2625822     1.25   0.210    -.1858399    .8434633
------------------------------------------------------------------------------

 ( 1)  20*[fst1_mean]_cons - 20*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4384156   .3501096     1.25   0.210    -.2477866    1.124618
------------------------------------------------------------------------------

 ( 1)  25*[fst1_mean]_cons - 25*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5480195    .437637     1.25   0.210    -.3097332    1.405772
------------------------------------------------------------------------------

. 
. ** qadratic
. capture program drop coef

. program coef, rclass
  1.         suest fst2 snd2
  2.         lincom [fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst2, snd2

                                                Number of obs     =      7,824

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst2_mean    |
       y2004 |          0  (omitted)
       y2005 |          0  (omitted)
       y2006 |  -.0838644   .0296254    -2.83   0.005    -.1419291   -.0257996
       y2007 |   .0130181   .0316019     0.41   0.680    -.0489205    .0749567
       y2008 |  -.0039951   .0275242    -0.15   0.885    -.0579415    .0499514
       y2009 |   .0297254   .0244539     1.22   0.224    -.0182033     .077654
       y2010 |  -.0590085   .0225947    -2.61   0.009    -.1032932   -.0147237
       y2011 |   .0569476   .0221708     2.57   0.010     .0134936    .1004015
       y2012 |   .0042333    .020154     0.21   0.834    -.0352678    .0437345
       y2013 |  -.0349657   .0197074    -1.77   0.076    -.0735915      .00366
       y2014 |   .0330904   .0209982     1.58   0.115    -.0080654    .0742462
  emptendif2 |   6.98e-07   .0002487     0.00   0.998    -.0004867    .0004881
  empexpdif2 |  -.0003002   .0002575    -1.17   0.244    -.0008049    .0002044
       _cons |     .05262    .021795     2.41   0.016     .0099025    .0953375
-------------+----------------------------------------------------------------
fst2_lnvar   |
       _cons |  -2.001331   .0566263   -35.34   0.000    -2.112316   -1.890345
-------------+----------------------------------------------------------------
snd2_mean    |
  1.dmarital |   .0279061   .0161402     1.73   0.084     -.003728    .0595402
             |
   schooling |
         12  |   .2650323   .0323018     8.20   0.000      .201722    .3283426
         14  |   .3592661   .0362858     9.90   0.000     .2881472     .430385
         16  |   .5276969   .0339066    15.56   0.000     .4612411    .5941526
             |
  1.dregular |    .358109   .0213902    16.74   0.000      .316185     .400033
    1.dunion |   .0226974   .0145034     1.56   0.118    -.0057288    .0511235
             |
         occ |
          2  |   .0627174   .6580079     0.10   0.924    -1.226954    1.352389
          3  |   .0862087   .6447873     0.13   0.894    -1.177551    1.349969
          4  |  -.0488698    .645994    -0.08   0.940    -1.314995    1.217255
          5  |   .1735084   .6456526     0.27   0.788    -1.091948    1.438964
          6  |   .0812113   .6456092     0.13   0.900     -1.18416    1.346582
          7  |   .0713555    .645973     0.11   0.912    -1.194728    1.337439
          8  |   .0892014   .6455901     0.14   0.890    -1.176132    1.354535
          9  |   .2121124   .6460507     0.33   0.743    -1.054124    1.478348
         10  |   .2273378    .645677     0.35   0.725    -1.038166    1.492841
         11  |   -.088255   .6462087    -0.14   0.891    -1.354801    1.178291
         12  |   .1187787   .6488416     0.18   0.855    -1.152927    1.390485
             |
         ind |
          2  |  -.1146671   .2629585    -0.44   0.663    -.6300564    .4007221
          3  |   .3509381   .6637895     0.53   0.597    -.9500655    1.651942
          4  |   .1707033   .6475524     0.26   0.792    -1.098476    1.439883
          5  |   .1779928   .6475268     0.27   0.783    -1.091137    1.447122
          6  |   .1404047   .6469692     0.22   0.828    -1.127632    1.408441
          7  |   .2871636   .6494433     0.44   0.658    -.9857218    1.560049
          8  |   .2368835   .6480228     0.37   0.715    -1.033218    1.506985
          9  |   .3174642   .6497777     0.49   0.625    -.9560766    1.591005
         10  |   .1593039   .6478491     0.25   0.806    -1.110457    1.429065
         11  |   .2401488   .6480879     0.37   0.711     -1.03008    1.510378
         12  |   .2663043    .648279     0.41   0.681    -1.004299    1.536908
         13  |   .2744565   .6482511     0.42   0.672    -.9960923    1.545005
         14  |   .1431355    .647768     0.22   0.825    -1.126467    1.412737
         15  |    .258749   .6483483     0.40   0.690     -1.01199    1.529488
         16  |   .1936677   .6474762     0.30   0.765    -1.075362    1.462698
         17  |   .0424422   .6586993     0.06   0.949    -1.248585    1.333469
         18  |   .2272008   .6504579     0.35   0.727    -1.047673    1.502075
             |
       dsize |
          1  |   .0305658   .0159531     1.92   0.055    -.0007018    .0618334
          2  |   .1313392    .015952     8.23   0.000     .1000738    .1626046
             |
  initialemp |   .0309135   .0005827    53.05   0.000     .0297714    .0320556
       _cons |   5.701068   .0653399    87.25   0.000     5.573004    5.829132
-------------+----------------------------------------------------------------
snd2_lnvar   |
       _cons |  -1.378285   .0269435   -51.15   0.000    -1.431093   -1.325476
------------------------------------------------------------------------------

 ( 1)  [fst2_mean]_cons - [snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0217065   .0218037     1.00   0.319     -.021028     .064441
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst2 snd2
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp])*`X' ///
>                                 +[fst2_mean]_b[emptendif2]*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst2_mean]emptendif2 + 2*[fst2_mean]_cons - 2*[snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0434158   .0434605     1.00   0.318    -.0417651    .1285968
------------------------------------------------------------------------------

 ( 1)  25*[fst2_mean]emptendif2 + 5*[fst2_mean]_cons - 5*[snd2_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |     .10855   .1082051     1.00   0.316     -.103528     .320628
------------------------------------------------------------------------------

 ( 1)  100*[fst2_mean]emptendif2 + 10*[fst2_mean]_cons - 10*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .217135   .2154895     1.01   0.314    -.2052166    .6394866
------------------------------------------------------------------------------

 ( 1)  225*[fst2_mean]emptendif2 + 15*[fst2_mean]_cons - 15*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3257549   .3229264     1.01   0.313    -.3071693     .958679
------------------------------------------------------------------------------

 ( 1)  400*[fst2_mean]emptendif2 + 20*[fst2_mean]_cons - 20*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4344096   .4315931     1.01   0.314    -.4114972    1.280317
------------------------------------------------------------------------------

 ( 1)  625*[fst2_mean]emptendif2 + 25*[fst2_mean]_cons - 25*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5430993    .542553     1.00   0.317    -.5202849    1.606484
------------------------------------------------------------------------------

. 
. ** cubic
. capture program drop coef

. program coef, rclass
  1.         suest fst3 snd3
  2.         lincom [fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst3, snd3

                                                Number of obs     =      7,824

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst3_mean    |
       y2004 |          0  (omitted)
       y2005 |          0  (omitted)
       y2006 |  -.0833979   .0296747    -2.81   0.005    -.1415594   -.0252365
       y2007 |   .0127525   .0316267     0.40   0.687    -.0492347    .0747398
       y2008 |  -.0030057   .0275802    -0.11   0.913    -.0570618    .0510505
       y2009 |   .0293178   .0244738     1.20   0.231      -.01865    .0772855
       y2010 |  -.0592839   .0226381    -2.62   0.009    -.1036537   -.0149141
       y2011 |   .0567282     .02217     2.56   0.011     .0132758    .1001805
       y2012 |   .0038901   .0201327     0.19   0.847    -.0355694    .0433495
       y2013 |  -.0345939   .0196624    -1.76   0.079    -.0731316    .0039438
       y2014 |   .0328733   .0209412     1.57   0.116    -.0081707    .0739173
  emptendif2 |   .0018203   .0009478     1.92   0.055    -.0000374    .0036781
  empexpdif2 |  -.0018042   .0014437    -1.25   0.211    -.0046338    .0010254
  emptendif3 |  -.0000331   .0000166    -2.00   0.046    -.0000655   -5.81e-07
  empexpdif3 |   .0000218    .000018     1.21   0.226    -.0000134     .000057
       _cons |   .0589548   .0353924     1.67   0.096    -.0104131    .1283227
-------------+----------------------------------------------------------------
fst3_lnvar   |
       _cons |  -2.001785   .0565216   -35.42   0.000    -2.112566   -1.891005
-------------+----------------------------------------------------------------
snd3_mean    |
  1.dmarital |   .0160616   .0164087     0.98   0.328    -.0160987     .048222
             |
   schooling |
         12  |   .3042797   .0337413     9.02   0.000     .2381479    .3704115
         14  |   .4049963   .0375941    10.77   0.000     .3313133    .4786794
         16  |   .5782821   .0352379    16.41   0.000     .5092171    .6473471
             |
  1.dregular |   .3710958   .0214812    17.28   0.000     .3289933    .4131982
    1.dunion |   .0214561   .0146998     1.46   0.144     -.007355    .0502673
             |
         occ |
          2  |   .0974578   .6541617     0.15   0.882    -1.184676    1.379591
          3  |   .2156882   .6491051     0.33   0.740    -1.056534    1.487911
          4  |   .0838464   .6502735     0.13   0.897    -1.190666    1.358359
          5  |   .2825698   .6499324     0.43   0.664    -.9912744    1.556414
          6  |   .2028673   .6498937     0.31   0.755    -1.070901    1.476636
          7  |   .1993901   .6502589     0.31   0.759    -1.075094    1.473874
          8  |   .2215229   .6498478     0.34   0.733    -1.052155    1.495201
          9  |   .3402837   .6503467     0.52   0.601    -.9343725     1.61494
         10  |   .3538754   .6499622     0.54   0.586    -.9200271    1.627778
         11  |   .0500138   .6505325     0.08   0.939    -1.225006    1.325034
         12  |    .236533   .6531939     0.36   0.717    -1.043704     1.51677
             |
         ind |
          2  |  -.1690415   .2705885    -0.62   0.532    -.6993853    .3613022
          3  |   .2786668   .6679203     0.42   0.677    -1.030433    1.587767
          4  |   .0678188   .6518992     0.10   0.917     -1.20988    1.345518
          5  |   .0730931   .6518697     0.11   0.911    -1.204548    1.350734
          6  |   .0391385   .6513405     0.06   0.952    -1.237465    1.315742
          7  |   .1810925   .6538046     0.28   0.782    -1.100341    1.462526
          8  |   .1304295   .6523836     0.20   0.842    -1.148219    1.409078
          9  |   .2270219    .654222     0.35   0.729     -1.05523    1.509274
         10  |   .0548937   .6522013     0.08   0.933    -1.223397    1.333185
         11  |   .1363147   .6524556     0.21   0.835    -1.142475    1.415104
         12  |   .1667532   .6525888     0.26   0.798    -1.112297    1.445804
         13  |   .1650659    .652556     0.25   0.800     -1.11392    1.444052
         14  |   .0436845   .6521151     0.07   0.947    -1.234438    1.321807
         15  |    .160095   .6527253     0.25   0.806    -1.119223    1.439413
         16  |   .0888709   .6518374     0.14   0.892    -1.188707    1.366449
         17  |  -.0668748   .6637834    -0.10   0.920    -1.367866    1.234117
         18  |   .1306882   .6550476     0.20   0.842    -1.153181    1.414558
             |
       dsize |
          1  |   .0252171   .0162482     1.55   0.121    -.0066288     .057063
          2  |   .1236562   .0161958     7.64   0.000      .091913    .1553994
             |
  initialemp |   .0606217   .0005891   102.90   0.000     .0594671    .0617764
       _cons |   5.515417   .0672337    82.03   0.000     5.383642    5.647193
-------------+----------------------------------------------------------------
snd3_lnvar   |
       _cons |  -1.351488   .0265407   -50.92   0.000    -1.403507   -1.299469
------------------------------------------------------------------------------

 ( 1)  [fst3_mean]_cons - [snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0016669   .0354134    -0.05   0.962    -.0710759     .067742
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst3 snd3
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp])*`X' ///
>                                 +[fst3_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst3_mean]_b[emptendif3]*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst3_mean]emptendif2 + 8*[fst3_mean]emptendif3 + 2*[fst3_mean]_cons -
       2*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .003683   .0707346     0.05   0.958    -.1349543    .1423204
------------------------------------------------------------------------------

 ( 1)  25*[fst3_mean]emptendif2 + 125*[fst3_mean]emptendif3 + 5*[fst3_mean]_cons
       - 5*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0330416    .177339     0.19   0.852    -.3145365    .3806197
------------------------------------------------------------------------------

 ( 1)  100*[fst3_mean]emptendif2 + 1000*[fst3_mean]emptendif3 +
       10*[fst3_mean]_cons - 10*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1323067   .3593914     0.37   0.713    -.5720875    .8367008
------------------------------------------------------------------------------

 ( 1)  225*[fst3_mean]emptendif2 + 3375*[fst3_mean]emptendif3 +
       15*[fst3_mean]_cons - 15*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2730014   .5487989     0.50   0.619    -.8026247    1.348628
------------------------------------------------------------------------------

 ( 1)  400*[fst3_mean]emptendif2 + 8000*[fst3_mean]emptendif3 +
       20*[fst3_mean]_cons - 20*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4303321   .7447034     0.58   0.563     -1.02926    1.889924
------------------------------------------------------------------------------

 ( 1)  625*[fst3_mean]emptendif2 + 15625*[fst3_mean]emptendif3 +
       25*[fst3_mean]_cons - 25*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5795049   .9443908     0.61   0.539    -1.271467    2.430477
------------------------------------------------------------------------------

. 
. ** quartic
. capture program drop coef

. program coef, rclass
  1.         suest fst4 snd4
  2.         lincom [fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst4, snd4

                                                Number of obs     =      7,824

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst4_mean    |
       y2004 |          0  (omitted)
       y2005 |          0  (omitted)
       y2006 |  -.0827243   .0296605    -2.79   0.005    -.1408578   -.0245908
       y2007 |   .0135561   .0315215     0.43   0.667     -.048225    .0753372
       y2008 |  -.0042332   .0274731    -0.15   0.878    -.0580795    .0496131
       y2009 |   .0300415   .0244497     1.23   0.219    -.0178791     .077962
       y2010 |  -.0596766   .0226416    -2.64   0.008    -.1040534   -.0152998
       y2011 |   .0566234    .022168     2.55   0.011      .013175    .1000718
       y2012 |   .0048828   .0201142     0.24   0.808    -.0345402    .0443058
       y2013 |  -.0343264   .0196981    -1.74   0.081     -.072934    .0042811
       y2014 |   .0328411   .0209195     1.57   0.116    -.0081605    .0738426
  emptendif2 |  -.0002192   .0021607    -0.10   0.919    -.0044541    .0040156
  empexpdif2 |   -.006694   .0043386    -1.54   0.123    -.0151975    .0018094
  emptendif3 |   .0000605   .0000873     0.69   0.488    -.0001105    .0002315
  empexpdif3 |   .0001596   .0001184     1.35   0.178    -.0000724    .0003916
  emptendif4 |  -1.22e-06   1.09e-06    -1.12   0.264    -3.36e-06    9.20e-07
  empexpdif4 |  -1.30e-06   1.11e-06    -1.17   0.243    -3.48e-06    8.81e-07
       _cons |   .1340161    .063264     2.12   0.034      .010021    .2580112
-------------+----------------------------------------------------------------
fst4_lnvar   |
       _cons |  -2.002232   .0565235   -35.42   0.000    -2.113016   -1.891448
-------------+----------------------------------------------------------------
snd4_mean    |
  1.dmarital |   .0231831   .0162937     1.42   0.155    -.0087519    .0551182
             |
   schooling |
         12  |   .3130998    .033706     9.29   0.000     .2470372    .3791625
         14  |   .4088446   .0375374    10.89   0.000     .3352726    .4824165
         16  |   .5819831   .0352036    16.53   0.000     .5129854    .6509808
             |
  1.dregular |   .3791418   .0213765    17.74   0.000     .3372446    .4210389
    1.dunion |   .0179688    .014626     1.23   0.219    -.0106977    .0466352
             |
         occ |
          2  |   .1934562   .6638128     0.29   0.771    -1.107593    1.494505
          3  |   .2634069   .6575615     0.40   0.689     -1.02539    1.552204
          4  |   .1332946   .6587566     0.20   0.840    -1.157845    1.424434
          5  |   .3361455   .6584397     0.51   0.610    -.9543726    1.626664
          6  |   .2541003   .6583943     0.39   0.700    -1.036329    1.544529
          7  |     .24494   .6587641     0.37   0.710    -1.046214    1.536094
          8  |   .2679939   .6583788     0.41   0.684    -1.022405    1.558393
          9  |   .3876737   .6588397     0.59   0.556    -.9036284    1.678976
         10  |   .4026953   .6584685     0.61   0.541    -.8878793     1.69327
         11  |   .1001327   .6590223     0.15   0.879    -1.191527    1.391793
         12  |   .2856699   .6616292     0.43   0.666      -1.0111    1.582439
             |
         ind |
          2  |  -.2128602   .2730258    -0.78   0.436    -.7479809    .3222605
          3  |   .2021121   .6765173     0.30   0.765    -1.123837    1.528062
          4  |   .0031758    .660409     0.00   0.996    -1.291202    1.297554
          5  |   .0098369   .6603785     0.01   0.988    -1.284481    1.304155
          6  |  -.0269002   .6598099    -0.04   0.967    -1.320104    1.266303
          7  |   .1107327   .6621809     0.17   0.867    -1.187118    1.408583
          8  |   .0637873   .6608611     0.10   0.923    -1.231477    1.359051
          9  |   .1630926   .6626827     0.25   0.806    -1.135742    1.461927
         10  |  -.0126532   .6607018    -0.02   0.985    -1.307605    1.282299
         11  |   .0730443   .6609523     0.11   0.912    -1.222398    1.368487
         12  |   .0897997   .6610723     0.14   0.892    -1.205878    1.385478
         13  |    .091579   .6610495     0.14   0.890    -1.204054    1.387212
         14  |  -.0239421   .6605958    -0.04   0.971    -1.318686    1.270802
         15  |   .0862212   .6611957     0.13   0.896    -1.209699    1.382141
         16  |    .021493   .6603314     0.03   0.974    -1.272733    1.315719
         17  |  -.1470703   .6720233    -0.22   0.827    -1.464212    1.170071
         18  |   .0519477   .6636228     0.08   0.938    -1.248729    1.352624
             |
       dsize |
          1  |    .026011    .016138     1.61   0.107    -.0056189    .0576409
          2  |   .1265567    .016138     7.84   0.000     .0949267    .1581866
             |
  initialemp |   .1249588   .0005884   212.36   0.000     .1238055    .1261121
       _cons |   5.295411    .067394    78.57   0.000     5.163321      5.4275
-------------+----------------------------------------------------------------
snd4_lnvar   |
       _cons |  -1.356953   .0265262   -51.16   0.000    -1.408943   -1.304962
------------------------------------------------------------------------------

 ( 1)  [fst4_mean]_cons - [snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0090573    .063263     0.14   0.886    -.1149358    .1330504
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst4 snd4
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp])*`X' ///
>                                 +[fst4_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif3]*`X'*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif4]*`X'*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst4_mean]emptendif2 + 8*[fst4_mean]emptendif3 +
       16*[fst4_mean]emptendif4 + 2*[fst4_mean]_cons - 2*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .017702   .1257806     0.14   0.888    -.2288236    .2642275
------------------------------------------------------------------------------

 ( 1)  25*[fst4_mean]emptendif2 + 125*[fst4_mean]emptendif3 +
       625*[fst4_mean]emptendif4 + 5*[fst4_mean]_cons - 5*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0466025   .3141499     0.15   0.882      -.56912     .662325
------------------------------------------------------------------------------

 ( 1)  100*[fst4_mean]emptendif2 + 1000*[fst4_mean]emptendif3 +
       10000*[fst4_mean]emptendif4 + 10*[fst4_mean]_cons -
       10*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1169143   .6335105     0.18   0.854    -1.124743    1.358572
------------------------------------------------------------------------------

 ( 1)  225*[fst4_mean]emptendif2 + 3375*[fst4_mean]emptendif3 +
       50625*[fst4_mean]emptendif4 + 15*[fst4_mean]_cons -
       15*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2288019   .9601111     0.24   0.812    -1.652981    2.110585
------------------------------------------------------------------------------

 ( 1)  400*[fst4_mean]emptendif2 + 8000*[fst4_mean]emptendif3 +
       160000*[fst4_mean]emptendif4 + 20*[fst4_mean]_cons -
       20*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3817987   1.290327     0.30   0.767    -2.147195    2.910793
------------------------------------------------------------------------------

 ( 1)  625*[fst4_mean]emptendif2 + 15625*[fst4_mean]emptendif3 +
       390625*[fst4_mean]emptendif4 + 25*[fst4_mean]_cons -
       25*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5571049   1.620847     0.34   0.731    -2.619696    3.733906
------------------------------------------------------------------------------

. 
end of do-file
Year Dummy Type: Sum2

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd $Inputfd

. 
. qui {

. 
end of do-file

. qui{

. 
. 
. * estimation
. forvalues i=1/4 {
  2.         **** 1st step
.         qui $FstReg ///
>                                 `contrl`i'' ///
>                                 if fst==1
  3.         est sto fst`i'
  4.         gen emptenB`i'=`LHSterm`i'' ///
>                                                                 $DmYear
  5.         gen intwemp`i'=realwage-emptenB`i'
  6.         
.         **** 2nd step
.         qui reg intwemp`i' ///
>                                 $SndReg
  7.         est sto snd`i'
  8. }
(865 missing values generated)
(1,564 missing values generated)
(930 missing values generated)
(1,624 missing values generated)
(930 missing values generated)
(1,624 missing values generated)
(930 missing values generated)
(1,624 missing values generated)

. 
. * calc. return
. ** linear
. capture program drop coef

. program coef, rclass
  1.         suest fst1 snd1
  2.         lincom [fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst1, snd1

                                                Number of obs     =      7,827

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst1_mean    |
       y2004 |          0  (omitted)
       y2005 |          0  (omitted)
       y2006 |  -.0842869   .0296247    -2.85   0.004    -.1423503   -.0262235
       y2007 |   .0127293   .0316068     0.40   0.687    -.0492188    .0746774
       y2008 |  -.0041072   .0275095    -0.15   0.881    -.0580248    .0498104
       y2009 |   .0295854    .024464     1.21   0.227    -.0183631    .0775339
       y2010 |  -.0579204   .0225544    -2.57   0.010    -.1021262   -.0137146
       y2011 |   .0566146   .0221987     2.55   0.011      .013106    .1001233
       y2012 |   .0036676   .0201565     0.18   0.856    -.0358383    .0431735
       y2013 |   -.035299   .0196541    -1.80   0.072    -.0738203    .0032223
       y2014 |   .0336794   .0209717     1.61   0.108    -.0074244    .0747831
       _cons |   .0374955   .0174829     2.14   0.032     .0032296    .0717613
-------------+----------------------------------------------------------------
fst1_lnvar   |
       _cons |  -2.001921    .056534   -35.41   0.000    -2.112725   -1.891116
-------------+----------------------------------------------------------------
snd1_mean    |
        year |
       2005  |   .1043792   .0335119     3.11   0.002     .0386972    .1700613
       2006  |   .1537203   .0325435     4.72   0.000     .0899361    .2175045
       2007  |   .1026136   .0297268     3.45   0.001     .0443502     .160877
       2008  |   .1030865   .0290432     3.55   0.000     .0461628    .1600102
       2009  |   .1092789   .0264332     4.13   0.000     .0574708     .161087
       2010  |   .1263684    .026575     4.76   0.000     .0742824    .1784543
       2011  |   .0725566   .0267603     2.71   0.007     .0201074    .1250058
       2012  |   .0662905    .026464     2.50   0.012      .014422     .118159
       2013  |   .0882815   .0278187     3.17   0.002     .0337578    .1428053
       2014  |   .0677515   .0279299     2.43   0.015       .01301    .1224931
             |
  1.dmarital |   .0414001   .0159476     2.60   0.009     .0101433    .0726568
             |
   schooling |
         12  |   .2950413   .0332841     8.86   0.000     .2298057    .3602768
         14  |   .3877069   .0371236    10.44   0.000      .314946    .4604678
         16  |   .5567222   .0348949    15.95   0.000     .4883295    .6251149
             |
  1.dregular |   .3846969   .0216519    17.77   0.000     .3422599    .4271339
    1.dunion |   .0177273   .0144878     1.22   0.221    -.0106683    .0461229
             |
         occ |
          2  |   .0853802   .6807527     0.13   0.900    -1.248871    1.419631
          3  |   .1120011   .6784141     0.17   0.869    -1.217666    1.441668
          4  |  -.0248406   .6796268    -0.04   0.971    -1.356885    1.307203
          5  |   .2025048   .6793176     0.30   0.766    -1.128933    1.533943
          6  |   .1063036   .6792895     0.16   0.876    -1.225079    1.437687
          7  |   .0922961   .6796686     0.14   0.892     -1.23983    1.424422
          8  |   .1191492   .6793322     0.18   0.861    -1.212317    1.450616
          9  |   .2536612   .6795822     0.37   0.709    -1.078296    1.585618
         10  |   .2430942   .6794408     0.36   0.721    -1.088585    1.574774
         11  |  -.0605064   .6798074    -0.09   0.929    -1.392905    1.271892
         12  |   .1347995   .6821924     0.20   0.843    -1.202273    1.471872
             |
         ind |
          2  |  -.0899861   .2762991    -0.33   0.745    -.6315224    .4515503
          3  |   .3683252   .6966391     0.53   0.597    -.9970623    1.733713
          4  |   .1679266   .6811306     0.25   0.805    -1.167065    1.502918
          5  |   .1787107   .6811311     0.26   0.793    -1.156282    1.513703
          6  |   .1413182   .6804552     0.21   0.835    -1.192349    1.474986
          7  |   .2850292   .6828044     0.42   0.676    -1.053243    1.623301
          8  |   .2372327    .681539     0.35   0.728    -1.098559    1.573025
          9  |   .3185453   .6832029     0.47   0.641    -1.020508    1.657598
         10  |   .1665258   .6813612     0.24   0.807    -1.168918    1.501969
         11  |   .2368817    .681566     0.35   0.728    -1.098963    1.572726
         12  |   .2581351   .6817987     0.38   0.705    -1.078166    1.594436
         13  |   .2638285    .681872     0.39   0.699    -1.072616    1.600273
         14  |   .1459641   .6812975     0.21   0.830    -1.189355    1.481283
         15  |     .27477   .6821002     0.40   0.687    -1.062122    1.611662
         16  |   .1851377   .6809765     0.27   0.786    -1.149552    1.519827
         17  |   .1015037   .6930719     0.15   0.884    -1.256892      1.4599
         18  |   .2071184   .6840658     0.30   0.762    -1.133626    1.547863
             |
       dsize |
          1  |   .0268499   .0159409     1.68   0.092    -.0043936    .0580934
          2  |   .1286643   .0159693     8.06   0.000      .097365    .1599636
             |
  initialemp |   .0155656   .0005879    26.48   0.000     .0144134    .0167178
       _cons |   5.684727   .0674661    84.26   0.000     5.552495    5.816958
-------------+----------------------------------------------------------------
snd1_lnvar   |
       _cons |  -1.375712   .0266528   -51.62   0.000     -1.42795   -1.323473
------------------------------------------------------------------------------

 ( 1)  [fst1_mean]_cons - [snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0219298    .017503     1.25   0.210    -.0123755    .0562352
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst1 snd1
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp])*`X'
  4.         }
  5. end

. emprtn

 ( 1)  2*[fst1_mean]_cons - 2*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0438597   .0350061     1.25   0.210     -.024751    .1124704
------------------------------------------------------------------------------

 ( 1)  5*[fst1_mean]_cons - 5*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1096492   .0875152     1.25   0.210    -.0618775    .2811759
------------------------------------------------------------------------------

 ( 1)  10*[fst1_mean]_cons - 10*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2192984   .1750304     1.25   0.210    -.1237549    .5623518
------------------------------------------------------------------------------

 ( 1)  15*[fst1_mean]_cons - 15*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3289476   .2625457     1.25   0.210    -.1856324    .8435277
------------------------------------------------------------------------------

 ( 1)  20*[fst1_mean]_cons - 20*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4385968   .3500609     1.25   0.210    -.2475099    1.124704
------------------------------------------------------------------------------

 ( 1)  25*[fst1_mean]_cons - 25*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5482461   .4375761     1.25   0.210    -.3093874    1.405879
------------------------------------------------------------------------------

. 
. ** qadratic
. capture program drop coef

. program coef, rclass
  1.         suest fst2 snd2
  2.         lincom [fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst2, snd2

                                                Number of obs     =      7,824

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst2_mean    |
       y2004 |          0  (omitted)
       y2005 |          0  (omitted)
       y2006 |  -.0838644   .0296254    -2.83   0.005    -.1419291   -.0257996
       y2007 |   .0130181   .0316019     0.41   0.680    -.0489205    .0749567
       y2008 |  -.0039951   .0275242    -0.15   0.885    -.0579415    .0499514
       y2009 |   .0297254   .0244539     1.22   0.224    -.0182033     .077654
       y2010 |  -.0590085   .0225947    -2.61   0.009    -.1032932   -.0147237
       y2011 |   .0569476   .0221708     2.57   0.010     .0134936    .1004015
       y2012 |   .0042333    .020154     0.21   0.834    -.0352678    .0437345
       y2013 |  -.0349657   .0197074    -1.77   0.076    -.0735915      .00366
       y2014 |   .0330904   .0209982     1.58   0.115    -.0080654    .0742462
  emptendif2 |   6.98e-07   .0002487     0.00   0.998    -.0004867    .0004881
  empexpdif2 |  -.0003002   .0002575    -1.17   0.244    -.0008049    .0002044
       _cons |     .05262    .021795     2.41   0.016     .0099025    .0953375
-------------+----------------------------------------------------------------
fst2_lnvar   |
       _cons |  -2.001331   .0566263   -35.34   0.000    -2.112316   -1.890345
-------------+----------------------------------------------------------------
snd2_mean    |
        year |
       2005  |   .1024653   .0334249     3.07   0.002     .0369537    .1679769
       2006  |   .1484592   .0324676     4.57   0.000     .0848238    .2120946
       2007  |   .0999828   .0295826     3.38   0.001     .0420021    .1579636
       2008  |   .0994917   .0288902     3.44   0.001     .0428679    .1561155
       2009  |   .1068835   .0263563     4.06   0.000     .0552262    .1585409
       2010  |   .1240365   .0265423     4.67   0.000     .0720145    .1760584
       2011  |    .068618   .0266997     2.57   0.010     .0162876    .1209484
       2012  |   .0629364   .0263736     2.39   0.017     .0112451    .1146277
       2013  |   .0827967    .027733     2.99   0.003      .028441    .1371523
       2014  |   .0636981   .0277883     2.29   0.022      .009234    .1181622
             |
  1.dmarital |   .0264801   .0160671     1.65   0.099    -.0050108     .057971
             |
   schooling |
         12  |   .2621555   .0323008     8.12   0.000      .198847     .325464
         14  |   .3561238   .0362674     9.82   0.000      .285041    .4272067
         16  |   .5241638    .033982    15.42   0.000     .4575602    .5907673
             |
  1.dregular |   .3596258   .0213029    16.88   0.000     .3178729    .4013787
    1.dunion |    .022131   .0145009     1.53   0.127    -.0062902    .0505521
             |
         occ |
          2  |   .0942241   .6611502     0.14   0.887    -1.201606    1.390055
          3  |   .0835016   .6544051     0.13   0.898    -1.199109    1.366112
          4  |  -.0482486   .6555736    -0.07   0.941    -1.333149    1.236652
          5  |   .1703893   .6552625     0.26   0.795    -1.113902     1.45468
          6  |   .0777644    .655229     0.12   0.906    -1.206461     1.36199
          7  |   .0660555   .6556005     0.10   0.920    -1.218898    1.351009
          8  |   .0872424   .6552384     0.13   0.894    -1.197001    1.371486
          9  |   .2255901   .6555388     0.34   0.731    -1.059242    1.510422
         10  |   .2166024   .6553738     0.33   0.741    -1.067907    1.501111
         11  |  -.0827894     .65577    -0.13   0.900    -1.368075    1.202496
         12  |   .1004955   .6583604     0.15   0.879    -1.189867    1.390858
             |
         ind |
          2  |  -.0840674   .2647749    -0.32   0.751    -.6030166    .4348818
          3  |   .3498494   .6726341     0.52   0.603    -.9684891    1.668188
          4  |   .1777659   .6570582     0.27   0.787    -1.110045    1.465576
          5  |   .1848982   .6570607     0.28   0.778    -1.102917    1.472714
          6  |   .1468287   .6564363     0.22   0.823    -1.139763     1.43342
          7  |   .2898882   .6588812     0.44   0.660    -1.001495    1.581272
          8  |   .2436196   .6575314     0.37   0.711    -1.045118    1.532357
          9  |   .3233372   .6592503     0.49   0.624    -.9687696    1.615444
         10  |   .1686498   .6573121     0.26   0.798    -1.119658    1.456958
         11  |   .2423612   .6575449     0.37   0.712    -1.046403    1.531125
         12  |   .2693317   .6577499     0.41   0.682    -1.019834    1.558498
         13  |    .282378   .6578381     0.43   0.668    -1.006961    1.571717
         14  |    .152203   .6572557     0.23   0.817    -1.135994      1.4404
         15  |   .2865543   .6580889     0.44   0.663    -1.003276    1.576385
         16  |   .1936821   .6569225     0.29   0.768    -1.093862    1.481227
         17  |   .1240492   .6692357     0.19   0.853    -1.187629    1.435727
         18  |   .2201314   .6599883     0.33   0.739    -1.073422    1.513685
             |
       dsize |
          1  |   .0302419   .0159226     1.90   0.058    -.0009659    .0614496
          2  |   .1305888    .015947     8.19   0.000     .0993332    .1618443
             |
  initialemp |    .030906   .0005824    53.07   0.000     .0297645    .0320474
       _cons |   5.614456   .0662925    84.69   0.000     5.484525    5.744387
-------------+----------------------------------------------------------------
snd2_lnvar   |
       _cons |  -1.381173   .0268743   -51.39   0.000    -1.433845     -1.3285
------------------------------------------------------------------------------

 ( 1)  [fst2_mean]_cons - [snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0217141   .0218024     1.00   0.319    -.0210178    .0644459
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst2 snd2
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp])*`X' ///
>                                 +[fst2_mean]_b[emptendif2]*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst2_mean]emptendif2 + 2*[fst2_mean]_cons - 2*[snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0434309   .0434578     1.00   0.318    -.0417448    .1286066
------------------------------------------------------------------------------

 ( 1)  25*[fst2_mean]emptendif2 + 5*[fst2_mean]_cons - 5*[snd2_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1085878   .1081981     1.00   0.316    -.1034766    .3206521
------------------------------------------------------------------------------

 ( 1)  100*[fst2_mean]emptendif2 + 10*[fst2_mean]_cons - 10*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2172104   .2154749     1.01   0.313    -.2051127    .6395336
------------------------------------------------------------------------------

 ( 1)  225*[fst2_mean]emptendif2 + 15*[fst2_mean]_cons - 15*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .325868   .3229038     1.01   0.313    -.3070118    .9587477
------------------------------------------------------------------------------

 ( 1)  400*[fst2_mean]emptendif2 + 20*[fst2_mean]_cons - 20*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4345605   .4315619     1.01   0.314    -.4112852    1.280406
------------------------------------------------------------------------------

 ( 1)  625*[fst2_mean]emptendif2 + 25*[fst2_mean]_cons - 25*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5432879   .5425128     1.00   0.317    -.5200176    1.606593
------------------------------------------------------------------------------

. 
. ** cubic
. capture program drop coef

. program coef, rclass
  1.         suest fst3 snd3
  2.         lincom [fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst3, snd3

                                                Number of obs     =      7,824

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst3_mean    |
       y2004 |          0  (omitted)
       y2005 |          0  (omitted)
       y2006 |  -.0833979   .0296747    -2.81   0.005    -.1415594   -.0252365
       y2007 |   .0127525   .0316267     0.40   0.687    -.0492347    .0747398
       y2008 |  -.0030057   .0275802    -0.11   0.913    -.0570618    .0510505
       y2009 |   .0293178   .0244738     1.20   0.231      -.01865    .0772855
       y2010 |  -.0592839   .0226381    -2.62   0.009    -.1036537   -.0149141
       y2011 |   .0567282     .02217     2.56   0.011     .0132758    .1001805
       y2012 |   .0038901   .0201327     0.19   0.847    -.0355694    .0433495
       y2013 |  -.0345939   .0196624    -1.76   0.079    -.0731316    .0039438
       y2014 |   .0328733   .0209412     1.57   0.116    -.0081707    .0739173
  emptendif2 |   .0018203   .0009478     1.92   0.055    -.0000374    .0036781
  empexpdif2 |  -.0018042   .0014437    -1.25   0.211    -.0046338    .0010254
  emptendif3 |  -.0000331   .0000166    -2.00   0.046    -.0000655   -5.81e-07
  empexpdif3 |   .0000218    .000018     1.21   0.226    -.0000134     .000057
       _cons |   .0589548   .0353924     1.67   0.096    -.0104131    .1283227
-------------+----------------------------------------------------------------
fst3_lnvar   |
       _cons |  -2.001785   .0565216   -35.42   0.000    -2.112566   -1.891005
-------------+----------------------------------------------------------------
snd3_mean    |
        year |
       2005  |   .1026381   .0339551     3.02   0.003     .0360873    .1691888
       2006  |   .1470948   .0328035     4.48   0.000     .0828011    .2113886
       2007  |   .1001847   .0300276     3.34   0.001     .0413317    .1590377
       2008  |   .0968621    .029329     3.30   0.001     .0393783    .1543459
       2009  |   .1035732   .0268003     3.86   0.000     .0510456    .1561008
       2010  |   .1195479   .0269648     4.43   0.000     .0666979     .172398
       2011  |   .0622034   .0271495     2.29   0.022     .0089913    .1154155
       2012  |   .0581037   .0268004     2.17   0.030     .0055759    .1106315
       2013  |   .0781191   .0281411     2.78   0.006     .0229635    .1332747
       2014  |   .0602699    .028152     2.14   0.032      .005093    .1154467
             |
  1.dmarital |   .0144664    .016335     0.89   0.376    -.0175497    .0464825
             |
   schooling |
         12  |   .3018128    .033766     8.94   0.000     .2356326    .3679929
         14  |   .4025096     .03761    10.70   0.000     .3287953     .476224
         16  |   .5753629   .0353428    16.28   0.000     .5060923    .6446335
             |
  1.dregular |   .3726888    .021391    17.42   0.000     .3307632    .4146144
    1.dunion |   .0209155   .0146993     1.42   0.155    -.0078946    .0497257
             |
         occ |
          2  |   .1276574   .6596728     0.19   0.847    -1.165277    1.420592
          3  |   .2149256    .658093     0.33   0.744    -1.074913    1.504764
          4  |   .0864377   .6592221     0.13   0.896    -1.205614    1.378489
          5  |   .2813666   .6589065     0.43   0.669    -1.010066      1.5728
          6  |   .2013494   .6588798     0.31   0.760    -1.090031     1.49273
          7  |   .1959816   .6592524     0.30   0.766    -1.096129    1.488092
          8  |    .221594   .6588623     0.34   0.737    -1.069752     1.51294
          9  |   .3551984   .6591966     0.54   0.590    -.9368032      1.6472
         10  |   .3452745   .6590254     0.52   0.600    -.9463917    1.636941
         11  |    .057117   .6594478     0.09   0.931    -1.235377    1.349611
         12  |   .2195268   .6620827     0.33   0.740    -1.078131    1.517185
             |
         ind |
          2  |  -.1404766   .2728773    -0.51   0.607    -.6753063    .3943532
          3  |   .2754777   .6760593     0.41   0.684    -1.049574     1.60053
          4  |   .0722228   .6607347     0.11   0.913    -1.222793    1.367239
          5  |     .07736   .6607345     0.12   0.907    -1.217656    1.372376
          6  |   .0430963   .6601392     0.07   0.948    -1.250753    1.336945
          7  |   .1812788   .6625813     0.27   0.784    -1.117357    1.479914
          8  |    .134734    .661221     0.20   0.839    -1.161235    1.430703
          9  |   .2304596   .6630364     0.35   0.728    -1.069068    1.529987
         10  |   .0619098   .6609948     0.09   0.925    -1.233616    1.357436
         11  |   .1360999   .6612392     0.21   0.837    -1.159905    1.432105
         12  |   .1672645   .6613873     0.25   0.800    -1.129031     1.46356
         13  |   .1702357   .6614788     0.26   0.797    -1.126239     1.46671
         14  |   .0504134   .6609313     0.08   0.939    -1.244988    1.345815
         15  |   .1849538   .6618007     0.28   0.780    -1.112152    1.482059
         16  |   .0865693    .660613     0.13   0.896    -1.208208    1.381347
         17  |   .0093111   .6736063     0.01   0.989    -1.310933    1.329555
         18  |   .1204344   .6639272     0.18   0.856    -1.180839    1.421708
             |
       dsize |
          1  |   .0249005   .0162187     1.54   0.125    -.0068875    .0566886
          2  |   .1229569   .0161901     7.59   0.000      .091225    .1546889
             |
  initialemp |   .0606176   .0005887   102.96   0.000     .0594637    .0617715
       _cons |   5.432192   .0678319    80.08   0.000     5.299244     5.56514
-------------+----------------------------------------------------------------
snd3_lnvar   |
       _cons |  -1.354304   .0264613   -51.18   0.000    -1.406167   -1.302441
------------------------------------------------------------------------------

 ( 1)  [fst3_mean]_cons - [snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0016628   .0354123    -0.05   0.963    -.0710697    .0677441
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst3 snd3
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp])*`X' ///
>                                 +[fst3_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst3_mean]_b[emptendif3]*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst3_mean]emptendif2 + 8*[fst3_mean]emptendif3 + 2*[fst3_mean]_cons -
       2*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0036913   .0707326     0.05   0.958     -.134942    .1423246
------------------------------------------------------------------------------

 ( 1)  25*[fst3_mean]emptendif2 + 125*[fst3_mean]emptendif3 + 5*[fst3_mean]_cons
       - 5*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0330623    .177334     0.19   0.852    -.3145059    .3806304
------------------------------------------------------------------------------

 ( 1)  100*[fst3_mean]emptendif2 + 1000*[fst3_mean]emptendif3 +
       10*[fst3_mean]_cons - 10*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .132348   .3593817     0.37   0.713    -.5720272    .8367232
------------------------------------------------------------------------------

 ( 1)  225*[fst3_mean]emptendif2 + 3375*[fst3_mean]emptendif3 +
       15*[fst3_mean]_cons - 15*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2730634   .5487849     0.50   0.619    -.8025352    1.348662
------------------------------------------------------------------------------

 ( 1)  400*[fst3_mean]emptendif2 + 8000*[fst3_mean]emptendif3 +
       20*[fst3_mean]_cons - 20*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4304147    .744685     0.58   0.563    -1.029141    1.889971
------------------------------------------------------------------------------

 ( 1)  625*[fst3_mean]emptendif2 + 15625*[fst3_mean]emptendif3 +
       25*[fst3_mean]_cons - 25*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5796082   .9443677     0.61   0.539    -1.271318    2.430535
------------------------------------------------------------------------------

. 
. ** quartic
. capture program drop coef

. program coef, rclass
  1.         suest fst4 snd4
  2.         lincom [fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst4, snd4

                                                Number of obs     =      7,824

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst4_mean    |
       y2004 |          0  (omitted)
       y2005 |          0  (omitted)
       y2006 |  -.0827243   .0296605    -2.79   0.005    -.1408578   -.0245908
       y2007 |   .0135561   .0315215     0.43   0.667     -.048225    .0753372
       y2008 |  -.0042332   .0274731    -0.15   0.878    -.0580795    .0496131
       y2009 |   .0300415   .0244497     1.23   0.219    -.0178791     .077962
       y2010 |  -.0596766   .0226416    -2.64   0.008    -.1040534   -.0152998
       y2011 |   .0566234    .022168     2.55   0.011      .013175    .1000718
       y2012 |   .0048828   .0201142     0.24   0.808    -.0345402    .0443058
       y2013 |  -.0343264   .0196981    -1.74   0.081     -.072934    .0042811
       y2014 |   .0328411   .0209195     1.57   0.116    -.0081605    .0738426
  emptendif2 |  -.0002192   .0021607    -0.10   0.919    -.0044541    .0040156
  empexpdif2 |   -.006694   .0043386    -1.54   0.123    -.0151975    .0018094
  emptendif3 |   .0000605   .0000873     0.69   0.488    -.0001105    .0002315
  empexpdif3 |   .0001596   .0001184     1.35   0.178    -.0000724    .0003916
  emptendif4 |  -1.22e-06   1.09e-06    -1.12   0.264    -3.36e-06    9.20e-07
  empexpdif4 |  -1.30e-06   1.11e-06    -1.17   0.243    -3.48e-06    8.81e-07
       _cons |   .1340161    .063264     2.12   0.034      .010021    .2580112
-------------+----------------------------------------------------------------
fst4_lnvar   |
       _cons |  -2.002232   .0565235   -35.42   0.000    -2.113016   -1.891448
-------------+----------------------------------------------------------------
snd4_mean    |
        year |
       2005  |   .1006556   .0339078     2.97   0.003     .0341976    .1671135
       2006  |   .1481672   .0326919     4.53   0.000     .0840922    .2122421
       2007  |   .0999961   .0300019     3.33   0.001     .0411935    .1587987
       2008  |   .0941062   .0293774     3.20   0.001     .0365276    .1516848
       2009  |   .1017493   .0267504     3.80   0.000     .0493196     .154179
       2010  |   .1198673   .0269552     4.45   0.000     .0670361    .1726984
       2011  |   .0622662   .0270755     2.30   0.021     .0091993    .1153332
       2012  |   .0567488   .0267059     2.12   0.034     .0044062    .1090914
       2013  |   .0785429   .0280477     2.80   0.005     .0235704    .1335153
       2014  |   .0620517   .0280492     2.21   0.027     .0070763    .1170271
             |
  1.dmarital |   .0216152   .0162238     1.33   0.183    -.0101829    .0534134
             |
   schooling |
         12  |   .3105968   .0337203     9.21   0.000     .2445062    .3766874
         14  |   .4062534   .0375403    10.82   0.000     .3326759     .479831
         16  |   .5789868   .0352978    16.40   0.000     .5098044    .6481691
             |
  1.dregular |   .3807145   .0212937    17.88   0.000     .3389796    .4224494
    1.dunion |   .0174772   .0146263     1.19   0.232    -.0111898    .0461442
             |
         occ |
          2  |   .2238405   .6682272     0.33   0.738    -1.085861    1.533542
          3  |   .2622391   .6659204     0.39   0.694    -1.042941    1.567419
          4  |   .1354114   .6670811     0.20   0.839    -1.172044    1.442866
          5  |   .3345378   .6667853     0.50   0.616    -.9723374    1.641413
          6  |   .2522224   .6667511     0.38   0.705    -1.054586     1.55903
          7  |   .2412733   .6671317     0.36   0.718    -1.066281    1.548827
          8  |    .267654   .6667646     0.40   0.688    -1.039181    1.574489
          9  |   .4021182    .667062     0.60   0.547    -.9052992    1.709536
         10  |   .3937451   .6669042     0.59   0.555    -.9133631    1.700853
         11  |   .1067902   .6673149     0.16   0.873    -1.201123    1.414703
         12  |    .268671   .6698854     0.40   0.688     -1.04428    1.581622
             |
         ind |
          2  |  -.1840496   .2752635    -0.67   0.504    -.7235562    .3554571
          3  |   .1996171   .6840128     0.29   0.770    -1.141023    1.540258
          4  |   .0082013    .668623     0.01   0.990    -1.302276    1.318678
          5  |   .0147057   .6686208     0.02   0.982    -1.295767    1.325178
          6  |  -.0223923    .667987    -0.03   0.973    -1.331623    1.286838
          7  |   .1115829   .6703386     0.17   0.868    -1.202257    1.425423
          8  |   .0687396   .6690792     0.10   0.918    -1.242631    1.380111
          9  |    .166989   .6708799     0.25   0.803    -1.147912     1.48189
         10  |  -.0051947   .6688756    -0.01   0.994    -1.316167    1.305777
         11  |   .0735118   .6691139     0.11   0.913    -1.237927    1.384951
         12  |   .0908718   .6692494     0.14   0.892    -1.220833    1.402577
         13  |   .0974436   .6693538     0.15   0.884    -1.214466    1.409353
         14  |  -.0167929   .6687907    -0.03   0.980    -1.327599    1.294013
         15  |   .1115082   .6696514     0.17   0.868    -1.200984    1.424001
         16  |    .019817   .6684868     0.03   0.976    -1.290393    1.330027
         17  |  -.0706888   .6812625    -0.10   0.917    -1.405939    1.264561
         18  |    .042633   .6718728     0.06   0.949    -1.274214    1.359479
             |
       dsize |
          1  |   .0257703    .016108     1.60   0.110    -.0058008    .0573414
          2  |   .1258786   .0161335     7.80   0.000     .0942574    .1574997
             |
  initialemp |   .1249559    .000588   212.50   0.000     .1238034    .1261084
       _cons |   5.212378   .0681595    76.47   0.000     5.078788    5.345968
-------------+----------------------------------------------------------------
snd4_lnvar   |
       _cons |   -1.35976   .0264444   -51.42   0.000     -1.41159    -1.30793
------------------------------------------------------------------------------

 ( 1)  [fst4_mean]_cons - [snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0090602   .0632621     0.14   0.886    -.1149312    .1330517
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst4 snd4
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp])*`X' ///
>                                 +[fst4_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif3]*`X'*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif4]*`X'*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst4_mean]emptendif2 + 8*[fst4_mean]emptendif3 +
       16*[fst4_mean]emptendif4 + 2*[fst4_mean]_cons - 2*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0177078   .1257789     0.14   0.888    -.2288142    .2642299
------------------------------------------------------------------------------

 ( 1)  25*[fst4_mean]emptendif2 + 125*[fst4_mean]emptendif3 +
       625*[fst4_mean]emptendif4 + 5*[fst4_mean]_cons - 5*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .046617   .3141453     0.15   0.882    -.5690964    .6623305
------------------------------------------------------------------------------

 ( 1)  100*[fst4_mean]emptendif2 + 1000*[fst4_mean]emptendif3 +
       10000*[fst4_mean]emptendif4 + 10*[fst4_mean]_cons -
       10*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1169434   .6335009     0.18   0.854    -1.124695    1.358582
------------------------------------------------------------------------------

 ( 1)  225*[fst4_mean]emptendif2 + 3375*[fst4_mean]emptendif3 +
       50625*[fst4_mean]emptendif4 + 15*[fst4_mean]_cons -
       15*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2288456   .9600967     0.24   0.812    -1.652909    2.110601
------------------------------------------------------------------------------

 ( 1)  400*[fst4_mean]emptendif2 + 8000*[fst4_mean]emptendif3 +
       160000*[fst4_mean]emptendif4 + 20*[fst4_mean]_cons -
       20*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .381857   1.290308     0.30   0.767      -2.1471    2.910814
------------------------------------------------------------------------------

 ( 1)  625*[fst4_mean]emptendif2 + 15625*[fst4_mean]emptendif3 +
       390625*[fst4_mean]emptendif4 + 25*[fst4_mean]_cons -
       25*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5571778   1.620823     0.34   0.731    -2.619577    3.733933
------------------------------------------------------------------------------

. 
end of do-file
Year Dummy Type: Dm

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd $Inputfd

. 
. qui {

. 
end of do-file

. qui{

. 
. 
. * estimation
. forvalues i=1/4 {
  2.         **** 1st step
.         qui $FstReg ///
>                                 `contrl`i'' ///
>                                 if fst==1
  3.         est sto fst`i'
  4.         gen emptenB`i'=`LHSterm`i'' ///
>                                                                 $DmYear
  5.         gen intwemp`i'=realwage-emptenB`i'
  6.         
.         **** 2nd step
.         qui reg intwemp`i' ///
>                                 $SndReg
  7.         est sto snd`i'
  8. }
(865 missing values generated)
(1,564 missing values generated)
(930 missing values generated)
(1,624 missing values generated)
(930 missing values generated)
(1,624 missing values generated)
(930 missing values generated)
(1,624 missing values generated)

. 
. * calc. return
. ** linear
. capture program drop coef

. program coef, rclass
  1.         suest fst1 snd1
  2.         lincom [fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst1, snd1

                                                Number of obs     =      7,827

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst1_mean    |
       dyear |
       2006  |  -.0842869   .0296247    -2.85   0.004    -.1423503   -.0262235
       2007  |  -.0715576   .0270678    -2.64   0.008    -.1246095   -.0185057
       2008  |  -.0756648   .0252074    -3.00   0.003    -.1250703   -.0262593
       2009  |  -.0460794   .0239662    -1.92   0.055    -.0930522    .0008935
       2010  |  -.1039997   .0233586    -4.45   0.000    -.1497818   -.0582177
       2011  |  -.0473851   .0236317    -2.01   0.045    -.0937025   -.0010677
       2012  |  -.0437175   .0214272    -2.04   0.041    -.0857141   -.0017209
       2013  |  -.0790165   .0232048    -3.41   0.001     -.124497    -.033536
       2014  |  -.0453371   .0226419    -2.00   0.045    -.0897144   -.0009599
             |
       _cons |   .0374955   .0174829     2.14   0.032     .0032296    .0717613
-------------+----------------------------------------------------------------
fst1_lnvar   |
       _cons |  -2.001921    .056534   -35.41   0.000    -2.112725   -1.891116
-------------+----------------------------------------------------------------
snd1_mean    |
        year |
       2005  |   .1043792   .0335119     3.11   0.002     .0386971    .1700613
       2006  |   .0694334   .0325436     2.13   0.033     .0056492    .1332176
       2007  |    .031056   .0297268     1.04   0.296    -.0272074    .0893195
       2008  |   .0274218   .0290432     0.94   0.345    -.0295019    .0843455
       2009  |   .0631995   .0264332     2.39   0.017     .0113914    .1150076
       2010  |   .0223686    .026575     0.84   0.400    -.0297174    .0744546
       2011  |   .0251715   .0267603     0.94   0.347    -.0272777    .0776206
       2012  |    .022573    .026464     0.85   0.394    -.0292955    .0744415
       2013  |    .009265   .0278187     0.33   0.739    -.0452587    .0637888
       2014  |   .0224144   .0279299     0.80   0.422    -.0323271     .077156
             |
  1.dmarital |   .0414001   .0159476     2.60   0.009     .0101433    .0726568
             |
   schooling |
         12  |   .2950413   .0332841     8.86   0.000     .2298057    .3602769
         14  |   .3877069   .0371236    10.44   0.000      .314946    .4604678
         16  |   .5567222   .0348949    15.95   0.000     .4883295    .6251149
             |
  1.dregular |   .3846969   .0216519    17.77   0.000     .3422599    .4271339
    1.dunion |   .0177273   .0144878     1.22   0.221    -.0106683    .0461229
             |
         occ |
          2  |   .0853804   .6807528     0.13   0.900    -1.248871    1.419631
          3  |   .1120013   .6784141     0.17   0.869    -1.217666    1.441669
          4  |  -.0248403   .6796268    -0.04   0.971    -1.356884    1.307204
          5  |    .202505   .6793176     0.30   0.766    -1.128933    1.533943
          6  |   .1063038   .6792895     0.16   0.876    -1.225079    1.437687
          7  |   .0922963   .6796686     0.14   0.892     -1.23983    1.424422
          8  |   .1191495   .6793322     0.18   0.861    -1.212317    1.450616
          9  |   .2536614   .6795822     0.37   0.709    -1.078295    1.585618
         10  |   .2430944   .6794408     0.36   0.721    -1.088585    1.574774
         11  |  -.0605062   .6798075    -0.09   0.929    -1.392904    1.271892
         12  |   .1347998   .6821924     0.20   0.843    -1.202273    1.471872
             |
         ind |
          2  |  -.0899861   .2762992    -0.33   0.745    -.6315225    .4515503
          3  |   .3683249   .6966391     0.53   0.597    -.9970627    1.733712
          4  |   .1679263   .6811306     0.25   0.805    -1.167065    1.502918
          5  |   .1787104   .6811311     0.26   0.793    -1.156282    1.513703
          6  |   .1413179   .6804552     0.21   0.835     -1.19235    1.474986
          7  |    .285029   .6828044     0.42   0.676    -1.053243    1.623301
          8  |   .2372324    .681539     0.35   0.728     -1.09856    1.573024
          9  |    .318545   .6832029     0.47   0.641    -1.020508    1.657598
         10  |   .1665256   .6813612     0.24   0.807    -1.168918    1.501969
         11  |   .2368815    .681566     0.35   0.728    -1.098963    1.572726
         12  |   .2581349   .6817987     0.38   0.705    -1.078166    1.594436
         13  |   .2638282    .681872     0.39   0.699    -1.072616    1.600273
         14  |   .1459638   .6812976     0.21   0.830    -1.189355    1.481282
         15  |   .2747697   .6821002     0.40   0.687    -1.062122    1.611662
         16  |   .1851375   .6809766     0.27   0.786    -1.149552    1.519827
         17  |   .1015034    .693072     0.15   0.884    -1.256893    1.459899
         18  |   .2071181   .6840658     0.30   0.762    -1.133626    1.547862
             |
       dsize |
          1  |   .0268499   .0159409     1.68   0.092    -.0043936    .0580934
          2  |   .1286643   .0159693     8.06   0.000      .097365    .1599636
             |
  initialemp |   .0155656   .0005879    26.48   0.000     .0144134    .0167178
       _cons |   5.684727   .0674661    84.26   0.000     5.552495    5.816958
-------------+----------------------------------------------------------------
snd1_lnvar   |
       _cons |  -1.375712   .0266528   -51.62   0.000     -1.42795   -1.323473
------------------------------------------------------------------------------

 ( 1)  [fst1_mean]_cons - [snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0219298    .017503     1.25   0.210    -.0123755    .0562352
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst1 snd1
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp])*`X'
  4.         }
  5. end

. emprtn

 ( 1)  2*[fst1_mean]_cons - 2*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0438597   .0350061     1.25   0.210     -.024751    .1124704
------------------------------------------------------------------------------

 ( 1)  5*[fst1_mean]_cons - 5*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1096492   .0875152     1.25   0.210    -.0618775    .2811759
------------------------------------------------------------------------------

 ( 1)  10*[fst1_mean]_cons - 10*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2192984   .1750304     1.25   0.210    -.1237549    .5623518
------------------------------------------------------------------------------

 ( 1)  15*[fst1_mean]_cons - 15*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3289476   .2625457     1.25   0.210    -.1856324    .8435277
------------------------------------------------------------------------------

 ( 1)  20*[fst1_mean]_cons - 20*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4385968   .3500609     1.25   0.210    -.2475099    1.124704
------------------------------------------------------------------------------

 ( 1)  25*[fst1_mean]_cons - 25*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5482461   .4375761     1.25   0.210    -.3093874    1.405879
------------------------------------------------------------------------------

. 
. ** qadratic
. capture program drop coef

. program coef, rclass
  1.         suest fst2 snd2
  2.         lincom [fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst2, snd2

                                                Number of obs     =      7,824

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst2_mean    |
       dyear |
       2006  |  -.0838644   .0296254    -2.83   0.005    -.1419291   -.0257996
       2007  |  -.0708463   .0270405    -2.62   0.009    -.1238447   -.0178478
       2008  |  -.0748413   .0252277    -2.97   0.003    -.1242866    -.025396
       2009  |  -.0451159   .0240169    -1.88   0.060    -.0921882    .0019564
       2010  |  -.1041244    .023329    -4.46   0.000    -.1498485   -.0584004
       2011  |  -.0471768   .0236101    -2.00   0.046    -.0934517   -.0009019
       2012  |  -.0429435   .0214423    -2.00   0.045    -.0849696   -.0009174
       2013  |  -.0779093   .0232436    -3.35   0.001    -.1234659   -.0323526
       2014  |  -.0448188   .0226718    -1.98   0.048    -.0892547    -.000383
             |
  emptendif2 |   6.98e-07   .0002487     0.00   0.998    -.0004867    .0004881
  empexpdif2 |  -.0003002   .0002575    -1.17   0.244    -.0008049    .0002044
       _cons |     .05262    .021795     2.41   0.016     .0099025    .0953375
-------------+----------------------------------------------------------------
fst2_lnvar   |
       _cons |  -2.001331   .0566263   -35.34   0.000    -2.112316   -1.890345
-------------+----------------------------------------------------------------
snd2_mean    |
        year |
       2005  |   .1024653   .0334249     3.07   0.002     .0369537    .1679769
       2006  |   .0645948   .0324676     1.99   0.047     .0009594    .1282302
       2007  |   .0291366   .0295826     0.98   0.325    -.0288442    .0871174
       2008  |   .0246504   .0288902     0.85   0.394    -.0319734    .0812742
       2009  |   .0617676   .0263563     2.34   0.019     .0101102    .1134249
       2010  |   .0199121   .0265423     0.75   0.453    -.0321099     .071934
       2011  |   .0214412   .0266997     0.80   0.422    -.0308892    .0737715
       2012  |   .0199929   .0263736     0.76   0.448    -.0316984    .0716842
       2013  |   .0048874    .027733     0.18   0.860    -.0494682    .0592431
       2014  |   .0188793   .0277883     0.68   0.497    -.0355849    .0733434
             |
  1.dmarital |   .0264801   .0160671     1.65   0.099    -.0050108     .057971
             |
   schooling |
         12  |   .2621555   .0323008     8.12   0.000      .198847     .325464
         14  |   .3561238   .0362674     9.82   0.000      .285041    .4272066
         16  |   .5241637    .033982    15.42   0.000     .4575602    .5907673
             |
  1.dregular |   .3596258   .0213029    16.88   0.000     .3178729    .4013787
    1.dunion |    .022131   .0145009     1.53   0.127    -.0062902    .0505521
             |
         occ |
          2  |   .0942241   .6611502     0.14   0.887    -1.201606    1.390055
          3  |   .0835016   .6544051     0.13   0.898    -1.199109    1.366112
          4  |  -.0482486   .6555736    -0.07   0.941    -1.333149    1.236652
          5  |   .1703893   .6552625     0.26   0.795    -1.113902     1.45468
          6  |   .0777644    .655229     0.12   0.906    -1.206461     1.36199
          7  |   .0660556   .6556005     0.10   0.920    -1.218898    1.351009
          8  |   .0872424   .6552384     0.13   0.894    -1.197001    1.371486
          9  |   .2255902   .6555388     0.34   0.731    -1.059242    1.510423
         10  |   .2166024   .6553738     0.33   0.741    -1.067907    1.501111
         11  |  -.0827894     .65577    -0.13   0.900    -1.368075    1.202496
         12  |   .1004955   .6583604     0.15   0.879    -1.189867    1.390858
             |
         ind |
          2  |  -.0840674   .2647749    -0.32   0.751    -.6030166    .4348818
          3  |   .3498493    .672634     0.52   0.603    -.9684892    1.668188
          4  |   .1777658   .6570582     0.27   0.787    -1.110045    1.465576
          5  |   .1848981   .6570607     0.28   0.778    -1.102917    1.472713
          6  |   .1468286   .6564363     0.22   0.823    -1.139763     1.43342
          7  |   .2898881   .6588812     0.44   0.660    -1.001495    1.581272
          8  |   .2436195   .6575314     0.37   0.711    -1.045118    1.532357
          9  |   .3233371   .6592503     0.49   0.624    -.9687697    1.615444
         10  |   .1686497   .6573121     0.26   0.798    -1.119658    1.456958
         11  |   .2423611   .6575449     0.37   0.712    -1.046403    1.531125
         12  |   .2693316   .6577499     0.41   0.682    -1.019835    1.558498
         13  |   .2823779   .6578381     0.43   0.668    -1.006961    1.571717
         14  |   .1522029   .6572557     0.23   0.817    -1.135995      1.4404
         15  |   .2865542   .6580889     0.44   0.663    -1.003276    1.576385
         16  |    .193682   .6569225     0.29   0.768    -1.093862    1.481227
         17  |   .1240491   .6692357     0.19   0.853    -1.187629    1.435727
         18  |   .2201313   .6599883     0.33   0.739    -1.073422    1.513684
             |
       dsize |
          1  |   .0302419   .0159226     1.90   0.058    -.0009659    .0614496
          2  |   .1305887    .015947     8.19   0.000     .0993332    .1618443
             |
  initialemp |    .030906   .0005824    53.07   0.000     .0297645    .0320474
       _cons |   5.614456   .0662925    84.69   0.000     5.484525    5.744387
-------------+----------------------------------------------------------------
snd2_lnvar   |
       _cons |  -1.381173   .0268743   -51.39   0.000    -1.433845     -1.3285
------------------------------------------------------------------------------

 ( 1)  [fst2_mean]_cons - [snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0217141   .0218024     1.00   0.319    -.0210178    .0644459
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst2 snd2
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp])*`X' ///
>                                 +[fst2_mean]_b[emptendif2]*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst2_mean]emptendif2 + 2*[fst2_mean]_cons - 2*[snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0434309   .0434578     1.00   0.318    -.0417448    .1286066
------------------------------------------------------------------------------

 ( 1)  25*[fst2_mean]emptendif2 + 5*[fst2_mean]_cons - 5*[snd2_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1085878   .1081981     1.00   0.316    -.1034766    .3206521
------------------------------------------------------------------------------

 ( 1)  100*[fst2_mean]emptendif2 + 10*[fst2_mean]_cons - 10*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2172104   .2154749     1.01   0.313    -.2051127    .6395336
------------------------------------------------------------------------------

 ( 1)  225*[fst2_mean]emptendif2 + 15*[fst2_mean]_cons - 15*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .325868   .3229038     1.01   0.313    -.3070118    .9587478
------------------------------------------------------------------------------

 ( 1)  400*[fst2_mean]emptendif2 + 20*[fst2_mean]_cons - 20*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4345605   .4315619     1.01   0.314    -.4112852    1.280406
------------------------------------------------------------------------------

 ( 1)  625*[fst2_mean]emptendif2 + 25*[fst2_mean]_cons - 25*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5432879   .5425128     1.00   0.317    -.5200176    1.606593
------------------------------------------------------------------------------

. 
. ** cubic
. capture program drop coef

. program coef, rclass
  1.         suest fst3 snd3
  2.         lincom [fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst3, snd3

                                                Number of obs     =      7,824

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst3_mean    |
       dyear |
       2006  |  -.0833979   .0296747    -2.81   0.005    -.1415594   -.0252365
       2007  |  -.0706454   .0271104    -2.61   0.009    -.1237808     -.01751
       2008  |  -.0736511   .0252233    -2.92   0.004    -.1230878   -.0242143
       2009  |  -.0443333   .0240803    -1.84   0.066    -.0915299    .0028633
       2010  |  -.1036172    .023326    -4.44   0.000    -.1493354    -.057899
       2011  |   -.046889   .0236264    -1.98   0.047     -.093196   -.0005821
       2012  |   -.042999   .0215069    -2.00   0.046    -.0851518   -.0008462
       2013  |  -.0775929   .0232287    -3.34   0.001    -.1231202   -.0320655
       2014  |  -.0447196   .0226919    -1.97   0.049    -.0891948   -.0002443
             |
  emptendif2 |   .0018203   .0009478     1.92   0.055    -.0000374    .0036781
  empexpdif2 |  -.0018042   .0014437    -1.25   0.211    -.0046338    .0010254
  emptendif3 |  -.0000331   .0000166    -2.00   0.046    -.0000655   -5.81e-07
  empexpdif3 |   .0000218    .000018     1.21   0.226    -.0000134     .000057
       _cons |   .0589548   .0353924     1.67   0.096    -.0104131    .1283227
-------------+----------------------------------------------------------------
fst3_lnvar   |
       _cons |  -2.001785   .0565216   -35.42   0.000    -2.112566   -1.891005
-------------+----------------------------------------------------------------
snd3_mean    |
        year |
       2005  |   .1026381   .0339551     3.02   0.003     .0360874    .1691888
       2006  |   .0636969   .0328035     1.94   0.052    -.0005969    .1279907
       2007  |   .0295393   .0300276     0.98   0.325    -.0293137    .0883923
       2008  |    .023211    .029329     0.79   0.429    -.0342728    .0806949
       2009  |   .0592399   .0268003     2.21   0.027     .0067123    .1117675
       2010  |   .0159307   .0269648     0.59   0.555    -.0369193    .0687808
       2011  |   .0153143   .0271495     0.56   0.573    -.0378978    .0685265
       2012  |   .0151048   .0268004     0.56   0.573    -.0374231    .0676326
       2013  |   .0005262   .0281411     0.02   0.985    -.0546294    .0556818
       2014  |   .0155503    .028152     0.55   0.581    -.0396265    .0707271
             |
  1.dmarital |   .0144664    .016335     0.89   0.376    -.0175497    .0464824
             |
   schooling |
         12  |   .3018127    .033766     8.94   0.000     .2356326    .3679929
         14  |   .4025096     .03761    10.70   0.000     .3287953    .4762239
         16  |   .5753629   .0353428    16.28   0.000     .5060923    .6446335
             |
  1.dregular |   .3726888    .021391    17.42   0.000     .3307632    .4146144
    1.dunion |   .0209155   .0146993     1.42   0.155    -.0078946    .0497257
             |
         occ |
          2  |   .1276575   .6596728     0.19   0.847    -1.165277    1.420592
          3  |   .2149257    .658093     0.33   0.744    -1.074913    1.504764
          4  |   .0864378   .6592221     0.13   0.896    -1.205614    1.378489
          5  |   .2813667   .6589065     0.43   0.669    -1.010066      1.5728
          6  |   .2013495   .6588798     0.31   0.760    -1.090031     1.49273
          7  |   .1959817   .6592524     0.30   0.766    -1.096129    1.488093
          8  |   .2215941   .6588623     0.34   0.737    -1.069752    1.512941
          9  |   .3551986   .6591966     0.54   0.590    -.9368031      1.6472
         10  |   .3452746   .6590255     0.52   0.600    -.9463916    1.636941
         11  |   .0571171   .6594478     0.09   0.931    -1.235377    1.349611
         12  |   .2195269   .6620827     0.33   0.740    -1.078131    1.517185
             |
         ind |
          2  |  -.1404766   .2728774    -0.51   0.607    -.6753064    .3943532
          3  |   .2754777   .6760593     0.41   0.684    -1.049574     1.60053
          4  |   .0722227   .6607347     0.11   0.913    -1.222794    1.367239
          5  |   .0773599   .6607345     0.12   0.907    -1.217656    1.372376
          6  |   .0430962   .6601393     0.07   0.948    -1.250753    1.336945
          7  |   .1812787   .6625814     0.27   0.784    -1.117357    1.479914
          8  |   .1347339    .661221     0.20   0.839    -1.161236    1.430703
          9  |   .2304595   .6630364     0.35   0.728    -1.069068    1.529987
         10  |   .0619097   .6609948     0.09   0.925    -1.233616    1.357436
         11  |   .1360997   .6612392     0.21   0.837    -1.159905    1.432105
         12  |   .1672644   .6613873     0.25   0.800    -1.129031     1.46356
         13  |   .1702355   .6614788     0.26   0.797    -1.126239     1.46671
         14  |   .0504133   .6609313     0.08   0.939    -1.244988    1.345815
         15  |   .1849537   .6618008     0.28   0.780    -1.112152    1.482059
         16  |   .0865692   .6606131     0.13   0.896    -1.208209    1.381347
         17  |   .0093109   .6736063     0.01   0.989    -1.310933    1.329555
         18  |   .1204343   .6639273     0.18   0.856    -1.180839    1.421708
             |
       dsize |
          1  |   .0249005   .0162187     1.54   0.125    -.0068875    .0566885
          2  |   .1229569   .0161901     7.59   0.000      .091225    .1546889
             |
  initialemp |   .0606176   .0005887   102.96   0.000     .0594637    .0617715
       _cons |   5.432192   .0678319    80.08   0.000     5.299244     5.56514
-------------+----------------------------------------------------------------
snd3_lnvar   |
       _cons |  -1.354304   .0264613   -51.18   0.000    -1.406167   -1.302441
------------------------------------------------------------------------------

 ( 1)  [fst3_mean]_cons - [snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0016628   .0354123    -0.05   0.963    -.0710697    .0677441
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst3 snd3
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp])*`X' ///
>                                 +[fst3_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst3_mean]_b[emptendif3]*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst3_mean]emptendif2 + 8*[fst3_mean]emptendif3 + 2*[fst3_mean]_cons -
       2*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0036913   .0707326     0.05   0.958     -.134942    .1423246
------------------------------------------------------------------------------

 ( 1)  25*[fst3_mean]emptendif2 + 125*[fst3_mean]emptendif3 + 5*[fst3_mean]_cons
       - 5*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0330623    .177334     0.19   0.852    -.3145059    .3806304
------------------------------------------------------------------------------

 ( 1)  100*[fst3_mean]emptendif2 + 1000*[fst3_mean]emptendif3 +
       10*[fst3_mean]_cons - 10*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .132348   .3593817     0.37   0.713    -.5720272    .8367232
------------------------------------------------------------------------------

 ( 1)  225*[fst3_mean]emptendif2 + 3375*[fst3_mean]emptendif3 +
       15*[fst3_mean]_cons - 15*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2730634   .5487849     0.50   0.619    -.8025352    1.348662
------------------------------------------------------------------------------

 ( 1)  400*[fst3_mean]emptendif2 + 8000*[fst3_mean]emptendif3 +
       20*[fst3_mean]_cons - 20*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4304147    .744685     0.58   0.563    -1.029141    1.889971
------------------------------------------------------------------------------

 ( 1)  625*[fst3_mean]emptendif2 + 15625*[fst3_mean]emptendif3 +
       25*[fst3_mean]_cons - 25*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5796082   .9443677     0.61   0.539    -1.271318    2.430535
------------------------------------------------------------------------------

. 
. ** quartic
. capture program drop coef

. program coef, rclass
  1.         suest fst4 snd4
  2.         lincom [fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst4, snd4

                                                Number of obs     =      7,824

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst4_mean    |
       dyear |
       2006  |  -.0827243   .0296605    -2.79   0.005    -.1408578   -.0245908
       2007  |  -.0691682   .0270419    -2.56   0.011    -.1221694   -.0161671
       2008  |  -.0734014   .0252307    -2.91   0.004    -.1228527   -.0239501
       2009  |  -.0433599   .0241195    -1.80   0.072    -.0906333    .0039134
       2010  |  -.1030365   .0233553    -4.41   0.000    -.1488121    -.057261
       2011  |  -.0464131   .0237045    -1.96   0.050    -.0928732     .000047
       2012  |  -.0415303   .0215842    -1.92   0.054    -.0838346     .000774
       2013  |  -.0758568   .0233239    -3.25   0.001    -.1215707   -.0301428
       2014  |  -.0430157    .022784    -1.89   0.059    -.0876715    .0016401
             |
  emptendif2 |  -.0002192   .0021607    -0.10   0.919    -.0044541    .0040156
  empexpdif2 |   -.006694   .0043386    -1.54   0.123    -.0151975    .0018094
  emptendif3 |   .0000605   .0000873     0.69   0.488    -.0001105    .0002315
  empexpdif3 |   .0001596   .0001184     1.35   0.178    -.0000724    .0003916
  emptendif4 |  -1.22e-06   1.09e-06    -1.12   0.264    -3.36e-06    9.20e-07
  empexpdif4 |  -1.30e-06   1.11e-06    -1.17   0.243    -3.48e-06    8.81e-07
       _cons |   .1340161    .063264     2.12   0.034      .010021    .2580112
-------------+----------------------------------------------------------------
fst4_lnvar   |
       _cons |  -2.002232   .0565235   -35.42   0.000    -2.113016   -1.891448
-------------+----------------------------------------------------------------
snd4_mean    |
        year |
       2005  |   .1006556   .0339078     2.97   0.003     .0341976    .1671135
       2006  |   .0654428   .0326919     2.00   0.045     .0013679    .1295178
       2007  |   .0308279   .0300019     1.03   0.304    -.0279747    .0896305
       2008  |   .0207048   .0293774     0.70   0.481    -.0368738    .0782834
       2009  |   .0583894   .0267504     2.18   0.029     .0059596    .1108191
       2010  |   .0168308   .0269552     0.62   0.532    -.0360004    .0696619
       2011  |   .0158531   .0270755     0.59   0.558    -.0372138    .0689201
       2012  |   .0152185   .0267059     0.57   0.569    -.0371241     .067561
       2013  |   .0026861   .0280477     0.10   0.924    -.0522864    .0576586
       2014  |    .019036   .0280492     0.68   0.497    -.0359394    .0740114
             |
  1.dmarital |   .0216152   .0162238     1.33   0.183    -.0101829    .0534133
             |
   schooling |
         12  |   .3105968   .0337203     9.21   0.000     .2445061    .3766874
         14  |   .4062534   .0375403    10.82   0.000     .3326758     .479831
         16  |   .5789867   .0352978    16.40   0.000     .5098044    .6481691
             |
  1.dregular |   .3807145   .0212937    17.88   0.000     .3389796    .4224494
    1.dunion |   .0174772   .0146263     1.19   0.232    -.0111898    .0461442
             |
         occ |
          2  |   .2238406   .6682273     0.33   0.738    -1.085861    1.533542
          3  |   .2622392   .6659204     0.39   0.694    -1.042941    1.567419
          4  |   .1354115   .6670812     0.20   0.839    -1.172044    1.442867
          5  |   .3345379   .6667854     0.50   0.616    -.9723375    1.641413
          6  |   .2522225   .6667511     0.38   0.705    -1.054586    1.559031
          7  |   .2412734   .6671318     0.36   0.718    -1.066281    1.548828
          8  |   .2676541   .6667647     0.40   0.688    -1.039181    1.574489
          9  |   .4021183   .6670621     0.60   0.547    -.9052993    1.709536
         10  |   .3937452   .6669043     0.59   0.555    -.9133632    1.700854
         11  |   .1067903    .667315     0.16   0.873    -1.201123    1.414704
         12  |   .2686712   .6698854     0.40   0.688     -1.04428    1.581622
             |
         ind |
          2  |  -.1840493   .2752636    -0.67   0.504    -.7235561    .3554574
          3  |    .199617   .6840129     0.29   0.770    -1.141024    1.540258
          4  |   .0082014   .6686231     0.01   0.990    -1.302276    1.318679
          5  |   .0147058   .6686209     0.02   0.982    -1.295767    1.325179
          6  |  -.0223922   .6679871    -0.03   0.973    -1.331623    1.286838
          7  |    .111583   .6703387     0.17   0.868    -1.202257    1.425423
          8  |   .0687397   .6690793     0.10   0.918    -1.242632    1.380111
          9  |   .1669891     .67088     0.25   0.803    -1.147912     1.48189
         10  |  -.0051946   .6688757    -0.01   0.994    -1.316167    1.305778
         11  |   .0735119    .669114     0.11   0.913    -1.237927    1.384951
         12  |   .0908718   .6692495     0.14   0.892    -1.220833    1.402577
         13  |   .0974436   .6693539     0.15   0.884    -1.214466    1.409353
         14  |  -.0167929   .6687908    -0.03   0.980    -1.327599    1.294013
         15  |   .1115082   .6696515     0.17   0.868    -1.200985    1.424001
         16  |    .019817   .6684869     0.03   0.976    -1.290393    1.330027
         17  |  -.0706887   .6812626    -0.10   0.917    -1.405939    1.264561
         18  |    .042633   .6718729     0.06   0.949    -1.274214     1.35948
             |
       dsize |
          1  |   .0257703    .016108     1.60   0.110    -.0058008    .0573414
          2  |   .1258785   .0161335     7.80   0.000     .0942574    .1574997
             |
  initialemp |   .1249559    .000588   212.50   0.000     .1238034    .1261084
       _cons |   5.212378   .0681595    76.47   0.000     5.078788    5.345968
-------------+----------------------------------------------------------------
snd4_lnvar   |
       _cons |   -1.35976   .0264444   -51.42   0.000     -1.41159    -1.30793
------------------------------------------------------------------------------

 ( 1)  [fst4_mean]_cons - [snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0090602   .0632621     0.14   0.886    -.1149312    .1330517
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst4 snd4
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp])*`X' ///
>                                 +[fst4_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif3]*`X'*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif4]*`X'*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst4_mean]emptendif2 + 8*[fst4_mean]emptendif3 +
       16*[fst4_mean]emptendif4 + 2*[fst4_mean]_cons - 2*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0177078   .1257789     0.14   0.888    -.2288142    .2642299
------------------------------------------------------------------------------

 ( 1)  25*[fst4_mean]emptendif2 + 125*[fst4_mean]emptendif3 +
       625*[fst4_mean]emptendif4 + 5*[fst4_mean]_cons - 5*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .046617   .3141453     0.15   0.882    -.5690964    .6623305
------------------------------------------------------------------------------

 ( 1)  100*[fst4_mean]emptendif2 + 1000*[fst4_mean]emptendif3 +
       10000*[fst4_mean]emptendif4 + 10*[fst4_mean]_cons -
       10*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1169434   .6335009     0.18   0.854    -1.124695    1.358582
------------------------------------------------------------------------------

 ( 1)  225*[fst4_mean]emptendif2 + 3375*[fst4_mean]emptendif3 +
       50625*[fst4_mean]emptendif4 + 15*[fst4_mean]_cons -
       15*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2288456   .9600967     0.24   0.812    -1.652909    2.110601
------------------------------------------------------------------------------

 ( 1)  400*[fst4_mean]emptendif2 + 8000*[fst4_mean]emptendif3 +
       160000*[fst4_mean]emptendif4 + 20*[fst4_mean]_cons -
       20*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .381857   1.290308     0.30   0.767      -2.1471    2.910814
------------------------------------------------------------------------------

 ( 1)  625*[fst4_mean]emptendif2 + 15625*[fst4_mean]emptendif3 +
       390625*[fst4_mean]emptendif4 + 25*[fst4_mean]_cons -
       25*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5571778   1.620823     0.34   0.731    -2.619577    3.733933
------------------------------------------------------------------------------

. 
end of do-file
Year Dummy Type: Dm2

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd $Inputfd

. 
. qui {

. 
end of do-file

. qui{

. 
. 
. * estimation
. forvalues i=1/4 {
  2.         **** 1st step
.         qui $FstReg ///
>                                 `contrl`i'' ///
>                                 if fst==1
  3.         est sto fst`i'
  4.         gen emptenB`i'=`LHSterm`i'' ///
>                                                                 $DmYear
  5.         gen intwemp`i'=realwage-emptenB`i'
  6.         
.         **** 2nd step
.         qui reg intwemp`i' ///
>                                 $SndReg
  7.         est sto snd`i'
  8. }
(865 missing values generated)
(1,564 missing values generated)
(930 missing values generated)
(1,624 missing values generated)
(930 missing values generated)
(1,624 missing values generated)
(930 missing values generated)
(1,624 missing values generated)

. 
. * calc. return
. ** linear
. capture program drop coef

. program coef, rclass
  1.         suest fst1 snd1
  2.         lincom [fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst1, snd1

                                                Number of obs     =      7,827

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst1_mean    |
       _cons |  -.0244802   .0053035    -4.62   0.000    -.0348748   -.0140855
-------------+----------------------------------------------------------------
fst1_lnvar   |
       _cons |  -1.998589   .0568092   -35.18   0.000    -2.109933   -1.887245
-------------+----------------------------------------------------------------
snd1_mean    |
        year |
       2005  |   .1109497   .0367859     3.02   0.003     .0388506    .1830488
       2006  |    .091258   .0362327     2.52   0.012     .0202432    .1622729
       2007  |   .0765495   .0332369     2.30   0.021     .0114063    .1416926
       2008  |   .0660538   .0340731     1.94   0.053    -.0007282    .1328359
       2009  |   .0954663   .0300477     3.18   0.001      .036574    .1543587
       2010  |   .0664242   .0308204     2.16   0.031     .0060174     .126831
       2011  |   .0927747   .0300901     3.08   0.002     .0337992    .1517502
       2012  |   .1011975   .0297935     3.40   0.001     .0428033    .1595916
       2013  |   .1232305   .0309962     3.98   0.000      .062479     .183982
       2014  |   .1474192   .0309873     4.76   0.000     .0866852    .2081533
             |
  1.dmarital |   .3608085   .0171968    20.98   0.000     .3271035    .3945136
             |
   schooling |
         12  |  -.0759343   .0307076    -2.47   0.013      -.13612   -.0157486
         14  |  -.1787774   .0360885    -4.95   0.000    -.2495095   -.1080453
         16  |  -.1297296   .0328559    -3.95   0.000     -.194126   -.0653333
             |
  1.dregular |   .2554115   .0212042    12.05   0.000     .2138521    .2969709
    1.dunion |   .0478452   .0155615     3.07   0.002     .0173452    .0783453
             |
         occ |
          2  |    .250557   .4896902     0.51   0.609    -.7092182    1.210332
          3  |   -.103217   .3503728    -0.29   0.768     -.789935     .583501
          4  |   -.176817   .3509549    -0.50   0.614    -.8646759    .5110419
          5  |   .4605322   .3504445     1.31   0.189    -.2263264    1.147391
          6  |   .0481564   .3502611     0.14   0.891    -.6383428    .7346556
          7  |  -.1841433   .3508384    -0.52   0.600     -.871774    .5034873
          8  |  -.1532251   .3496221    -0.44   0.661    -.8384718    .5320215
          9  |   -.064015   .3511026    -0.18   0.855    -.7521634    .6241335
         10  |    .019191   .3503096     0.05   0.956    -.6674032    .7057852
         11  |  -.2400091   .3524599    -0.68   0.496    -.9308178    .4507996
         12  |  -.0165078   .3613804    -0.05   0.964    -.7248003    .6917847
             |
         ind |
          2  |   .0676836   .2194689     0.31   0.758    -.3624675    .4978347
          3  |  -.2764171   .3933206    -0.70   0.482    -1.047311    .4944772
          4  |   .1147571   .3745004     0.31   0.759    -.6192502    .8487644
          5  |   .1624796    .374355     0.43   0.664    -.5712427    .8962019
          6  |   .0909819   .3748433     0.24   0.808    -.6436974    .8256613
          7  |  -.0267068   .3770807    -0.07   0.944    -.7657715    .7123578
          8  |   .0512103   .3760008     0.14   0.892    -.6857377    .7881583
          9  |   .2753509   .3802394     0.72   0.469    -.4699047    1.020606
         10  |   .0736361   .3754359     0.20   0.845    -.6622047    .8094769
         11  |    .164263   .3757255     0.44   0.662    -.5721454    .9006714
         12  |   .2223783   .3763389     0.59   0.555    -.5152324     .959989
         13  |   .1709102   .3780622     0.45   0.651     -.570078    .9118985
         14  |  -.0878476   .3752396    -0.23   0.815    -.8233037    .6476085
         15  |   .1697335   .3767949     0.45   0.652    -.5687708    .9082379
         16  |   .0845952    .374613     0.23   0.821    -.6496327    .8188232
         17  |  -.1270449   .4097886    -0.31   0.757    -.9302158     .676126
         18  |   .1721769   .3801295     0.45   0.651    -.5728633    .9172171
             |
       dsize |
          1  |   .0875281   .0170787     5.12   0.000     .0540544    .1210019
          2  |   .2649846   .0169601    15.62   0.000     .2317435    .2982258
             |
  initialemp |  -.0184981   .0005886   -31.43   0.000    -.0196517   -.0173444
       _cons |   7.427187   .1414118    52.52   0.000     7.150025    7.704349
-------------+----------------------------------------------------------------
snd1_lnvar   |
       _cons |  -1.236253   .0211184   -58.54   0.000    -1.277644   -1.194861
------------------------------------------------------------------------------

 ( 1)  [fst1_mean]_cons - [snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0059821   .0053435    -1.12   0.263    -.0164552     .004491
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst1 snd1
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp])*`X'
  4.         }
  5. end

. emprtn

 ( 1)  2*[fst1_mean]_cons - 2*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0119643    .010687    -1.12   0.263    -.0329105     .008982
------------------------------------------------------------------------------

 ( 1)  5*[fst1_mean]_cons - 5*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0299106   .0267176    -1.12   0.263    -.0822762    .0224549
------------------------------------------------------------------------------

 ( 1)  10*[fst1_mean]_cons - 10*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0598213   .0534352    -1.12   0.263    -.1645524    .0449099
------------------------------------------------------------------------------

 ( 1)  15*[fst1_mean]_cons - 15*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0897319   .0801528    -1.12   0.263    -.2468286    .0673648
------------------------------------------------------------------------------

 ( 1)  20*[fst1_mean]_cons - 20*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1196425   .1068705    -1.12   0.263    -.3291047    .0898197
------------------------------------------------------------------------------

 ( 1)  25*[fst1_mean]_cons - 25*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1495531   .1335881    -1.12   0.263    -.4113809    .1122747
------------------------------------------------------------------------------

. 
. ** qadratic
. capture program drop coef

. program coef, rclass
  1.         suest fst2 snd2
  2.         lincom [fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst2, snd2

                                                Number of obs     =      7,824

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst2_mean    |
  emptendif2 |   .0000192    .000249     0.08   0.939    -.0004688    .0005072
  empexpdif2 |  -.0002931   .0002571    -1.14   0.254     -.000797    .0002109
       _cons |  -.0097906   .0154354    -0.63   0.526    -.0400433    .0204622
-------------+----------------------------------------------------------------
fst2_lnvar   |
       _cons |  -1.997988   .0568955   -35.12   0.000    -2.109501   -1.886475
-------------+----------------------------------------------------------------
snd2_mean    |
        year |
       2005  |   .1090116   .0363579     3.00   0.003     .0377513    .1802718
       2006  |   .0864057   .0358017     2.41   0.016     .0162357    .1565757
       2007  |   .0742315   .0327344     2.27   0.023     .0100733    .1383896
       2008  |   .0628971   .0336041     1.87   0.061    -.0029657    .1287599
       2009  |   .0937531   .0295744     3.17   0.002     .0357883    .1517179
       2010  |     .06371   .0303726     2.10   0.036     .0041808    .1232392
       2011  |   .0886114   .0296452     2.99   0.003     .0305078     .146715
       2012  |   .0980534    .029376     3.34   0.001     .0404775    .1556294
       2013  |   .1179952   .0306122     3.85   0.000     .0579964     .177994
       2014  |   .1428488   .0305749     4.67   0.000     .0829231    .2027745
             |
  1.dmarital |   .3435606   .0167735    20.48   0.000     .3106851     .376436
             |
   schooling |
         12  |  -.1042451   .0308064    -3.38   0.001    -.1646246   -.0438657
         14  |  -.2038707   .0360474    -5.66   0.000    -.2745224    -.133219
         16  |  -.1543655   .0328727    -4.70   0.000    -.2187949   -.0899361
             |
  1.dregular |   .2336602   .0211846    11.03   0.000     .1921391    .2751813
    1.dunion |   .0517675   .0153453     3.37   0.001     .0216913    .0818436
             |
         occ |
          2  |   .2592286   .5115039     0.51   0.612    -.7433007    1.261758
          3  |  -.1298559   .3413188    -0.38   0.704    -.7988284    .5391166
          4  |  -.1994196   .3418599    -0.58   0.560    -.8694527    .4706135
          5  |   .4254591   .3413638     1.25   0.213    -.2436017     1.09452
          6  |   .0199685   .3411597     0.06   0.953    -.6486923    .6886293
          7  |  -.2078028   .3417581    -0.61   0.543    -.8776363    .4620307
          8  |  -.1823226   .3405051    -0.54   0.592    -.8497003    .4850551
          9  |  -.0889326   .3419813    -0.26   0.795    -.7592035    .5813383
         10  |  -.0052384   .3411909    -0.02   0.988    -.6739602    .6634835
         11  |  -.2609445   .3433962    -0.76   0.447    -.9339888    .4120997
         12  |  -.0492988   .3526932    -0.14   0.889    -.7405648    .6419672
             |
         ind |
          2  |   .0697223   .2148837     0.32   0.746    -.3514421    .4908867
          3  |  -.2903471   .3868057    -0.75   0.453    -1.048472    .4677781
          4  |   .1244289   .3673194     0.34   0.735    -.5955039    .8443618
          5  |   .1679379   .3671707     0.46   0.647    -.5517034    .8875792
          6  |   .0962739   .3677032     0.26   0.793    -.6244111    .8169589
          7  |  -.0193848   .3699482    -0.05   0.958    -.7444699    .7057003
          8  |   .0588954   .3688389     0.16   0.873    -.6640155    .7818064
          9  |   .2801991   .3731765     0.75   0.453    -.4512134    1.011612
         10  |    .076127    .368278     0.21   0.836    -.6456847    .7979387
         11  |   .1696168   .3685422     0.46   0.645    -.5527125    .8919462
         12  |   .2323738   .3691366     0.63   0.529    -.4911206    .9558683
         13  |   .1889385   .3709103     0.51   0.610    -.5380322    .9159093
         14  |  -.0800798   .3680534    -0.22   0.828    -.8014511    .6412915
         15  |   .1814107   .3695812     0.49   0.624    -.5429551    .9057765
         16  |   .0935925   .3674414     0.25   0.799    -.6265794    .8137644
         17  |  -.1040785    .401684    -0.26   0.796    -.8913646    .6832076
         18  |   .1839764   .3729545     0.49   0.622     -.547001    .9149537
             |
       dsize |
          1  |    .090408   .0168788     5.36   0.000     .0573261    .1234899
          2  |   .2655681   .0168252    15.78   0.000     .2325913    .2985449
             |
  initialemp |  -.0032313   .0005861    -5.51   0.000      -.00438   -.0020826
       _cons |   7.345048   .1444988    50.83   0.000     7.061835     7.62826
-------------+----------------------------------------------------------------
snd2_lnvar   |
       _cons |    -1.2566   .0214103   -58.69   0.000    -1.298563   -1.214636
------------------------------------------------------------------------------

 ( 1)  [fst2_mean]_cons - [snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0065592   .0154569    -0.42   0.671    -.0368542    .0237357
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst2 snd2
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp])*`X' ///
>                                 +[fst2_mean]_b[emptendif2]*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst2_mean]emptendif2 + 2*[fst2_mean]_cons - 2*[snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0130417   .0306788    -0.43   0.671    -.0731711    .0470876
------------------------------------------------------------------------------

 ( 1)  25*[fst2_mean]emptendif2 + 5*[fst2_mean]_cons - 5*[snd2_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0323164   .0759604    -0.43   0.671    -.1811962    .1165633
------------------------------------------------------------------------------

 ( 1)  100*[fst2_mean]emptendif2 + 10*[fst2_mean]_cons - 10*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0636733   .1502607    -0.42   0.672    -.3581789    .2308323
------------------------------------------------------------------------------

 ( 1)  225*[fst2_mean]emptendif2 + 15*[fst2_mean]_cons - 15*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0940706    .224432    -0.42   0.675    -.5339492     .345808
------------------------------------------------------------------------------

 ( 1)  400*[fst2_mean]emptendif2 + 20*[fst2_mean]_cons - 20*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1235083   .3000314    -0.41   0.681    -.7115591    .4645425
------------------------------------------------------------------------------

 ( 1)  625*[fst2_mean]emptendif2 + 25*[fst2_mean]_cons - 25*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1519865   .3785896    -0.40   0.688    -.8940085    .5900356
------------------------------------------------------------------------------

. 
. ** cubic
. capture program drop coef

. program coef, rclass
  1.         suest fst3 snd3
  2.         lincom [fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst3, snd3

                                                Number of obs     =      7,824

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst3_mean    |
  emptendif2 |   .0018999   .0009484     2.00   0.045     .0000411    .0037588
  empexpdif2 |  -.0018734   .0014468    -1.29   0.195    -.0047092    .0009624
  emptendif3 |  -.0000342   .0000166    -2.06   0.039    -.0000666   -1.71e-06
  empexpdif3 |   .0000228    .000018     1.27   0.205    -.0000125    .0000581
       _cons |  -.0023185   .0327062    -0.07   0.943    -.0664215    .0617846
-------------+----------------------------------------------------------------
fst3_lnvar   |
       _cons |  -1.998503   .0567846   -35.19   0.000    -2.109798   -1.887207
-------------+----------------------------------------------------------------
snd3_mean    |
        year |
       2005  |   .1091229   .0359986     3.03   0.002     .0385669     .179679
       2006  |   .0853104   .0352794     2.42   0.016      .016164    .1544568
       2007  |   .0743494   .0322645     2.30   0.021     .0111121    .1375866
       2008  |   .0611398   .0330295     1.85   0.064    -.0035967    .1258764
       2009  |   .0909005   .0290737     3.13   0.002      .033917    .1478839
       2010  |   .0592745    .029851     1.99   0.047     .0007676    .1177814
       2011  |   .0818147   .0291288     2.81   0.005     .0247234     .138906
       2012  |    .092442   .0288043     3.21   0.001     .0359867    .1488974
       2013  |   .1127492   .0300546     3.75   0.000     .0538431    .1716552
       2014  |   .1386154   .0300132     4.62   0.000     .0797906    .1974402
             |
  1.dmarital |   .3290859   .0163865    20.08   0.000     .2969688    .3612029
             |
   schooling |
         12  |  -.0610029   .0308578    -1.98   0.048     -.121483   -.0005227
         14  |  -.1524818   .0359119    -4.25   0.000    -.2228679   -.0820957
         16  |  -.0972908    .032882    -2.96   0.003    -.1617383   -.0328433
             |
  1.dregular |   .2480104   .0212456    11.67   0.000     .2063699     .289651
    1.dunion |   .0503919   .0151349     3.33   0.001     .0207282    .0800557
             |
         occ |
          2  |   .2923233    .482909     0.61   0.545     -.654161    1.238808
          3  |   .0073505   .3581403     0.02   0.984    -.6945916    .7092927
          4  |   -.059132   .3585962    -0.16   0.869    -.7619676    .6437037
          5  |   .5389562   .3581256     1.50   0.132    -.1629571    1.240869
          6  |   .1482043   .3579263     0.41   0.679    -.5533183    .8497269
          7  |  -.0718061   .3584998    -0.20   0.841    -.7744529    .6308406
          8  |   -.041714   .3572865    -0.12   0.907    -.7419827    .6585547
          9  |   .0469102   .3586895     0.13   0.896    -.6561083    .7499287
         10  |   .1292154   .3579493     0.36   0.718    -.5723523     .830783
         11  |  -.1150571   .3601476    -0.32   0.749    -.8209335    .5908193
         12  |     .07474    .368934     0.20   0.839    -.6483575    .7978374
             |
         ind |
          2  |   .0102446   .2152604     0.05   0.962    -.4116581    .4321473
          3  |  -.3639243   .4006084    -0.91   0.364    -1.149102    .4212536
          4  |   .0152798    .379819     0.04   0.968    -.7291518    .7597113
          5  |   .0565125   .3796601     0.15   0.882    -.6876076    .8006326
          6  |  -.0109984   .3802103    -0.03   0.977    -.7561969    .7342002
          7  |  -.1302084   .3822996    -0.34   0.733    -.8795018    .6190849
          8  |  -.0529502     .38126    -0.14   0.890     -.800206    .6943056
          9  |   .1842012    .385377     0.48   0.633    -.5711238    .9395261
         10  |  -.0340508   .3807287    -0.09   0.929    -.7802654    .7121637
         11  |   .0598545   .3809784     0.16   0.875    -.6868496    .8065585
         12  |   .1267208    .381506     0.33   0.740    -.6210172    .8744588
         13  |   .0731846   .3832439     0.19   0.849    -.6779596    .8243289
         14  |  -.1843432   .3804872    -0.48   0.628    -.9300843     .561398
         15  |   .0766789   .3819472     0.20   0.841    -.6719239    .8252817
         16  |  -.0169213    .379927    -0.04   0.964    -.7615645    .7277219
         17  |  -.2217365   .4113409    -0.54   0.590     -1.02795    .5844768
         18  |   .0807346   .3855842     0.21   0.834    -.6749966    .8364658
             |
       dsize |
          1  |   .0845368    .016717     5.06   0.000      .051772    .1173015
          2  |    .256896   .0166535    15.43   0.000     .2242557    .2895362
             |
  initialemp |    .028256   .0005857    48.24   0.000      .027108    .0294041
       _cons |   7.143411   .1361542    52.47   0.000     6.876553    7.410268
-------------+----------------------------------------------------------------
snd3_lnvar   |
       _cons |  -1.275257   .0218421   -58.39   0.000    -1.318067   -1.232447
------------------------------------------------------------------------------

 ( 1)  [fst3_mean]_cons - [snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0305745   .0327233    -0.93   0.350    -.0947111     .033562
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst3 snd3
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp])*`X' ///
>                                 +[fst3_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst3_mean]_b[emptendif3]*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst3_mean]emptendif2 + 8*[fst3_mean]emptendif3 + 2*[fst3_mean]_cons -
       2*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0538226    .065219    -0.83   0.409    -.1816496    .0740044
------------------------------------------------------------------------------

 ( 1)  25*[fst3_mean]emptendif2 + 125*[fst3_mean]emptendif3 + 5*[fst3_mean]_cons
       - 5*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1096446     .16316    -0.67   0.502    -.4294323    .2101432
------------------------------------------------------------------------------

 ( 1)  100*[fst3_mean]emptendif2 + 1000*[fst3_mean]emptendif3 +
       10*[fst3_mean]_cons - 10*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1499126   .3302602    -0.45   0.650    -.7972108    .4973855
------------------------------------------------------------------------------

 ( 1)  225*[fst3_mean]emptendif2 + 3375*[fst3_mean]emptendif3 +
       15*[fst3_mean]_cons - 15*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1464234   .5046615    -0.29   0.772    -1.135542     .842695
------------------------------------------------------------------------------

 ( 1)  400*[fst3_mean]emptendif2 + 8000*[fst3_mean]emptendif3 +
       20*[fst3_mean]_cons - 20*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1247961   .6858808    -0.18   0.856    -1.469098    1.219506
------------------------------------------------------------------------------

 ( 1)  625*[fst3_mean]emptendif2 + 15625*[fst3_mean]emptendif3 +
       25*[fst3_mean]_cons - 25*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1106498   .8713883    -0.13   0.899     -1.81854     1.59724
------------------------------------------------------------------------------

. 
. ** quartic
. capture program drop coef

. program coef, rclass
  1.         suest fst4 snd4
  2.         lincom [fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst4, snd4

                                                Number of obs     =      7,824

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst4_mean    |
  emptendif2 |  -.0000739   .0021588    -0.03   0.973    -.0043049    .0041572
  empexpdif2 |  -.0068768   .0043442    -1.58   0.113    -.0153912    .0016375
  emptendif3 |   .0000566   .0000871     0.65   0.516    -.0001141    .0002273
  empexpdif3 |   .0001643   .0001185     1.39   0.166    -.0000681    .0003966
  emptendif4 |  -1.19e-06   1.09e-06    -1.09   0.276    -3.32e-06    9.48e-07
  empexpdif4 |  -1.34e-06   1.11e-06    -1.20   0.230    -3.52e-06    8.47e-07
       _cons |   .0745337   .0622758     1.20   0.231    -.0475246    .1965921
-------------+----------------------------------------------------------------
fst4_lnvar   |
       _cons |  -1.998949   .0567862   -35.20   0.000    -2.110248    -1.88765
-------------+----------------------------------------------------------------
snd4_mean    |
        year |
       2005  |   .1069666   .0359404     2.98   0.003     .0365248    .1774084
       2006  |   .0866473   .0351925     2.46   0.014     .0176712    .1556234
       2007  |   .0748985   .0322126     2.33   0.020     .0117629    .1380341
       2008  |   .0580447   .0329501     1.76   0.078    -.0065364    .1226257
       2009  |   .0895148   .0289987     3.09   0.002     .0326784    .1463512
       2010  |    .059464   .0298068     1.99   0.046     .0010438    .1178841
       2011  |   .0812638   .0290427     2.80   0.005     .0243412    .1381863
       2012  |   .0913113   .0287343     3.18   0.001     .0349931    .1476296
       2013  |   .1131033   .0299766     3.77   0.000     .0543502    .1718565
       2014  |   .1401023    .029959     4.68   0.000     .0813837    .1988209
             |
  1.dmarital |   .3312327   .0165018    20.07   0.000     .2988897    .3635757
             |
   schooling |
         12  |  -.0459104   .0308098    -1.49   0.136    -.1062965    .0144757
         14  |  -.1393429   .0358948    -3.88   0.000    -.2096955   -.0689904
         16  |  -.0824602   .0328446    -2.51   0.012    -.1468345   -.0180859
             |
  1.dregular |   .2581689   .0211859    12.19   0.000     .2166453    .2996926
    1.dunion |   .0463539    .015183     3.05   0.002     .0165958     .076112
             |
         occ |
          2  |   .3850947   .4850577     0.79   0.427     -.565601     1.33579
          3  |   .0582226   .3557061     0.16   0.870    -.6389486    .7553938
          4  |  -.0076992   .3562473    -0.02   0.983    -.7059311    .6905328
          5  |   .5883797   .3557484     1.65   0.098    -.1088744    1.285634
          6  |   .2001169   .3555567     0.56   0.574    -.4967615    .8969952
          7  |  -.0219872   .3561415    -0.06   0.951    -.7200118    .6760374
          8  |    .008836   .3549394     0.02   0.980    -.6868325    .7045045
          9  |   .0989519   .3563312     0.28   0.781    -.5994444    .7973482
         10  |   .1813744    .355595     0.51   0.610    -.5155791    .8783279
         11  |  -.0625743    .357853    -0.17   0.861    -.7639532    .6388046
         12  |   .1265206    .366638     0.35   0.730    -.5920767    .8451179
             |
         ind |
          2  |  -.0351308   .2141786    -0.16   0.870    -.4549133    .3846516
          3  |   -.427616   .3985634    -1.07   0.283    -1.208786    .3535539
          4  |  -.0471128   .3774927    -0.12   0.901    -.7869849    .6927592
          5  |  -.0048207   .3773391    -0.01   0.990    -.7443917    .7347504
          6  |  -.0746241   .3778297    -0.20   0.843    -.8151568    .6659086
          7  |  -.1938939    .379934    -0.51   0.610    -.9385509    .5507632
          8  |  -.1149464   .3788976    -0.30   0.762    -.8575719    .6276792
          9  |    .122293   .3831881     0.32   0.750    -.6287419    .8733279
         10  |  -.0986731   .3783883    -0.26   0.794    -.8403007    .6429544
         11  |  -.0005073   .3786354    -0.00   0.999    -.7426191    .7416044
         12  |   .0519582   .3791909     0.14   0.891    -.6912422    .7951587
         13  |   .0026835   .3808426     0.01   0.994    -.7437544    .7491213
         14  |  -.2469407   .3781698    -0.65   0.514    -.9881399    .4942585
         15  |   .0060248   .3796269     0.02   0.987    -.7380302    .7500798
         16  |  -.0812164      .3776    -0.22   0.830    -.8212989     .658866
         17  |  -.2970702   .4098296    -0.72   0.469    -1.100321    .5061809
         18  |   .0044151   .3833572     0.01   0.991    -.7469511    .7557813
             |
       dsize |
          1  |   .0843715   .0168547     5.01   0.000     .0513369    .1174061
          2  |   .2576742   .0167149    15.42   0.000     .2249136    .2904347
             |
  initialemp |   .0943452   .0005854   161.17   0.000     .0931979    .0954926
       _cons |   6.891544   .1357082    50.78   0.000      6.62556    7.157527
-------------+----------------------------------------------------------------
snd4_lnvar   |
       _cons |   -1.26897   .0218031   -58.20   0.000    -1.311703   -1.226237
------------------------------------------------------------------------------

 ( 1)  [fst4_mean]_cons - [snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0198115   .0622837    -0.32   0.750    -.1418853    .1022623
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst4 snd4
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp])*`X' ///
>                                 +[fst4_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif3]*`X'*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif4]*`X'*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst4_mean]emptendif2 + 8*[fst4_mean]emptendif3 +
       16*[fst4_mean]emptendif4 + 2*[fst4_mean]_cons - 2*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0394847     .12378    -0.32   0.750    -.2820889    .2031196
------------------------------------------------------------------------------

 ( 1)  25*[fst4_mean]emptendif2 + 125*[fst4_mean]emptendif3 +
       625*[fst4_mean]emptendif4 + 5*[fst4_mean]_cons - 5*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0945716   .3090351    -0.31   0.760    -.7002693    .5111261
------------------------------------------------------------------------------

 ( 1)  100*[fst4_mean]emptendif2 + 1000*[fst4_mean]emptendif3 +
       10000*[fst4_mean]emptendif4 + 10*[fst4_mean]_cons -
       10*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1607819   .6230588    -0.26   0.796    -1.381955    1.060391
------------------------------------------------------------------------------

 ( 1)  225*[fst4_mean]emptendif2 + 3375*[fst4_mean]emptendif3 +
       50625*[fst4_mean]emptendif4 + 15*[fst4_mean]_cons -
       15*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1829129   .9442526    -0.19   0.846    -2.033614    1.667788
------------------------------------------------------------------------------

 ( 1)  400*[fst4_mean]emptendif2 + 8000*[fst4_mean]emptendif3 +
       160000*[fst4_mean]emptendif4 + 20*[fst4_mean]_cons -
       20*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1630692    1.26905    -0.13   0.898    -2.650362    2.324223
------------------------------------------------------------------------------

 ( 1)  625*[fst4_mean]emptendif2 + 15625*[fst4_mean]emptendif3 +
       390625*[fst4_mean]emptendif4 + 25*[fst4_mean]_cons -
       25*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1211775   1.594196    -0.08   0.939    -3.245744    3.003389
------------------------------------------------------------------------------

. 
end of do-file
Year Dummy Type: Det

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd $Inputfd

. 
. qui {

. 
end of do-file

      Source |       SS           df       MS      Number of obs   =     8,821
-------------+----------------------------------   F(10, 8810)     =      2.06
       Model |  6.51552139        10  .651552139   Prob > F        =    0.0239
    Residual |  2782.06364     8,810  .315784749   R-squared       =    0.0023
-------------+----------------------------------   Adj R-squared   =    0.0012
       Total |  2788.57916     8,820  .316165438   Root MSE        =    .56195

------------------------------------------------------------------------------
    realwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        year |
       2005  |   .1012788   .0334769     3.03   0.002     .0356562    .1669014
       2006  |   .1015286   .0350214     2.90   0.004     .0328786    .1701787
       2007  |   .0614336   .0323128     1.90   0.057     -.001907    .1247741
       2008  |   .0587279   .0326825     1.80   0.072    -.0053374    .1227932
       2009  |   .1028271   .0287125     3.58   0.000     .0465439    .1591103
       2010  |   .0722408   .0290971     2.48   0.013     .0152036    .1292779
       2011  |    .084435   .0294339     2.87   0.004     .0267376    .1421324
       2012  |   .0582523   .0288682     2.02   0.044     .0016639    .1148407
       2013  |   .0706587   .0303453     2.33   0.020     .0111748    .1301427
       2014  |   .1080775   .0298639     3.62   0.000     .0495373    .1666178
             |
       _cons |   7.525666   .0233336   322.52   0.000     7.479927    7.571406
------------------------------------------------------------------------------
(766 missing values generated)
(8,821 real changes made)

. qui{

. 
. 
. * estimation
. forvalues i=1/4 {
  2.         **** 1st step
.         qui $FstReg ///
>                                 `contrl`i'' ///
>                                 if fst==1
  3.         est sto fst`i'
  4.         gen emptenB`i'=`LHSterm`i'' ///
>                                                                 $DmYear
  5.         gen intwemp`i'=realwage-emptenB`i'
  6.         
.         **** 2nd step
.         qui reg intwemp`i' ///
>                                 $SndReg
  7.         est sto snd`i'
  8. }
(865 missing values generated)
(1,564 missing values generated)
(930 missing values generated)
(1,624 missing values generated)
(930 missing values generated)
(1,624 missing values generated)
(930 missing values generated)
(1,624 missing values generated)

. 
. * calc. return
. ** linear
. capture program drop coef

. program coef, rclass
  1.         suest fst1 snd1
  2.         lincom [fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst1, snd1

                                                Number of obs     =      7,827

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst1_mean    |
       _cons |  -.0312308   .0053001    -5.89   0.000    -.0416188   -.0208429
-------------+----------------------------------------------------------------
fst1_lnvar   |
       _cons |  -1.999877    .056339   -35.50   0.000    -2.110299   -1.889454
-------------+----------------------------------------------------------------
snd1_mean    |
        year |
       2005  |   .0103866   .0389846     0.27   0.790    -.0660217     .086795
       2006  |  -.0078933   .0385689    -0.20   0.838    -.0834869    .0677002
       2007  |   .0200712   .0354861     0.57   0.572    -.0494802    .0896227
       2008  |   .0115339   .0364287     0.32   0.752     -.059865    .0829329
       2009  |  -.0038461   .0321534    -0.12   0.905    -.0668655    .0591733
       2010  |  -.0010178   .0329304    -0.03   0.975    -.0655602    .0635245
       2011  |   .0157033    .032185     0.49   0.626    -.0473781    .0787848
       2012  |   .0515093   .0318821     1.62   0.106    -.0109785    .1139971
       2013  |   .0649854    .033126     1.96   0.050     .0000597    .1299111
       2014  |   .0529578   .0331044     1.60   0.110    -.0119257    .1178413
             |
  1.dmarital |   .3955999   .0183089    21.61   0.000     .3597152    .4314847
             |
   schooling |
         12  |  -.1163426   .0326478    -3.56   0.000    -.1803312   -.0523541
         14  |  -.2404815   .0384125    -6.26   0.000    -.3157687   -.1651943
         16  |   -.204501    .034933    -5.85   0.000    -.2729684   -.1360337
             |
  1.dregular |   .2413291   .0226795    10.64   0.000     .1968782    .2857801
    1.dunion |   .0511258   .0165168     3.10   0.002     .0187534    .0834982
             |
         occ |
          2  |   .2685489   .5017146     0.54   0.592    -.7147936    1.251891
          3  |  -.1266596   .3341689    -0.38   0.705    -.7816186    .5282995
          4  |   -.193371   .3347975    -0.58   0.564    -.8495621    .4628201
          5  |   .4886376   .3341735     1.46   0.144    -.1663304    1.143606
          6  |   .0418227   .3339605     0.13   0.900    -.6127279    .6963732
          7  |  -.2142544   .3346581    -0.64   0.522    -.8701722    .4416634
          8  |  -.1828934   .3332113    -0.55   0.583    -.8359754    .4701887
          9  |  -.0986177   .3349565    -0.29   0.768    -.7551204    .5578849
         10  |  -.0051976   .3340002    -0.02   0.988    -.6598259    .6494308
         11  |  -.2595614   .3366328    -0.77   0.441    -.9193495    .4002267
         12  |  -.0329889   .3468288    -0.10   0.924    -.7127609    .6467831
             |
         ind |
          2  |   .0848576   .2271107     0.37   0.709    -.3602712    .5299865
          3  |  -.3466453   .3835503    -0.90   0.366     -1.09839    .4050994
          4  |   .1089656   .3634834     0.30   0.764    -.6034488      .82138
          5  |   .1607116   .3632932     0.44   0.658    -.5513299    .8727531
          6  |   .0854991   .3639568     0.23   0.814    -.6278432    .7988413
          7  |  -.0606625   .3663504    -0.17   0.868    -.7786962    .6573711
          8  |   .0309479   .3651784     0.08   0.932    -.6847886    .7466844
          9  |   .2706459   .3699076     0.73   0.464    -.4543597    .9956515
         10  |   .0635181   .3645937     0.17   0.862    -.6510724    .7781086
         11  |    .156353    .364869     0.43   0.668     -.558777    .8714831
         12  |   .2184835   .3656346     0.60   0.550    -.4981471    .9351141
         13  |   .1607892   .3676814     0.44   0.662    -.5598531    .8814314
         14  |  -.1133155   .3643322    -0.31   0.756    -.8273934    .6007625
         15  |   .1582925   .3660564     0.43   0.665    -.5591649    .8757499
         16  |   .0736437   .3636379     0.20   0.840    -.6390736    .7863609
         17  |  -.1519395   .4037493    -0.38   0.707    -.9432736    .6393947
         18  |   .1683708   .3700827     0.45   0.649     -.556978    .8937197
             |
       dsize |
          1  |   .0941375   .0180884     5.20   0.000     .0586849    .1295901
          2  |   .2798333   .0179061    15.63   0.000     .2447379    .3149286
             |
  initialemp |  -.0222084   .0006186   -35.90   0.000    -.0234208   -.0209961
       _cons |   .0913169   .1527821     0.60   0.550    -.2081305    .3907643
-------------+----------------------------------------------------------------
snd1_lnvar   |
       _cons |  -1.123458   .0197921   -56.76   0.000     -1.16225   -1.084667
------------------------------------------------------------------------------

 ( 1)  [fst1_mean]_cons - [snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0090224   .0053426    -1.69   0.091    -.0194936    .0014488
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst1 snd1
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp])*`X'
  4.         }
  5. end

. emprtn

 ( 1)  2*[fst1_mean]_cons - 2*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0180448   .0106851    -1.69   0.091    -.0389873    .0028976
------------------------------------------------------------------------------

 ( 1)  5*[fst1_mean]_cons - 5*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0451121   .0267128    -1.69   0.091    -.0974682     .007244
------------------------------------------------------------------------------

 ( 1)  10*[fst1_mean]_cons - 10*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0902242   .0534256    -1.69   0.091    -.1949365    .0144881
------------------------------------------------------------------------------

 ( 1)  15*[fst1_mean]_cons - 15*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1353363   .0801384    -1.69   0.091    -.2924047    .0217321
------------------------------------------------------------------------------

 ( 1)  20*[fst1_mean]_cons - 20*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1804484   .1068512    -1.69   0.091     -.389873    .0289762
------------------------------------------------------------------------------

 ( 1)  25*[fst1_mean]_cons - 25*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2255605   .1335641    -1.69   0.091    -.4873412    .0362202
------------------------------------------------------------------------------

. 
. ** qadratic
. capture program drop coef

. program coef, rclass
  1.         suest fst2 snd2
  2.         lincom [fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst2, snd2

                                                Number of obs     =      7,824

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst2_mean    |
  emptendif2 |  -4.27e-06   .0002493    -0.02   0.986    -.0004929    .0004844
  empexpdif2 |  -.0002947   .0002567    -1.15   0.251    -.0007979    .0002085
       _cons |  -.0157189    .015392    -1.02   0.307    -.0458868    .0144489
-------------+----------------------------------------------------------------
fst2_lnvar   |
       _cons |  -1.999269   .0564335   -35.43   0.000    -2.109876   -1.888661
-------------+----------------------------------------------------------------
snd2_mean    |
        year |
       2005  |   .0084581    .038579     0.22   0.826    -.0671552    .0840715
       2006  |  -.0128357   .0381594    -0.34   0.737    -.0876267    .0619554
       2007  |   .0178333   .0350145     0.51   0.611    -.0507939    .0864605
       2008  |   .0085328   .0359944     0.24   0.813     -.062015    .0790806
       2009  |  -.0055026   .0317006    -0.17   0.862    -.0676347    .0566295
       2010  |  -.0038024   .0324987    -0.12   0.907    -.0674987    .0598938
       2011  |   .0114787   .0317573     0.36   0.718    -.0507645    .0737219
       2012  |   .0483271   .0314909     1.53   0.125    -.0133939    .1100481
       2013  |   .0597615    .032768     1.82   0.068    -.0044625    .1239856
       2014  |   .0484885    .032722     1.48   0.138    -.0156455    .1126224
             |
  1.dmarital |   .3783531   .0178488    21.20   0.000     .3433702     .413336
             |
   schooling |
         12  |  -.1457889   .0328627    -4.44   0.000    -.2101986   -.0813793
         14  |  -.2671389   .0384727    -6.94   0.000    -.3425441   -.1917338
         16  |  -.2312472   .0350563    -6.60   0.000    -.2999562   -.1625381
             |
  1.dregular |   .2173303   .0227149     9.57   0.000       .17281    .2618506
    1.dunion |   .0552369   .0163022     3.39   0.001     .0232851    .0871888
             |
         occ |
          2  |   .2755051   .5276271     0.52   0.602     -.758625    1.309635
          3  |  -.1527192   .3279241    -0.47   0.641    -.7954386    .4900003
          4  |  -.2148391   .3285067    -0.65   0.513    -.8587003    .4290221
          5  |   .4554252   .3279014     1.39   0.165    -.1872498      1.0981
          6  |   .0144968   .3276647     0.04   0.965    -.6277142    .6567078
          7  |  -.2376676   .3283863    -0.72   0.469     -.881293    .4059578
          8  |  -.2119366   .3269049    -0.65   0.517    -.8526584    .4287853
          9  |  -.1235411   .3286305    -0.38   0.707    -.7676452    .5205629
         10  |  -.0292627   .3276841    -0.09   0.929    -.6715117    .6129864
         11  |  -.2797913    .330366    -0.85   0.397    -.9272967    .3677141
         12  |  -.0652808   .3409025    -0.19   0.848    -.7334373    .6028758
             |
         ind |
          2  |   .0900312   .2229421     0.40   0.686    -.3469272    .5269896
          3  |  -.3591852   .3796724    -0.95   0.344    -1.103329     .384959
          4  |   .1191595   .3590872     0.33   0.740    -.5846385    .8229575
          5  |   .1671105   .3588923     0.47   0.641    -.5363056    .8705265
          6  |   .0914552   .3596023     0.25   0.799    -.6133524    .7962627
          7  |  -.0533445   .3619754    -0.15   0.883    -.7628033    .6561144
          8  |   .0387622   .3607894     0.11   0.914    -.6683721    .7458965
          9  |   .2757534     .36559     0.75   0.451    -.4407898    .9922965
         10  |   .0664564   .3602185     0.18   0.854     -.639559    .7724717
         11  |   .1624854    .360456     0.45   0.652    -.5439953    .8689662
         12  |   .2300971   .3612045     0.64   0.524    -.4778508    .9380449
         13  |   .1799862   .3633135     0.50   0.620    -.5320952    .8920676
         14  |  -.1052108     .35992    -0.29   0.770     -.810641    .6002193
         15  |   .1709062    .361603     0.47   0.636    -.5378226     .879635
         16  |   .0829007   .3592491     0.23   0.818    -.6212146    .7870159
         17  |  -.1276882   .3980224    -0.32   0.748    -.9077978    .6524213
         18  |   .1817509   .3656748     0.50   0.619    -.5349587    .8984604
             |
       dsize |
          1  |   .0969527   .0178884     5.42   0.000      .061892    .1320134
          2  |   .2806532   .0177764    15.79   0.000     .2458122    .3154943
             |
  initialemp |  -.0068727   .0006169   -11.14   0.000    -.0080819   -.0056636
       _cons |   .0078564   .1557178     0.05   0.960    -.2973448    .3130576
-------------+----------------------------------------------------------------
snd2_lnvar   |
       _cons |  -1.141735   .0200089   -57.06   0.000    -1.180952   -1.102518
------------------------------------------------------------------------------

 ( 1)  [fst2_mean]_cons - [snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0088462   .0154172    -0.57   0.566    -.0390634     .021371
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst2 snd2
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp])*`X' ///
>                                 +[fst2_mean]_b[emptendif2]*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst2_mean]emptendif2 + 2*[fst2_mean]_cons - 2*[snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0177095   .0305996    -0.58   0.563    -.0776836    .0422645
------------------------------------------------------------------------------

 ( 1)  25*[fst2_mean]emptendif2 + 5*[fst2_mean]_cons - 5*[snd2_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0443379   .0757637    -0.59   0.558    -.1928321    .1041563
------------------------------------------------------------------------------

 ( 1)  100*[fst2_mean]emptendif2 + 10*[fst2_mean]_cons - 10*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0888892   .1498764    -0.59   0.553    -.3826415     .204863
------------------------------------------------------------------------------

 ( 1)  225*[fst2_mean]emptendif2 + 15*[fst2_mean]_cons - 15*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.133654   .2238777    -0.60   0.551    -.5724463    .3051382
------------------------------------------------------------------------------

 ( 1)  400*[fst2_mean]emptendif2 + 20*[fst2_mean]_cons - 20*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1786323   .2993334    -0.60   0.551    -.7653149    .4080503
------------------------------------------------------------------------------

 ( 1)  625*[fst2_mean]emptendif2 + 25*[fst2_mean]_cons - 25*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.223824    .377781    -0.59   0.554    -.9642611    .5166131
------------------------------------------------------------------------------

. 
. ** cubic
. capture program drop coef

. program coef, rclass
  1.         suest fst3 snd3
  2.         lincom [fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst3, snd3

                                                Number of obs     =      7,824

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst3_mean    |
  emptendif2 |   .0018727   .0009478     1.98   0.048     .0000151    .0037303
  empexpdif2 |  -.0017672   .0014403    -1.23   0.220    -.0045901    .0010557
  emptendif3 |  -.0000342   .0000166    -2.06   0.039    -.0000666   -1.71e-06
  empexpdif3 |   .0000215   .0000179     1.20   0.232    -.0000137    .0000566
       _cons |  -.0105001   .0325691    -0.32   0.747    -.0743343    .0533341
-------------+----------------------------------------------------------------
fst3_lnvar   |
       _cons |  -1.999771   .0563243   -35.50   0.000    -2.110165   -1.889377
-------------+----------------------------------------------------------------
snd3_mean    |
        year |
       2005  |   .0086919   .0381084     0.23   0.820    -.0659992    .0833829
       2006  |  -.0137684   .0375394    -0.37   0.714    -.0873442    .0598074
       2007  |   .0180628   .0344462     0.52   0.600    -.0494504    .0855761
       2008  |   .0069511   .0353166     0.20   0.844    -.0622681    .0761703
       2009  |   -.008157   .0311014    -0.26   0.793    -.0691146    .0528006
       2010  |  -.0080056   .0318796    -0.25   0.802    -.0704884    .0544773
       2011  |   .0049298   .0311372     0.16   0.874    -.0560981    .0659576
       2012  |   .0430731   .0308192     1.40   0.162    -.0173314    .1034777
       2013  |   .0547471    .032108     1.71   0.088    -.0081835    .1176776
       2014  |    .044438   .0320643     1.39   0.166    -.0184068    .1072829
             |
  1.dmarital |   .3644901   .0174062    20.94   0.000     .3303747    .3986056
             |
   schooling |
         12  |  -.1025613   .0327034    -3.14   0.002    -.1666589   -.0384638
         14  |  -.2158594   .0381334    -5.66   0.000    -.2905995   -.1411192
         16  |  -.1742705   .0348663    -5.00   0.000    -.2426073   -.1059338
             |
  1.dregular |   .2313394   .0227558    10.17   0.000     .1867387      .27594
    1.dunion |   .0536009   .0160436     3.34   0.001      .022156    .0850458
             |
         occ |
          2  |   .3102615   .4967028     0.62   0.532     -.663258    1.283781
          3  |  -.0157381    .345915    -0.05   0.964    -.6937189    .6622428
          4  |  -.0751326   .3464035    -0.22   0.828     -.754071    .6038058
          5  |   .5676955   .3458336     1.64   0.101     -.110126    1.245517
          6  |   .1422128   .3456021     0.41   0.681    -.5351549    .8195806
          7  |  -.1018066   .3462846    -0.29   0.769    -.7805119    .5768987
          8  |  -.0717072   .3448705    -0.21   0.835     -.747641    .6042265
          9  |   .0124583   .3464927     0.04   0.971     -.666655    .6915716
         10  |   .1047816   .3456124     0.30   0.762    -.5726061    .7821694
         11  |  -.1346862   .3482531    -0.39   0.699    -.8172498    .5478774
         12  |   .0584592   .3581073     0.16   0.870    -.6434182    .7603366
             |
         ind |
          2  |   .0317396   .2216404     0.14   0.886    -.4026677    .4661469
          3  |  -.4300268   .3938626    -1.09   0.275    -1.201983    .3419296
          4  |   .0116699    .371848     0.03   0.975    -.7171388    .7404787
          5  |   .0573635    .371644     0.15   0.877    -.6710455    .7857724
          6  |  -.0142168    .372365    -0.04   0.970    -.7440388    .7156052
          7  |  -.1622506   .3745588    -0.43   0.665    -.8963723    .5718711
          8  |  -.0712548    .373455    -0.19   0.849    -.8032132    .6607036
          9  |    .180916   .3779664     0.48   0.632    -.5598845    .9217165
         10  |  -.0418987   .3729148    -0.11   0.911    -.7727984     .689001
         11  |   .0543793    .373139     0.15   0.884    -.6769596    .7857182
         12  |   .1261469   .3738154     0.34   0.736    -.6065178    .8588115
         13  |    .066003   .3758764     0.18   0.861    -.6707012    .8027072
         14  |  -.2074704    .372604    -0.56   0.578    -.9377608      .52282
         15  |   .0677349   .3741995     0.18   0.856    -.6656826    .8011524
         16  |  -.0258516   .3719898    -0.07   0.945    -.7549383    .7032351
         17  |  -.2434197   .4073774    -0.60   0.550    -1.041865    .5550253
         18  |   .0803333   .3784845     0.21   0.832    -.6614826    .8221492
             |
       dsize |
          1  |   .0909994   .0176672     5.15   0.000     .0563724    .1256264
          2  |   .2718386   .0175513    15.49   0.000     .2374387    .3062384
             |
  initialemp |   .0221846   .0006155    36.04   0.000     .0209782    .0233909
       _cons |    -.18225    .146691    -1.24   0.214     -.469759    .1052591
-------------+----------------------------------------------------------------
snd3_lnvar   |
       _cons |  -1.165033   .0204549   -56.96   0.000    -1.205124   -1.124942
------------------------------------------------------------------------------

 ( 1)  [fst3_mean]_cons - [snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0326847   .0325869    -1.00   0.316    -.0965538    .0311844
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst3 snd3
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp])*`X' ///
>                                 +[fst3_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst3_mean]_b[emptendif3]*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst3_mean]emptendif2 + 8*[fst3_mean]emptendif3 + 2*[fst3_mean]_cons -
       2*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0581519   .0649409    -0.90   0.371    -.1854336    .0691299
------------------------------------------------------------------------------

 ( 1)  25*[fst3_mean]emptendif2 + 125*[fst3_mean]emptendif3 + 5*[fst3_mean]_cons
       - 5*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1208761   .1624482    -0.74   0.457    -.4392687    .1975164
------------------------------------------------------------------------------

 ( 1)  100*[fst3_mean]emptendif2 + 1000*[fst3_mean]emptendif3 +
       10*[fst3_mean]_cons - 10*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1737387   .3287956    -0.53   0.597    -.8181663    .4706889
------------------------------------------------------------------------------

 ( 1)  225*[fst3_mean]emptendif2 + 3375*[fst3_mean]emptendif3 +
       15*[fst3_mean]_cons - 15*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1842095    .502419    -0.37   0.714    -1.168933    .8005136
------------------------------------------------------------------------------

 ( 1)  400*[fst3_mean]emptendif2 + 8000*[fst3_mean]emptendif3 +
       20*[fst3_mean]_cons - 20*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1779103   .6828391    -0.26   0.794     -1.51625     1.16043
------------------------------------------------------------------------------

 ( 1)  625*[fst3_mean]emptendif2 + 15625*[fst3_mean]emptendif3 +
       25*[fst3_mean]_cons - 25*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1804629   .8675265    -0.21   0.835    -1.880783    1.519858
------------------------------------------------------------------------------

. 
. ** quartic
. capture program drop coef

. program coef, rclass
  1.         suest fst4 snd4
  2.         lincom [fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst4, snd4

                                                Number of obs     =      7,824

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst4_mean    |
  emptendif2 |  -.0001701   .0021584    -0.08   0.937    -.0044005    .0040604
  empexpdif2 |   -.006422   .0043282    -1.48   0.138    -.0149051     .002061
  emptendif3 |   .0000594   .0000871     0.68   0.495    -.0001112    .0002301
  empexpdif3 |   .0001523   .0001181     1.29   0.197    -.0000791    .0003838
  emptendif4 |  -1.22e-06   1.09e-06    -1.12   0.262    -3.36e-06    9.15e-07
  empexpdif4 |  -1.23e-06   1.11e-06    -1.11   0.267    -3.41e-06    9.43e-07
       _cons |   .0625975   .0620396     1.01   0.313    -.0589979    .1841929
-------------+----------------------------------------------------------------
fst4_lnvar   |
       _cons |  -2.000172   .0563294   -35.51   0.000    -2.110576   -1.889769
-------------+----------------------------------------------------------------
snd4_mean    |
        year |
       2005  |   .0067435   .0380203     0.18   0.859     -.067775    .0812619
       2006  |   -.012301   .0374264    -0.33   0.742    -.0856554    .0610535
       2007  |   .0186666   .0343599     0.54   0.587    -.0486776    .0860107
       2008  |   .0039277   .0351988     0.11   0.911    -.0650607    .0729161
       2009  |  -.0094365   .0309976    -0.30   0.761    -.0701906    .0513177
       2010  |  -.0077602   .0318079    -0.24   0.807    -.0701025     .054582
       2011  |   .0044787   .0310274     0.14   0.885    -.0563338    .0652913
       2012  |   .0420243   .0307257     1.37   0.171     -.018197    .1022455
       2013  |   .0551652   .0320084     1.72   0.085      -.00757    .1179005
       2014  |   .0459906   .0319893     1.44   0.151    -.0167074    .1086885
             |
  1.dmarital |   .3666912   .0175229    20.93   0.000     .3323468    .4010355
             |
   schooling |
         12  |  -.0885147   .0326258    -2.71   0.007    -.1524601   -.0245693
         14  |  -.2037608   .0380866    -5.35   0.000    -.2784091   -.1291124
         16  |   -.160376   .0347978    -4.61   0.000    -.2285785   -.0921735
             |
  1.dregular |   .2412299   .0226933    10.63   0.000     .1967517     .285708
    1.dunion |   .0498641   .0160844     3.10   0.002     .0183393    .0813889
             |
         occ |
          2  |   .4022987   .4971671     0.81   0.418    -.5721309    1.376728
          3  |   .0338479   .3401258     0.10   0.921    -.6327865    .7004823
          4  |  -.0248465   .3407017    -0.07   0.942    -.6926095    .6429166
          5  |   .6155986   .3400903     1.81   0.070    -.0509662    1.282163
          6  |   .1928944   .3398665     0.57   0.570    -.4732317    .8590205
          7  |  -.0532731   .3405644    -0.16   0.876     -.720767    .6142208
          8  |  -.0224768   .3391448    -0.07   0.947    -.6871884    .6422347
          9  |   .0632815   .3407776     0.19   0.853    -.6046303    .7311933
         10  |   .1556097   .3398912     0.46   0.647    -.5105648    .8217842
         11  |  -.0832259   .3426339    -0.24   0.808    -.7547761    .5883242
         12  |   .1087946   .3526031     0.31   0.758    -.5822948    .7998839
             |
         ind |
          2  |  -.0138459   .2200939    -0.06   0.950    -.4452221    .4175303
          3  |   -.495896   .3890423    -1.27   0.202    -1.258405    .2666129
          4  |  -.0507841   .3666553    -0.14   0.890    -.7694154    .6678471
          5  |  -.0045552   .3664562    -0.01   0.990    -.7227961    .7136858
          6  |  -.0783714    .367129    -0.21   0.831    -.7979309    .6411882
          7  |  -.2265496   .3693618    -0.61   0.540    -.9504855    .4973862
          8  |    -.13384   .3682389    -0.36   0.716    -.8555749     .587895
          9  |   .1187998   .3729856     0.32   0.750    -.6122385    .8498381
         10  |   -.106906   .3677155    -0.29   0.771    -.8276151    .6138032
         11  |  -.0066279   .3679387    -0.02   0.986    -.7277746    .7145187
         12  |   .0511093   .3686529     0.14   0.890    -.6714371    .7736558
         13  |  -.0044968   .3706276    -0.01   0.990    -.7309135    .7219198
         14  |  -.2703642   .3674335    -0.74   0.462    -.9905208    .4497923
         15  |  -.0034444   .3690323    -0.01   0.993    -.7267343    .7198456
         16  |  -.0903079   .3668021    -0.25   0.806    -.8092268    .6286111
         17  |  -.3191274   .4033857    -0.79   0.429    -1.109749    .4714941
         18  |   .0040343   .3734136     0.01   0.991    -.7278429    .7359115
             |
       dsize |
          1  |   .0909661   .0178071     5.11   0.000     .0560648    .1258673
          2  |   .2725793   .0176072    15.48   0.000     .2380699    .3070888
             |
  initialemp |   .0840991   .0006147   136.80   0.000     .0828942     .085304
       _cons |  -.4178451   .1468272    -2.85   0.004    -.7056211   -.1300691
-------------+----------------------------------------------------------------
snd4_lnvar   |
       _cons |  -1.160082   .0204323   -56.78   0.000    -1.200128   -1.120035
------------------------------------------------------------------------------

 ( 1)  [fst4_mean]_cons - [snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0215016   .0620492    -0.35   0.729    -.1431159    .1001127
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst4 snd4
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp])*`X' ///
>                                 +[fst4_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif3]*`X'*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif4]*`X'*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst4_mean]emptendif2 + 8*[fst4_mean]emptendif3 +
       16*[fst4_mean]emptendif4 + 2*[fst4_mean]_cons - 2*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0432276   .1233068    -0.35   0.726    -.2849044    .1984492
------------------------------------------------------------------------------

 ( 1)  25*[fst4_mean]emptendif2 + 125*[fst4_mean]emptendif3 +
       625*[fst4_mean]emptendif4 + 5*[fst4_mean]_cons - 5*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.105095   .3078439    -0.34   0.733    -.7084579    .4982679
------------------------------------------------------------------------------

 ( 1)  100*[fst4_mean]emptendif2 + 1000*[fst4_mean]emptendif3 +
       10000*[fst4_mean]emptendif4 + 10*[fst4_mean]_cons -
       10*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1848131   .6206683    -0.30   0.766    -1.401301    1.031674
------------------------------------------------------------------------------

 ( 1)  225*[fst4_mean]emptendif2 + 3375*[fst4_mean]emptendif3 +
       50625*[fst4_mean]emptendif4 + 15*[fst4_mean]_cons -
       15*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2220686   .9406633    -0.24   0.813    -2.065735    1.621598
------------------------------------------------------------------------------

 ( 1)  400*[fst4_mean]emptendif2 + 8000*[fst4_mean]emptendif3 +
       160000*[fst4_mean]emptendif4 + 20*[fst4_mean]_cons -
       20*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.2180963    1.26426    -0.17   0.863       -2.696    2.259807
------------------------------------------------------------------------------

 ( 1)  625*[fst4_mean]emptendif2 + 15625*[fst4_mean]emptendif3 +
       390625*[fst4_mean]emptendif4 + 25*[fst4_mean]_cons -
       25*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1924517   1.588213    -0.12   0.904    -3.305292    2.920388
------------------------------------------------------------------------------

. 
end of do-file

.  
. 
. ** changing control variables
. qui{

. 
. local charList pred infr all

. foreach eq_i of local charList{
  2.         global SndReg ``eq_i'' ///
>                                                         i. year initialemp
  3.         
.         dis "Controls: `eq_i'"
  4.         do "$Code\ReadData.do"
  5.         
.         do "$Code\EstTopel.do"
  6.         
.         *** output tex all results
.         quietly {
  7.         **** coefficients 
.         esttab fst1 fst2 fst3 fst4 ///
>         using "$Output\topel_`eq_i'.tex", ///
>         se star(* 0.1 ** 0.05 *** 0.01) b(4) ///
>         keep( ///
>                         _cons emptendif2 emptendif3 emptendif4 ///
>                         empexpdif2 empexpdif3 empexpdif4 ///
>                         ) ///
>         order( ///
>                         _cons emptendif2 emptendif3 emptendif4 ///
>                         empexpdif2 empexpdif3 empexpdif4 ///
>                         ) ///
>         coeflabel( ///
>                         _cons "Constant" ///
>                         emptendif2 "Emp.ten.$^{2}\times 100$" ///
>                         emptendif3 "Emp.ten.$^{3}\times 1000$" ///
>                         emptendif4 "Emp.ten.$^{4}\times 10000$" ///
>                         empexpdif2 "Experience$^{2}\times 100$" ///
>                         empexpdif3 "Experience$^{3}\times 1000$" ///
>                         empexpdif4 "Experience$^{4}\times 10000$" ///
>                         ) ///
>         transform( ///
>                         emptendif2 100*@ 100 ///
>                         emptendif3 1000*@ 1000 ///
>                         emptendif4 10000*@ 10000 ///
>                         empexpdif2 100*@ 100 ///
>                         empexpdif3 1000*@ 1000 ///
>                         empexpdif4 10000*@ 10000 ///
>                         ) ///
>         nodep nonote nomtitles ///
>         title("Estimation Results, using the Method of 2SFD Estimation.") ///
>         replace
  8.         }
  9. }
Controls: pred

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd $Inputfd

. 
. qui {

. 
end of do-file

. qui{

. 
. 
. * estimation
. forvalues i=1/4 {
  2.         **** 1st step
.         qui $FstReg ///
>                                 `contrl`i'' ///
>                                 if fst==1
  3.         est sto fst`i'
  4.         gen emptenB`i'=`LHSterm`i'' ///
>                                                                 $DmYear
  5.         gen intwemp`i'=realwage-emptenB`i'
  6.         
.         **** 2nd step
.         qui reg intwemp`i' ///
>                                 $SndReg
  7.         est sto snd`i'
  8. }
(865 missing values generated)
(1,564 missing values generated)
(930 missing values generated)
(1,624 missing values generated)
(930 missing values generated)
(1,624 missing values generated)
(930 missing values generated)
(1,624 missing values generated)

. 
. * calc. return
. ** linear
. capture program drop coef

. program coef, rclass
  1.         suest fst1 snd1
  2.         lincom [fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst1, snd1

                                                Number of obs     =      7,962

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst1_mean    |
       _cons |  -.0244802   .0053035    -4.62   0.000    -.0348748   -.0140856
-------------+----------------------------------------------------------------
fst1_lnvar   |
       _cons |  -1.998589   .0568091   -35.18   0.000    -2.109933   -1.887246
-------------+----------------------------------------------------------------
snd1_mean    |
   schooling |
         12  |   .0447448   .0315992     1.42   0.157    -.0171885    .1066781
         14  |  -.0590352   .0374748    -1.58   0.115    -.1324845     .014414
         16  |   .1301927   .0328411     3.96   0.000     .0658252    .1945601
             |
        year |
       2005  |   .1313639   .0403845     3.25   0.001     .0522117    .2105161
       2006  |   .1125698   .0404507     2.78   0.005     .0332879    .1918518
       2007  |   .0927722   .0374064     2.48   0.013      .019457    .1660875
       2008  |   .0940864   .0381509     2.47   0.014      .019312    .1688608
       2009  |   .0986629    .033776     2.92   0.003     .0324632    .1648625
       2010  |   .0674298   .0346672     1.95   0.052    -.0005167    .1353764
       2011  |   .0918517   .0341313     2.69   0.007     .0249555    .1587479
       2012  |   .0773536   .0333662     2.32   0.020     .0119569    .1427502
       2013  |   .1029489   .0347711     2.96   0.003     .0347987    .1710991
       2014  |   .1341365   .0347274     3.86   0.000      .066072     .202201
             |
  initialemp |  -.0269086   .0005432   -49.54   0.000    -.0279733   -.0258439
       _cons |   8.096907   .0410641   197.18   0.000     8.016423    8.177391
-------------+----------------------------------------------------------------
snd1_lnvar   |
       _cons |   -.952677   .0171413   -55.58   0.000    -.9862733   -.9190806
------------------------------------------------------------------------------

 ( 1)  [fst1_mean]_cons - [snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0024284   .0053503     0.45   0.650    -.0080579    .0129148
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst1 snd1
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp])*`X'
  4.         }
  5. end

. emprtn

 ( 1)  2*[fst1_mean]_cons - 2*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0048569   .0107006     0.45   0.650    -.0161159    .0258296
------------------------------------------------------------------------------

 ( 1)  5*[fst1_mean]_cons - 5*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0121422   .0267515     0.45   0.650    -.0402897     .064574
------------------------------------------------------------------------------

 ( 1)  10*[fst1_mean]_cons - 10*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0242843   .0535029     0.45   0.650    -.0805794    .1291481
------------------------------------------------------------------------------

 ( 1)  15*[fst1_mean]_cons - 15*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0364265   .0802544     0.45   0.650    -.1208692    .1937221
------------------------------------------------------------------------------

 ( 1)  20*[fst1_mean]_cons - 20*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0485686   .1070058     0.45   0.650    -.1611589    .2582962
------------------------------------------------------------------------------

 ( 1)  25*[fst1_mean]_cons - 25*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0607108   .1337573     0.45   0.650    -.2014486    .3228702
------------------------------------------------------------------------------

. 
. ** qadratic
. capture program drop coef

. program coef, rclass
  1.         suest fst2 snd2
  2.         lincom [fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst2, snd2

                                                Number of obs     =      7,959

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst2_mean    |
  emptendif2 |   .0000192    .000249     0.08   0.939    -.0004688    .0005072
  empexpdif2 |  -.0002931   .0002571    -1.14   0.254     -.000797    .0002109
       _cons |  -.0097906   .0154353    -0.63   0.526    -.0400433    .0204621
-------------+----------------------------------------------------------------
fst2_lnvar   |
       _cons |  -1.997988   .0568955   -35.12   0.000    -2.109501   -1.886475
-------------+----------------------------------------------------------------
snd2_mean    |
   schooling |
         12  |   .0158387   .0319229     0.50   0.620    -.0467291    .0784065
         14  |  -.0827292   .0375528    -2.20   0.028    -.1563312   -.0091271
         16  |   .1043281    .033082     3.15   0.002     .0394885    .1691677
             |
        year |
       2005  |   .1270149   .0396772     3.20   0.001     .0492491    .2047807
       2006  |   .1055884   .0397524     2.66   0.008     .0276752    .1835016
       2007  |   .0890558   .0366267     2.43   0.015     .0172688    .1608427
       2008  |   .0892771   .0374228     2.39   0.017     .0159298    .1626243
       2009  |   .0960353    .033052     2.91   0.004     .0312545    .1608161
       2010  |   .0643553   .0339899     1.89   0.058    -.0022636    .1309743
       2011  |   .0866791   .0334594     2.59   0.010     .0210998    .1522584
       2012  |   .0737171   .0327268     2.25   0.024     .0095736    .1378605
       2013  |   .0970045   .0341364     2.84   0.004     .0300985    .1639105
       2014  |   .1277804   .0340808     3.75   0.000     .0609832    .1945776
             |
  initialemp |  -.0114008   .0005433   -20.98   0.000    -.0124656   -.0103359
       _cons |    7.96207   .0408475   194.92   0.000      7.88201    8.042129
-------------+----------------------------------------------------------------
snd2_lnvar   |
       _cons |  -.9795896   .0172718   -56.72   0.000    -1.013442   -.9457375
------------------------------------------------------------------------------

 ( 1)  [fst2_mean]_cons - [snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0016102   .0154579     0.10   0.917    -.0286868    .0319072
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst2 snd2
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp])*`X' ///
>                                 +[fst2_mean]_b[emptendif2]*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst2_mean]emptendif2 + 2*[fst2_mean]_cons - 2*[snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0032972   .0306811     0.11   0.914    -.0568366    .0634311
------------------------------------------------------------------------------

 ( 1)  25*[fst2_mean]emptendif2 + 5*[fst2_mean]_cons - 5*[snd2_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0085309    .075967     0.11   0.911    -.1403616    .1574234
------------------------------------------------------------------------------

 ( 1)  100*[fst2_mean]emptendif2 + 10*[fst2_mean]_cons - 10*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0180214   .1502763     0.12   0.905    -.2765146    .3125575
------------------------------------------------------------------------------

 ( 1)  225*[fst2_mean]emptendif2 + 15*[fst2_mean]_cons - 15*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0284715    .224459     0.13   0.899      -.41146     .468403
------------------------------------------------------------------------------

 ( 1)  400*[fst2_mean]emptendif2 + 20*[fst2_mean]_cons - 20*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0398812   .3000721     0.13   0.894    -.5482493    .6280117
------------------------------------------------------------------------------

 ( 1)  625*[fst2_mean]emptendif2 + 25*[fst2_mean]_cons - 25*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0522504   .3786459     0.14   0.890    -.6898819    .7943827
------------------------------------------------------------------------------

. 
. ** cubic
. capture program drop coef

. program coef, rclass
  1.         suest fst3 snd3
  2.         lincom [fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst3, snd3

                                                Number of obs     =      7,959

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst3_mean    |
  emptendif2 |   .0018999   .0009484     2.00   0.045     .0000411    .0037588
  empexpdif2 |  -.0018734   .0014468    -1.29   0.195    -.0047092    .0009624
  emptendif3 |  -.0000342   .0000166    -2.06   0.039    -.0000666   -1.71e-06
  empexpdif3 |   .0000228    .000018     1.27   0.205    -.0000125    .0000581
       _cons |  -.0023185   .0327062    -0.07   0.943    -.0664215    .0617845
-------------+----------------------------------------------------------------
fst3_lnvar   |
       _cons |  -1.998503   .0567845   -35.19   0.000    -2.109798   -1.887207
-------------+----------------------------------------------------------------
snd3_mean    |
   schooling |
         12  |   .0561636   .0317171     1.77   0.077    -.0060008    .1183281
         14  |  -.0333966    .037163    -0.90   0.369    -.1062348    .0394416
         16  |   .1540309    .032902     4.68   0.000     .0895441    .2185177
             |
        year |
       2005  |   .1257198   .0390371     3.22   0.001     .0492085    .2022311
       2006  |   .1026116   .0389795     2.63   0.008     .0262132    .1790101
       2007  |   .0879622   .0358542     2.45   0.014     .0176893    .1582351
       2008  |   .0866788   .0366473     2.37   0.018     .0148514    .1585063
       2009  |   .0931147   .0323354     2.88   0.004     .0297386    .1564908
       2010  |   .0596328   .0332443     1.79   0.073    -.0055247    .1247904
       2011  |   .0798411   .0327196     2.44   0.015     .0157118    .1439704
       2012  |   .0685596   .0319622     2.15   0.032     .0059149    .1312043
       2013  |   .0918093   .0334026     2.75   0.006     .0263414    .1572772
       2014  |    .124084   .0333399     3.72   0.000     .0587391    .1894289
             |
  initialemp |   .0200963   .0005382    37.34   0.000     .0190414    .0211512
       _cons |   7.785049   .0400947   194.17   0.000     7.706465    7.863633
-------------+----------------------------------------------------------------
snd3_lnvar   |
       _cons |  -1.007748   .0176638   -57.05   0.000    -1.042368   -.9731273
------------------------------------------------------------------------------

 ( 1)  [fst3_mean]_cons - [snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0224148   .0327186    -0.69   0.493    -.0865421    .0417126
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst3 snd3
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp])*`X' ///
>                                 +[fst3_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst3_mean]_b[emptendif3]*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst3_mean]emptendif2 + 8*[fst3_mean]emptendif3 + 2*[fst3_mean]_cons -
       2*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0375031    .065209    -0.58   0.565    -.1653104    .0903042
------------------------------------------------------------------------------

 ( 1)  25*[fst3_mean]emptendif2 + 125*[fst3_mean]emptendif3 + 5*[fst3_mean]_cons
       - 5*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0688458   .1631327    -0.42   0.673    -.3885801    .2508885
------------------------------------------------------------------------------

 ( 1)  100*[fst3_mean]emptendif2 + 1000*[fst3_mean]emptendif3 +
       10*[fst3_mean]_cons - 10*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0683151   .3302005    -0.21   0.836    -.7154962    .5788659
------------------------------------------------------------------------------

 ( 1)  225*[fst3_mean]emptendif2 + 3375*[fst3_mean]emptendif3 +
       15*[fst3_mean]_cons - 15*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0240272   .5045674    -0.05   0.962    -1.012961    .9649068
------------------------------------------------------------------------------

 ( 1)  400*[fst3_mean]emptendif2 + 8000*[fst3_mean]emptendif3 +
       20*[fst3_mean]_cons - 20*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0383989   .6857529     0.06   0.955    -1.305652     1.38245
------------------------------------------------------------------------------

 ( 1)  625*[fst3_mean]emptendif2 + 15625*[fst3_mean]emptendif3 +
       25*[fst3_mean]_cons - 25*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0933439    .871229     0.11   0.915    -1.614234    1.800921
------------------------------------------------------------------------------

. 
. ** quartic
. capture program drop coef

. program coef, rclass
  1.         suest fst4 snd4
  2.         lincom [fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst4, snd4

                                                Number of obs     =      7,959

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst4_mean    |
  emptendif2 |  -.0000739   .0021587    -0.03   0.973    -.0043049    .0041572
  empexpdif2 |  -.0068768   .0043441    -1.58   0.113    -.0153912    .0016375
  emptendif3 |   .0000566   .0000871     0.65   0.516    -.0001141    .0002273
  empexpdif3 |   .0001643   .0001185     1.39   0.166    -.0000681    .0003966
  emptendif4 |  -1.19e-06   1.09e-06    -1.09   0.276    -3.32e-06    9.48e-07
  empexpdif4 |  -1.34e-06   1.11e-06    -1.20   0.230    -3.52e-06    8.47e-07
       _cons |   .0745337   .0622757     1.20   0.231    -.0475245     .196592
-------------+----------------------------------------------------------------
fst4_lnvar   |
       _cons |  -1.998949   .0567861   -35.20   0.000    -2.110248    -1.88765
-------------+----------------------------------------------------------------
snd4_mean    |
   schooling |
         12  |   .0710934   .0315506     2.25   0.024     .0092553    .1329316
         14  |  -.0198766   .0370362    -0.54   0.591    -.0924662    .0527131
         16  |   .1697126   .0327419     5.18   0.000     .1055397    .2338856
             |
        year |
       2005  |   .1240637   .0389071     3.19   0.001     .0478073    .2003202
       2006  |     .10413   .0388623     2.68   0.007     .0279614    .1802986
       2007  |   .0880369   .0357199     2.46   0.014     .0180271    .1580467
       2008  |   .0837193   .0365302     2.29   0.022     .0121213    .1553172
       2009  |   .0917512   .0322066     2.85   0.004     .0286274     .154875
       2010  |   .0593555   .0331407     1.79   0.073    -.0055991      .12431
       2011  |   .0794791   .0325995     2.44   0.015     .0155853    .1433729
       2012  |   .0678059   .0318548     2.13   0.033     .0053716    .1302401
       2013  |   .0916698   .0333062     2.75   0.006     .0263909    .1569488
       2014  |   .1258424   .0332515     3.78   0.000     .0606707    .1910142
             |
  initialemp |   .0860926   .0005353   160.82   0.000     .0850433    .0871418
       _cons |   7.531131   .0397128   189.64   0.000     7.453295    7.608967
-------------+----------------------------------------------------------------
snd4_lnvar   |
       _cons |   -1.00141   .0176139   -56.85   0.000    -1.035933   -.9668875
------------------------------------------------------------------------------

 ( 1)  [fst4_mean]_cons - [snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0115588   .0622771    -0.19   0.853    -.1336197     .110502
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst4 snd4
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp])*`X' ///
>                                 +[fst4_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif3]*`X'*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif4]*`X'*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst4_mean]emptendif2 + 8*[fst4_mean]emptendif3 +
       16*[fst4_mean]emptendif4 + 2*[fst4_mean]_cons - 2*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0229793   .1237654    -0.19   0.853     -.265555    .2195963
------------------------------------------------------------------------------

 ( 1)  25*[fst4_mean]emptendif2 + 125*[fst4_mean]emptendif3 +
       625*[fst4_mean]emptendif4 + 5*[fst4_mean]_cons - 5*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0533082   .3089947    -0.17   0.863    -.6589267    .5523103
------------------------------------------------------------------------------

 ( 1)  100*[fst4_mean]emptendif2 + 1000*[fst4_mean]emptendif3 +
       10000*[fst4_mean]emptendif4 + 10*[fst4_mean]_cons -
       10*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0782551   .6229699    -0.13   0.900    -1.299254    1.142743
------------------------------------------------------------------------------

 ( 1)  225*[fst4_mean]emptendif2 + 3375*[fst4_mean]emptendif3 +
       50625*[fst4_mean]emptendif4 + 15*[fst4_mean]_cons -
       15*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0591228   .9441142    -0.06   0.950    -1.909553    1.791307
------------------------------------------------------------------------------

 ( 1)  400*[fst4_mean]emptendif2 + 8000*[fst4_mean]emptendif3 +
       160000*[fst4_mean]emptendif4 + 20*[fst4_mean]_cons -
       20*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0019843   1.268865     0.00   0.999    -2.484945    2.488914
------------------------------------------------------------------------------

 ( 1)  625*[fst4_mean]emptendif2 + 15625*[fst4_mean]emptendif3 +
       390625*[fst4_mean]emptendif4 + 25*[fst4_mean]_cons -
       25*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0851393   1.593969     0.05   0.957    -3.038982     3.20926
------------------------------------------------------------------------------

. 
end of do-file
Controls: infr

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd $Inputfd

. 
. qui {

. 
end of do-file

. qui{

. 
. 
. * estimation
. forvalues i=1/4 {
  2.         **** 1st step
.         qui $FstReg ///
>                                 `contrl`i'' ///
>                                 if fst==1
  3.         est sto fst`i'
  4.         gen emptenB`i'=`LHSterm`i'' ///
>                                                                 $DmYear
  5.         gen intwemp`i'=realwage-emptenB`i'
  6.         
.         **** 2nd step
.         qui reg intwemp`i' ///
>                                 $SndReg
  7.         est sto snd`i'
  8. }
(865 missing values generated)
(1,564 missing values generated)
(930 missing values generated)
(1,624 missing values generated)
(930 missing values generated)
(1,624 missing values generated)
(930 missing values generated)
(1,624 missing values generated)

. 
. * calc. return
. ** linear
. capture program drop coef

. program coef, rclass
  1.         suest fst1 snd1
  2.         lincom [fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst1, snd1

                                                Number of obs     =      7,892

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst1_mean    |
       _cons |  -.0244802   .0053035    -4.62   0.000    -.0348748   -.0140855
-------------+----------------------------------------------------------------
fst1_lnvar   |
       _cons |  -1.998589   .0568091   -35.18   0.000    -2.109933   -1.887246
-------------+----------------------------------------------------------------
snd1_mean    |
  1.dmarital |   .4888766   .0180367    27.10   0.000     .4535254    .5242278
             |
   schooling |
         12  |   .0299825   .0310638     0.97   0.334    -.0309015    .0908665
         14  |  -.0317919   .0368574    -0.86   0.388    -.1040311    .0404472
         16  |   .1278057   .0322161     3.97   0.000     .0646633    .1909482
             |
    1.dunion |   .0876565   .0150798     5.81   0.000     .0581007    .1172123
             |
        year |
       2005  |   .1223905   .0381117     3.21   0.001     .0476929    .1970881
       2006  |   .1048195   .0377174     2.78   0.005     .0308948    .1787442
       2007  |   .0845595   .0348081     2.43   0.015     .0163368    .1527822
       2008  |   .0846686   .0356583     2.37   0.018     .0147797    .1545575
       2009  |   .1021936   .0316477     3.23   0.001     .0401653    .1642219
       2010  |   .0733393   .0325826     2.25   0.024     .0094786    .1371999
       2011  |   .1026474   .0321155     3.20   0.001     .0397022    .1655926
       2012  |   .0891809   .0313276     2.85   0.004       .02778    .1505818
       2013  |   .1155841   .0328117     3.52   0.000     .0512742    .1798939
       2014  |   .1404268   .0328913     4.27   0.000      .075961    .2048926
             |
  initialemp |  -.0251561     .00056   -44.92   0.000    -.0262538   -.0240585
       _cons |   7.648569    .042572   179.66   0.000      7.56513    7.732009
-------------+----------------------------------------------------------------
snd1_lnvar   |
       _cons |  -1.055521   .0182661   -57.79   0.000    -1.091321    -1.01972
------------------------------------------------------------------------------

 ( 1)  [fst1_mean]_cons - [snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .000676   .0053537     0.13   0.900    -.0098171     .011169
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst1 snd1
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp])*`X'
  4.         }
  5. end

. emprtn

 ( 1)  2*[fst1_mean]_cons - 2*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0013519   .0107074     0.13   0.900    -.0196342     .022338
------------------------------------------------------------------------------

 ( 1)  5*[fst1_mean]_cons - 5*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0033799   .0267685     0.13   0.900    -.0490854    .0558451
------------------------------------------------------------------------------

 ( 1)  10*[fst1_mean]_cons - 10*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0067597   .0535369     0.13   0.900    -.0981708    .1116902
------------------------------------------------------------------------------

 ( 1)  15*[fst1_mean]_cons - 15*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0101396   .0803054     0.13   0.900    -.1472561    .1675353
------------------------------------------------------------------------------

 ( 1)  20*[fst1_mean]_cons - 20*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0135194   .1070739     0.13   0.900    -.1963415    .2233804
------------------------------------------------------------------------------

 ( 1)  25*[fst1_mean]_cons - 25*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0168993   .1338424     0.13   0.900    -.2454269    .2792255
------------------------------------------------------------------------------

. 
. ** qadratic
. capture program drop coef

. program coef, rclass
  1.         suest fst2 snd2
  2.         lincom [fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst2, snd2

                                                Number of obs     =      7,889

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst2_mean    |
  emptendif2 |   .0000192    .000249     0.08   0.939    -.0004688    .0005072
  empexpdif2 |  -.0002931   .0002571    -1.14   0.254     -.000797    .0002109
       _cons |  -.0097906   .0154353    -0.63   0.526    -.0400433    .0204622
-------------+----------------------------------------------------------------
fst2_lnvar   |
       _cons |  -1.997988   .0568955   -35.12   0.000    -2.109501   -1.886475
-------------+----------------------------------------------------------------
snd2_mean    |
  1.dmarital |   .4674259   .0175662    26.61   0.000     .4329967     .501855
             |
   schooling |
         12  |   .0005406   .0311845     0.02   0.986    -.0605798     .061661
         14  |  -.0572325   .0368001    -1.56   0.120    -.1293593    .0148944
         16  |   .1019292   .0322768     3.16   0.002     .0386678    .1651906
             |
    1.dunion |   .0911496   .0148693     6.13   0.000     .0620064    .1202928
             |
        year |
       2005  |   .1187412   .0375928     3.16   0.002     .0450606    .1924217
       2006  |   .0987135   .0371959     2.65   0.008     .0258108    .1716162
       2007  |   .0812559   .0342154     2.37   0.018      .014195    .1483168
       2008  |   .0800656   .0351081     2.28   0.023     .0112549    .1488762
       2009  |    .098916   .0310961     3.18   0.001     .0379687    .1598633
       2010  |   .0695558   .0320799     2.17   0.030     .0066804    .1324312
       2011  |   .0968938   .0316107     3.07   0.002     .0349379    .1588496
       2012  |   .0848226   .0308376     2.75   0.006     .0243821    .1452631
       2013  |   .1089136   .0323426     3.37   0.001     .0455232    .1723039
       2014  |   .1339727   .0323974     4.14   0.000     .0704749    .1974706
             |
  initialemp |  -.0096479   .0005594   -17.25   0.000    -.0107443   -.0085514
       _cons |   7.531014   .0421182   178.81   0.000     7.448464    7.613564
-------------+----------------------------------------------------------------
snd2_lnvar   |
       _cons |  -1.077074   .0184876   -58.26   0.000    -1.113308   -1.040839
------------------------------------------------------------------------------

 ( 1)  [fst2_mean]_cons - [snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0001427   .0154584    -0.01   0.993    -.0304407    .0301553
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst2 snd2
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp])*`X' ///
>                                 +[fst2_mean]_b[emptendif2]*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst2_mean]emptendif2 + 2*[fst2_mean]_cons - 2*[snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0002086   .0306823    -0.01   0.995    -.0603449    .0599276
------------------------------------------------------------------------------

 ( 1)  25*[fst2_mean]emptendif2 + 5*[fst2_mean]_cons - 5*[snd2_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0002337   .0759709    -0.00   0.998     -.149134    .1486666
------------------------------------------------------------------------------

 ( 1)  100*[fst2_mean]emptendif2 + 10*[fst2_mean]_cons - 10*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0004922   .1502873     0.00   0.997    -.2940655    .2950498
------------------------------------------------------------------------------

 ( 1)  225*[fst2_mean]emptendif2 + 15*[fst2_mean]_cons - 15*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0021776     .22448     0.01   0.992    -.4377951    .4421502
------------------------------------------------------------------------------

 ( 1)  400*[fst2_mean]emptendif2 + 20*[fst2_mean]_cons - 20*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0048226   .3001059     0.02   0.987    -.5833742    .5930194
------------------------------------------------------------------------------

 ( 1)  625*[fst2_mean]emptendif2 + 25*[fst2_mean]_cons - 25*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0084272    .378695     0.02   0.982    -.7338015    .7506558
------------------------------------------------------------------------------

. 
. ** cubic
. capture program drop coef

. program coef, rclass
  1.         suest fst3 snd3
  2.         lincom [fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst3, snd3

                                                Number of obs     =      7,889

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst3_mean    |
  emptendif2 |   .0018999   .0009484     2.00   0.045     .0000411    .0037588
  empexpdif2 |  -.0018734   .0014468    -1.29   0.195    -.0047092    .0009624
  emptendif3 |  -.0000342   .0000166    -2.06   0.039    -.0000666   -1.71e-06
  empexpdif3 |   .0000228    .000018     1.27   0.205    -.0000125    .0000581
       _cons |  -.0023185   .0327062    -0.07   0.943    -.0664215    .0617846
-------------+----------------------------------------------------------------
fst3_lnvar   |
       _cons |  -1.998503   .0567845   -35.19   0.000    -2.109798   -1.887207
-------------+----------------------------------------------------------------
snd3_mean    |
  1.dmarital |   .4509354   .0171795    26.25   0.000     .4172641    .4846066
             |
   schooling |
         12  |   .0414942   .0311072     1.33   0.182    -.0194748    .1024632
         14  |  -.0084996   .0365369    -0.23   0.816    -.0801107    .0631115
         16  |   .1517773    .032223     4.71   0.000     .0886214    .2149332
             |
    1.dunion |   .0893681   .0146632     6.09   0.000     .0606288    .1181073
             |
        year |
       2005  |   .1176624   .0371228     3.17   0.002     .0449029    .1904218
       2006  |   .0960635   .0366242     2.62   0.009     .0242814    .1678456
       2007  |   .0804598   .0336376     2.39   0.017     .0145314    .1463882
       2008  |   .0774001   .0344957     2.24   0.025     .0097897    .1450105
       2009  |   .0960088   .0305553     3.14   0.002     .0361214    .1558962
       2010  |   .0649146   .0314977     2.06   0.039     .0031801     .126649
       2011  |   .0894765   .0310306     2.88   0.004     .0286577    .1502953
       2012  |   .0797661   .0302097     2.64   0.008     .0205563     .138976
       2013  |    .103955   .0317224     3.28   0.001     .0417802    .1661299
       2014  |   .1302432   .0317836     4.10   0.000     .0679485    .1925378
             |
  initialemp |   .0218465   .0005545    39.40   0.000     .0207597    .0229333
       _cons |   7.368083   .0413616   178.14   0.000     7.287016     7.44915
-------------+----------------------------------------------------------------
snd3_lnvar   |
       _cons |  -1.101537   .0188922   -58.31   0.000    -1.138565   -1.064509
------------------------------------------------------------------------------

 ( 1)  [fst3_mean]_cons - [snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   -.024165   .0327177    -0.74   0.460    -.0882905    .0399605
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst3 snd3
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp])*`X' ///
>                                 +[fst3_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst3_mean]_b[emptendif3]*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst3_mean]emptendif2 + 8*[fst3_mean]emptendif3 + 2*[fst3_mean]_cons -
       2*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0410035   .0652073    -0.63   0.529    -.1688075    .0868004
------------------------------------------------------------------------------

 ( 1)  25*[fst3_mean]emptendif2 + 125*[fst3_mean]emptendif3 + 5*[fst3_mean]_cons
       - 5*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0775968   .1631292    -0.48   0.634    -.3973243    .2421307
------------------------------------------------------------------------------

 ( 1)  100*[fst3_mean]emptendif2 + 1000*[fst3_mean]emptendif3 +
       10*[fst3_mean]_cons - 10*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0858171   .3301958    -0.26   0.795     -.732989    .5613547
------------------------------------------------------------------------------

 ( 1)  225*[fst3_mean]emptendif2 + 3375*[fst3_mean]emptendif3 +
       15*[fst3_mean]_cons - 15*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0502802   .5045634    -0.10   0.921    -1.039206    .9386459
------------------------------------------------------------------------------

 ( 1)  400*[fst3_mean]emptendif2 + 8000*[fst3_mean]emptendif3 +
       20*[fst3_mean]_cons - 20*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0033949   .6857508     0.00   0.996    -1.340652    1.347442
------------------------------------------------------------------------------

 ( 1)  625*[fst3_mean]emptendif2 + 15625*[fst3_mean]emptendif3 +
       25*[fst3_mean]_cons - 25*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0495889   .8712296     0.06   0.955     -1.65799    1.757167
------------------------------------------------------------------------------

. 
. ** quartic
. capture program drop coef

. program coef, rclass
  1.         suest fst4 snd4
  2.         lincom [fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst4, snd4

                                                Number of obs     =      7,889

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst4_mean    |
  emptendif2 |  -.0000739   .0021588    -0.03   0.973    -.0043049    .0041572
  empexpdif2 |  -.0068768   .0043442    -1.58   0.113    -.0153912    .0016375
  emptendif3 |   .0000566   .0000871     0.65   0.516    -.0001141    .0002273
  empexpdif3 |   .0001643   .0001185     1.39   0.166    -.0000681    .0003966
  emptendif4 |  -1.19e-06   1.09e-06    -1.09   0.276    -3.32e-06    9.48e-07
  empexpdif4 |  -1.34e-06   1.11e-06    -1.20   0.230    -3.52e-06    8.47e-07
       _cons |   .0745337   .0622758     1.20   0.231    -.0475245     .196592
-------------+----------------------------------------------------------------
fst4_lnvar   |
       _cons |  -1.998949   .0567861   -35.20   0.000    -2.110248    -1.88765
-------------+----------------------------------------------------------------
snd4_mean    |
  1.dmarital |   .4542854   .0172803    26.29   0.000     .4204167    .4881541
             |
   schooling |
         12  |   .0568411   .0309108     1.84   0.066     -.003743    .1174251
         14  |   .0052919   .0364063     0.15   0.884    -.0660631    .0766469
         16  |   .1673443   .0320452     5.22   0.000     .1045368    .2301518
             |
    1.dunion |   .0860139   .0146606     5.87   0.000     .0572797     .114748
             |
        year |
       2005  |   .1157528    .037055     3.12   0.002     .0431264    .1883793
       2006  |   .0973509   .0365711     2.66   0.008     .0256728     .169029
       2007  |   .0802717   .0335669     2.39   0.017     .0144818    .1460616
       2008  |   .0743868   .0344274     2.16   0.031     .0069103    .1418632
       2009  |   .0946911    .030498     3.10   0.002     .0349161     .154466
       2010  |   .0650318   .0314595     2.07   0.039     .0033724    .1266913
       2011  |   .0889219    .030964     2.87   0.004     .0282336    .1496102
       2012  |   .0791084   .0301508     2.62   0.009     .0200139     .138203
       2013  |   .1044019   .0316678     3.30   0.001     .0423342    .1664696
       2014  |   .1319583   .0317453     4.16   0.000     .0697386     .194178
             |
  initialemp |   .0878146   .0005531   158.78   0.000     .0867306    .0888986
       _cons |    7.11254   .0410724   173.17   0.000     7.032039     7.19304
-------------+----------------------------------------------------------------
snd4_lnvar   |
       _cons |  -1.095814   .0188738   -58.06   0.000    -1.132806   -1.058822
------------------------------------------------------------------------------

 ( 1)  [fst4_mean]_cons - [snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0132809   .0622757    -0.21   0.831     -.135339    .1087773
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst4 snd4
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp])*`X' ///
>                                 +[fst4_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif3]*`X'*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif4]*`X'*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst4_mean]emptendif2 + 8*[fst4_mean]emptendif3 +
       16*[fst4_mean]emptendif4 + 2*[fst4_mean]_cons - 2*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0264234   .1237629    -0.21   0.831    -.2689941    .2161474
------------------------------------------------------------------------------

 ( 1)  25*[fst4_mean]emptendif2 + 125*[fst4_mean]emptendif3 +
       625*[fst4_mean]emptendif4 + 5*[fst4_mean]_cons - 5*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0619184   .3089894    -0.20   0.841    -.6675266    .5436897
------------------------------------------------------------------------------

 ( 1)  100*[fst4_mean]emptendif2 + 1000*[fst4_mean]emptendif3 +
       10000*[fst4_mean]emptendif4 + 10*[fst4_mean]_cons -
       10*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0954755   .6229618    -0.15   0.878    -1.316458    1.125507
------------------------------------------------------------------------------

 ( 1)  225*[fst4_mean]emptendif2 + 3375*[fst4_mean]emptendif3 +
       50625*[fst4_mean]emptendif4 + 15*[fst4_mean]_cons -
       15*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0849533   .9441044    -0.09   0.928    -1.935364    1.765457
------------------------------------------------------------------------------

 ( 1)  400*[fst4_mean]emptendif2 + 8000*[fst4_mean]emptendif3 +
       160000*[fst4_mean]emptendif4 + 20*[fst4_mean]_cons -
       20*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0324564   1.268854    -0.03   0.980    -2.519364    2.454451
------------------------------------------------------------------------------

 ( 1)  625*[fst4_mean]emptendif2 + 15625*[fst4_mean]emptendif3 +
       390625*[fst4_mean]emptendif4 + 25*[fst4_mean]_cons -
       25*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0420885   1.593955     0.03   0.979    -3.082007    3.166183
------------------------------------------------------------------------------

. 
end of do-file
Controls: all

. /* Title: ReadData */
. /// Date: Nov 5th, 2018
> /// Written by Ayaka Nakamura
> /// 
> /// This file reads data set
> 
. local inputfd $Inputfd

. 
. qui {

. 
end of do-file

. qui{

. 
. 
. * estimation
. forvalues i=1/4 {
  2.         **** 1st step
.         qui $FstReg ///
>                                 `contrl`i'' ///
>                                 if fst==1
  3.         est sto fst`i'
  4.         gen emptenB`i'=`LHSterm`i'' ///
>                                                                 $DmYear
  5.         gen intwemp`i'=realwage-emptenB`i'
  6.         
.         **** 2nd step
.         qui reg intwemp`i' ///
>                                 $SndReg
  7.         est sto snd`i'
  8. }
(865 missing values generated)
(1,564 missing values generated)
(930 missing values generated)
(1,624 missing values generated)
(930 missing values generated)
(1,624 missing values generated)
(930 missing values generated)
(1,624 missing values generated)

. 
. * calc. return
. ** linear
. capture program drop coef

. program coef, rclass
  1.         suest fst1 snd1
  2.         lincom [fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst1, snd1

                                                Number of obs     =      7,827

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst1_mean    |
       _cons |  -.0244802   .0053035    -4.62   0.000    -.0348748   -.0140855
-------------+----------------------------------------------------------------
fst1_lnvar   |
       _cons |  -1.998589   .0568092   -35.18   0.000    -2.109933   -1.887245
-------------+----------------------------------------------------------------
snd1_mean    |
  1.dmarital |   .3608085   .0171968    20.98   0.000     .3271035    .3945136
             |
   schooling |
         12  |  -.0759343   .0307076    -2.47   0.013      -.13612   -.0157486
         14  |  -.1787774   .0360885    -4.95   0.000    -.2495095   -.1080453
         16  |  -.1297296   .0328559    -3.95   0.000     -.194126   -.0653333
             |
  1.dregular |   .2554115   .0212042    12.05   0.000     .2138521    .2969709
    1.dunion |   .0478452   .0155615     3.07   0.002     .0173452    .0783453
             |
         occ |
          2  |    .250557   .4896902     0.51   0.609    -.7092182    1.210332
          3  |   -.103217   .3503728    -0.29   0.768     -.789935     .583501
          4  |   -.176817   .3509549    -0.50   0.614    -.8646759    .5110419
          5  |   .4605322   .3504445     1.31   0.189    -.2263264    1.147391
          6  |   .0481564   .3502611     0.14   0.891    -.6383428    .7346556
          7  |  -.1841433   .3508384    -0.52   0.600     -.871774    .5034873
          8  |  -.1532251   .3496221    -0.44   0.661    -.8384718    .5320215
          9  |   -.064015   .3511026    -0.18   0.855    -.7521634    .6241335
         10  |    .019191   .3503096     0.05   0.956    -.6674032    .7057852
         11  |  -.2400091   .3524599    -0.68   0.496    -.9308178    .4507996
         12  |  -.0165078   .3613804    -0.05   0.964    -.7248003    .6917847
             |
         ind |
          2  |   .0676836   .2194689     0.31   0.758    -.3624675    .4978347
          3  |  -.2764171   .3933206    -0.70   0.482    -1.047311    .4944772
          4  |   .1147571   .3745004     0.31   0.759    -.6192502    .8487644
          5  |   .1624796    .374355     0.43   0.664    -.5712427    .8962019
          6  |   .0909819   .3748433     0.24   0.808    -.6436974    .8256613
          7  |  -.0267068   .3770807    -0.07   0.944    -.7657715    .7123578
          8  |   .0512103   .3760008     0.14   0.892    -.6857377    .7881583
          9  |   .2753509   .3802394     0.72   0.469    -.4699047    1.020606
         10  |   .0736361   .3754359     0.20   0.845    -.6622047    .8094769
         11  |    .164263   .3757255     0.44   0.662    -.5721454    .9006714
         12  |   .2223783   .3763389     0.59   0.555    -.5152324     .959989
         13  |   .1709102   .3780622     0.45   0.651     -.570078    .9118985
         14  |  -.0878476   .3752396    -0.23   0.815    -.8233037    .6476085
         15  |   .1697335   .3767949     0.45   0.652    -.5687708    .9082379
         16  |   .0845952    .374613     0.23   0.821    -.6496327    .8188232
         17  |  -.1270449   .4097886    -0.31   0.757    -.9302158     .676126
         18  |   .1721769   .3801295     0.45   0.651    -.5728633    .9172171
             |
       dsize |
          1  |   .0875281   .0170787     5.12   0.000     .0540544    .1210019
          2  |   .2649846   .0169601    15.62   0.000     .2317435    .2982258
             |
        year |
       2005  |   .1109497   .0367859     3.02   0.003     .0388506    .1830488
       2006  |    .091258   .0362327     2.52   0.012     .0202432    .1622729
       2007  |   .0765495   .0332369     2.30   0.021     .0114063    .1416926
       2008  |   .0660538   .0340731     1.94   0.053    -.0007282    .1328359
       2009  |   .0954663   .0300477     3.18   0.001      .036574    .1543587
       2010  |   .0664242   .0308204     2.16   0.031     .0060174     .126831
       2011  |   .0927747   .0300901     3.08   0.002     .0337992    .1517502
       2012  |   .1011975   .0297935     3.40   0.001     .0428033    .1595916
       2013  |   .1232305   .0309962     3.98   0.000      .062479     .183982
       2014  |   .1474192   .0309873     4.76   0.000     .0866852    .2081533
             |
  initialemp |  -.0184981   .0005886   -31.43   0.000    -.0196517   -.0173444
       _cons |   7.427187   .1414118    52.52   0.000     7.150025    7.704349
-------------+----------------------------------------------------------------
snd1_lnvar   |
       _cons |  -1.236253   .0211184   -58.54   0.000    -1.277644   -1.194861
------------------------------------------------------------------------------

 ( 1)  [fst1_mean]_cons - [snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0059821   .0053435    -1.12   0.263    -.0164552     .004491
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst1 snd1
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst1_mean]_b[_cons]-[snd1_mean]_b[initialemp])*`X'
  4.         }
  5. end

. emprtn

 ( 1)  2*[fst1_mean]_cons - 2*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0119643    .010687    -1.12   0.263    -.0329105     .008982
------------------------------------------------------------------------------

 ( 1)  5*[fst1_mean]_cons - 5*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0299106   .0267176    -1.12   0.263    -.0822762    .0224549
------------------------------------------------------------------------------

 ( 1)  10*[fst1_mean]_cons - 10*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0598213   .0534352    -1.12   0.263    -.1645524    .0449099
------------------------------------------------------------------------------

 ( 1)  15*[fst1_mean]_cons - 15*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0897319   .0801528    -1.12   0.263    -.2468286    .0673648
------------------------------------------------------------------------------

 ( 1)  20*[fst1_mean]_cons - 20*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1196425   .1068705    -1.12   0.263    -.3291047    .0898197
------------------------------------------------------------------------------

 ( 1)  25*[fst1_mean]_cons - 25*[snd1_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1495531   .1335881    -1.12   0.263    -.4113809    .1122747
------------------------------------------------------------------------------

. 
. ** qadratic
. capture program drop coef

. program coef, rclass
  1.         suest fst2 snd2
  2.         lincom [fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst2, snd2

                                                Number of obs     =      7,824

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst2_mean    |
  emptendif2 |   .0000192    .000249     0.08   0.939    -.0004688    .0005072
  empexpdif2 |  -.0002931   .0002571    -1.14   0.254     -.000797    .0002109
       _cons |  -.0097906   .0154354    -0.63   0.526    -.0400433    .0204622
-------------+----------------------------------------------------------------
fst2_lnvar   |
       _cons |  -1.997988   .0568955   -35.12   0.000    -2.109501   -1.886475
-------------+----------------------------------------------------------------
snd2_mean    |
  1.dmarital |   .3435606   .0167735    20.48   0.000     .3106851     .376436
             |
   schooling |
         12  |  -.1042451   .0308064    -3.38   0.001    -.1646246   -.0438657
         14  |  -.2038707   .0360474    -5.66   0.000    -.2745224    -.133219
         16  |  -.1543655   .0328727    -4.70   0.000    -.2187949   -.0899361
             |
  1.dregular |   .2336602   .0211846    11.03   0.000     .1921391    .2751813
    1.dunion |   .0517675   .0153453     3.37   0.001     .0216913    .0818436
             |
         occ |
          2  |   .2592286   .5115039     0.51   0.612    -.7433007    1.261758
          3  |  -.1298559   .3413188    -0.38   0.704    -.7988284    .5391166
          4  |  -.1994196   .3418599    -0.58   0.560    -.8694527    .4706135
          5  |   .4254591   .3413638     1.25   0.213    -.2436017     1.09452
          6  |   .0199685   .3411597     0.06   0.953    -.6486923    .6886293
          7  |  -.2078028   .3417581    -0.61   0.543    -.8776363    .4620307
          8  |  -.1823226   .3405051    -0.54   0.592    -.8497003    .4850551
          9  |  -.0889326   .3419813    -0.26   0.795    -.7592035    .5813383
         10  |  -.0052384   .3411909    -0.02   0.988    -.6739602    .6634835
         11  |  -.2609445   .3433962    -0.76   0.447    -.9339888    .4120997
         12  |  -.0492988   .3526932    -0.14   0.889    -.7405648    .6419672
             |
         ind |
          2  |   .0697223   .2148837     0.32   0.746    -.3514421    .4908867
          3  |  -.2903471   .3868057    -0.75   0.453    -1.048472    .4677781
          4  |   .1244289   .3673194     0.34   0.735    -.5955039    .8443618
          5  |   .1679379   .3671707     0.46   0.647    -.5517034    .8875792
          6  |   .0962739   .3677032     0.26   0.793    -.6244111    .8169589
          7  |  -.0193848   .3699482    -0.05   0.958    -.7444699    .7057003
          8  |   .0588954   .3688389     0.16   0.873    -.6640155    .7818064
          9  |   .2801991   .3731765     0.75   0.453    -.4512134    1.011612
         10  |    .076127    .368278     0.21   0.836    -.6456847    .7979387
         11  |   .1696168   .3685422     0.46   0.645    -.5527125    .8919462
         12  |   .2323738   .3691366     0.63   0.529    -.4911206    .9558683
         13  |   .1889385   .3709103     0.51   0.610    -.5380322    .9159093
         14  |  -.0800798   .3680534    -0.22   0.828    -.8014511    .6412915
         15  |   .1814107   .3695812     0.49   0.624    -.5429551    .9057765
         16  |   .0935925   .3674414     0.25   0.799    -.6265794    .8137644
         17  |  -.1040785    .401684    -0.26   0.796    -.8913646    .6832076
         18  |   .1839764   .3729545     0.49   0.622     -.547001    .9149537
             |
       dsize |
          1  |    .090408   .0168788     5.36   0.000     .0573261    .1234899
          2  |   .2655681   .0168252    15.78   0.000     .2325913    .2985449
             |
        year |
       2005  |   .1090116   .0363579     3.00   0.003     .0377513    .1802718
       2006  |   .0864057   .0358017     2.41   0.016     .0162357    .1565757
       2007  |   .0742315   .0327344     2.27   0.023     .0100733    .1383896
       2008  |   .0628971   .0336041     1.87   0.061    -.0029657    .1287599
       2009  |   .0937531   .0295744     3.17   0.002     .0357883    .1517179
       2010  |     .06371   .0303726     2.10   0.036     .0041808    .1232392
       2011  |   .0886114   .0296452     2.99   0.003     .0305078     .146715
       2012  |   .0980534    .029376     3.34   0.001     .0404775    .1556294
       2013  |   .1179952   .0306122     3.85   0.000     .0579964     .177994
       2014  |   .1428488   .0305749     4.67   0.000     .0829231    .2027745
             |
  initialemp |  -.0032313   .0005861    -5.51   0.000      -.00438   -.0020826
       _cons |   7.345048   .1444988    50.83   0.000     7.061835     7.62826
-------------+----------------------------------------------------------------
snd2_lnvar   |
       _cons |    -1.2566   .0214103   -58.69   0.000    -1.298563   -1.214636
------------------------------------------------------------------------------

 ( 1)  [fst2_mean]_cons - [snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0065592   .0154569    -0.42   0.671    -.0368542    .0237357
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst2 snd2
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst2_mean]_b[_cons]-[snd2_mean]_b[initialemp])*`X' ///
>                                 +[fst2_mean]_b[emptendif2]*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst2_mean]emptendif2 + 2*[fst2_mean]_cons - 2*[snd2_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0130417   .0306788    -0.43   0.671    -.0731711    .0470876
------------------------------------------------------------------------------

 ( 1)  25*[fst2_mean]emptendif2 + 5*[fst2_mean]_cons - 5*[snd2_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0323164   .0759604    -0.43   0.671    -.1811962    .1165633
------------------------------------------------------------------------------

 ( 1)  100*[fst2_mean]emptendif2 + 10*[fst2_mean]_cons - 10*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0636733   .1502607    -0.42   0.672    -.3581789    .2308323
------------------------------------------------------------------------------

 ( 1)  225*[fst2_mean]emptendif2 + 15*[fst2_mean]_cons - 15*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0940706    .224432    -0.42   0.675    -.5339492     .345808
------------------------------------------------------------------------------

 ( 1)  400*[fst2_mean]emptendif2 + 20*[fst2_mean]_cons - 20*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1235083   .3000314    -0.41   0.681    -.7115591    .4645425
------------------------------------------------------------------------------

 ( 1)  625*[fst2_mean]emptendif2 + 25*[fst2_mean]_cons - 25*[snd2_mean]initialemp
       = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1519865   .3785896    -0.40   0.688    -.8940085    .5900356
------------------------------------------------------------------------------

. 
. ** cubic
. capture program drop coef

. program coef, rclass
  1.         suest fst3 snd3
  2.         lincom [fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst3, snd3

                                                Number of obs     =      7,824

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst3_mean    |
  emptendif2 |   .0018999   .0009484     2.00   0.045     .0000411    .0037588
  empexpdif2 |  -.0018734   .0014468    -1.29   0.195    -.0047092    .0009624
  emptendif3 |  -.0000342   .0000166    -2.06   0.039    -.0000666   -1.71e-06
  empexpdif3 |   .0000228    .000018     1.27   0.205    -.0000125    .0000581
       _cons |  -.0023185   .0327062    -0.07   0.943    -.0664215    .0617846
-------------+----------------------------------------------------------------
fst3_lnvar   |
       _cons |  -1.998503   .0567846   -35.19   0.000    -2.109798   -1.887207
-------------+----------------------------------------------------------------
snd3_mean    |
  1.dmarital |   .3290859   .0163865    20.08   0.000     .2969688    .3612029
             |
   schooling |
         12  |  -.0610029   .0308578    -1.98   0.048     -.121483   -.0005227
         14  |  -.1524818   .0359119    -4.25   0.000    -.2228679   -.0820957
         16  |  -.0972908    .032882    -2.96   0.003    -.1617383   -.0328433
             |
  1.dregular |   .2480104   .0212456    11.67   0.000     .2063699     .289651
    1.dunion |   .0503919   .0151349     3.33   0.001     .0207282    .0800557
             |
         occ |
          2  |   .2923233    .482909     0.61   0.545     -.654161    1.238808
          3  |   .0073505   .3581403     0.02   0.984    -.6945916    .7092927
          4  |   -.059132   .3585962    -0.16   0.869    -.7619676    .6437037
          5  |   .5389562   .3581256     1.50   0.132    -.1629571    1.240869
          6  |   .1482043   .3579263     0.41   0.679    -.5533183    .8497269
          7  |  -.0718061   .3584998    -0.20   0.841    -.7744529    .6308406
          8  |   -.041714   .3572865    -0.12   0.907    -.7419827    .6585547
          9  |   .0469102   .3586895     0.13   0.896    -.6561083    .7499287
         10  |   .1292154   .3579493     0.36   0.718    -.5723523     .830783
         11  |  -.1150571   .3601476    -0.32   0.749    -.8209335    .5908193
         12  |     .07474    .368934     0.20   0.839    -.6483575    .7978374
             |
         ind |
          2  |   .0102446   .2152604     0.05   0.962    -.4116581    .4321473
          3  |  -.3639243   .4006084    -0.91   0.364    -1.149102    .4212536
          4  |   .0152798    .379819     0.04   0.968    -.7291518    .7597113
          5  |   .0565125   .3796601     0.15   0.882    -.6876076    .8006326
          6  |  -.0109984   .3802103    -0.03   0.977    -.7561969    .7342002
          7  |  -.1302084   .3822996    -0.34   0.733    -.8795018    .6190849
          8  |  -.0529502     .38126    -0.14   0.890     -.800206    .6943056
          9  |   .1842012    .385377     0.48   0.633    -.5711238    .9395261
         10  |  -.0340508   .3807287    -0.09   0.929    -.7802654    .7121637
         11  |   .0598545   .3809784     0.16   0.875    -.6868496    .8065585
         12  |   .1267208    .381506     0.33   0.740    -.6210172    .8744588
         13  |   .0731846   .3832439     0.19   0.849    -.6779596    .8243289
         14  |  -.1843432   .3804872    -0.48   0.628    -.9300843     .561398
         15  |   .0766789   .3819472     0.20   0.841    -.6719239    .8252817
         16  |  -.0169213    .379927    -0.04   0.964    -.7615645    .7277219
         17  |  -.2217365   .4113409    -0.54   0.590     -1.02795    .5844768
         18  |   .0807346   .3855842     0.21   0.834    -.6749966    .8364658
             |
       dsize |
          1  |   .0845368    .016717     5.06   0.000      .051772    .1173015
          2  |    .256896   .0166535    15.43   0.000     .2242557    .2895362
             |
        year |
       2005  |   .1091229   .0359986     3.03   0.002     .0385669     .179679
       2006  |   .0853104   .0352794     2.42   0.016      .016164    .1544568
       2007  |   .0743494   .0322645     2.30   0.021     .0111121    .1375866
       2008  |   .0611398   .0330295     1.85   0.064    -.0035967    .1258764
       2009  |   .0909005   .0290737     3.13   0.002      .033917    .1478839
       2010  |   .0592745    .029851     1.99   0.047     .0007676    .1177814
       2011  |   .0818147   .0291288     2.81   0.005     .0247234     .138906
       2012  |    .092442   .0288043     3.21   0.001     .0359867    .1488974
       2013  |   .1127492   .0300546     3.75   0.000     .0538431    .1716552
       2014  |   .1386154   .0300132     4.62   0.000     .0797906    .1974402
             |
  initialemp |    .028256   .0005857    48.24   0.000      .027108    .0294041
       _cons |   7.143411   .1361542    52.47   0.000     6.876553    7.410268
-------------+----------------------------------------------------------------
snd3_lnvar   |
       _cons |  -1.275257   .0218421   -58.39   0.000    -1.318067   -1.232447
------------------------------------------------------------------------------

 ( 1)  [fst3_mean]_cons - [snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0305745   .0327233    -0.93   0.350    -.0947111     .033562
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst3 snd3
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst3_mean]_b[_cons]-[snd3_mean]_b[initialemp])*`X' ///
>                                 +[fst3_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst3_mean]_b[emptendif3]*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst3_mean]emptendif2 + 8*[fst3_mean]emptendif3 + 2*[fst3_mean]_cons -
       2*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0538226    .065219    -0.83   0.409    -.1816496    .0740044
------------------------------------------------------------------------------

 ( 1)  25*[fst3_mean]emptendif2 + 125*[fst3_mean]emptendif3 + 5*[fst3_mean]_cons
       - 5*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1096446     .16316    -0.67   0.502    -.4294323    .2101432
------------------------------------------------------------------------------

 ( 1)  100*[fst3_mean]emptendif2 + 1000*[fst3_mean]emptendif3 +
       10*[fst3_mean]_cons - 10*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1499126   .3302602    -0.45   0.650    -.7972108    .4973855
------------------------------------------------------------------------------

 ( 1)  225*[fst3_mean]emptendif2 + 3375*[fst3_mean]emptendif3 +
       15*[fst3_mean]_cons - 15*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1464234   .5046615    -0.29   0.772    -1.135542     .842695
------------------------------------------------------------------------------

 ( 1)  400*[fst3_mean]emptendif2 + 8000*[fst3_mean]emptendif3 +
       20*[fst3_mean]_cons - 20*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1247961   .6858808    -0.18   0.856    -1.469098    1.219506
------------------------------------------------------------------------------

 ( 1)  625*[fst3_mean]emptendif2 + 15625*[fst3_mean]emptendif3 +
       25*[fst3_mean]_cons - 25*[snd3_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1106498   .8713883    -0.13   0.899     -1.81854     1.59724
------------------------------------------------------------------------------

. 
. ** quartic
. capture program drop coef

. program coef, rclass
  1.         suest fst4 snd4
  2.         lincom [fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp]
  3. end

. coef

Simultaneous results for fst4, snd4

                                                Number of obs     =      7,824

------------------------------------------------------------------------------
             |               Robust
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
fst4_mean    |
  emptendif2 |  -.0000739   .0021588    -0.03   0.973    -.0043049    .0041572
  empexpdif2 |  -.0068768   .0043442    -1.58   0.113    -.0153912    .0016375
  emptendif3 |   .0000566   .0000871     0.65   0.516    -.0001141    .0002273
  empexpdif3 |   .0001643   .0001185     1.39   0.166    -.0000681    .0003966
  emptendif4 |  -1.19e-06   1.09e-06    -1.09   0.276    -3.32e-06    9.48e-07
  empexpdif4 |  -1.34e-06   1.11e-06    -1.20   0.230    -3.52e-06    8.47e-07
       _cons |   .0745337   .0622758     1.20   0.231    -.0475246    .1965921
-------------+----------------------------------------------------------------
fst4_lnvar   |
       _cons |  -1.998949   .0567862   -35.20   0.000    -2.110248    -1.88765
-------------+----------------------------------------------------------------
snd4_mean    |
  1.dmarital |   .3312327   .0165018    20.07   0.000     .2988897    .3635757
             |
   schooling |
         12  |  -.0459104   .0308098    -1.49   0.136    -.1062965    .0144757
         14  |  -.1393429   .0358948    -3.88   0.000    -.2096955   -.0689904
         16  |  -.0824602   .0328446    -2.51   0.012    -.1468345   -.0180859
             |
  1.dregular |   .2581689   .0211859    12.19   0.000     .2166453    .2996926
    1.dunion |   .0463539    .015183     3.05   0.002     .0165958     .076112
             |
         occ |
          2  |   .3850947   .4850577     0.79   0.427     -.565601     1.33579
          3  |   .0582226   .3557061     0.16   0.870    -.6389486    .7553938
          4  |  -.0076992   .3562473    -0.02   0.983    -.7059311    .6905328
          5  |   .5883797   .3557484     1.65   0.098    -.1088744    1.285634
          6  |   .2001169   .3555567     0.56   0.574    -.4967615    .8969952
          7  |  -.0219872   .3561415    -0.06   0.951    -.7200118    .6760374
          8  |    .008836   .3549394     0.02   0.980    -.6868325    .7045045
          9  |   .0989519   .3563312     0.28   0.781    -.5994444    .7973482
         10  |   .1813744    .355595     0.51   0.610    -.5155791    .8783279
         11  |  -.0625743    .357853    -0.17   0.861    -.7639532    .6388046
         12  |   .1265206    .366638     0.35   0.730    -.5920767    .8451179
             |
         ind |
          2  |  -.0351308   .2141786    -0.16   0.870    -.4549133    .3846516
          3  |   -.427616   .3985634    -1.07   0.283    -1.208786    .3535539
          4  |  -.0471128   .3774927    -0.12   0.901    -.7869849    .6927592
          5  |  -.0048207   .3773391    -0.01   0.990    -.7443917    .7347504
          6  |  -.0746241   .3778297    -0.20   0.843    -.8151568    .6659086
          7  |  -.1938939    .379934    -0.51   0.610    -.9385509    .5507632
          8  |  -.1149464   .3788976    -0.30   0.762    -.8575719    .6276792
          9  |    .122293   .3831881     0.32   0.750    -.6287419    .8733279
         10  |  -.0986731   .3783883    -0.26   0.794    -.8403007    .6429544
         11  |  -.0005073   .3786354    -0.00   0.999    -.7426191    .7416044
         12  |   .0519582   .3791909     0.14   0.891    -.6912422    .7951587
         13  |   .0026835   .3808426     0.01   0.994    -.7437544    .7491213
         14  |  -.2469407   .3781698    -0.65   0.514    -.9881399    .4942585
         15  |   .0060248   .3796269     0.02   0.987    -.7380302    .7500798
         16  |  -.0812164      .3776    -0.22   0.830    -.8212989     .658866
         17  |  -.2970702   .4098296    -0.72   0.469    -1.100321    .5061809
         18  |   .0044151   .3833572     0.01   0.991    -.7469511    .7557813
             |
       dsize |
          1  |   .0843715   .0168547     5.01   0.000     .0513369    .1174061
          2  |   .2576742   .0167149    15.42   0.000     .2249136    .2904347
             |
        year |
       2005  |   .1069666   .0359404     2.98   0.003     .0365248    .1774084
       2006  |   .0866473   .0351925     2.46   0.014     .0176712    .1556234
       2007  |   .0748985   .0322126     2.33   0.020     .0117629    .1380341
       2008  |   .0580447   .0329501     1.76   0.078    -.0065364    .1226257
       2009  |   .0895148   .0289987     3.09   0.002     .0326784    .1463512
       2010  |    .059464   .0298068     1.99   0.046     .0010438    .1178841
       2011  |   .0812638   .0290427     2.80   0.005     .0243412    .1381863
       2012  |   .0913113   .0287343     3.18   0.001     .0349931    .1476296
       2013  |   .1131033   .0299766     3.77   0.000     .0543502    .1718565
       2014  |   .1401023    .029959     4.68   0.000     .0813837    .1988209
             |
  initialemp |   .0943452   .0005854   161.17   0.000     .0931979    .0954926
       _cons |   6.891544   .1357082    50.78   0.000      6.62556    7.157527
-------------+----------------------------------------------------------------
snd4_lnvar   |
       _cons |   -1.26897   .0218031   -58.20   0.000    -1.311703   -1.226237
------------------------------------------------------------------------------

 ( 1)  [fst4_mean]_cons - [snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0198115   .0622837    -0.32   0.750    -.1418853    .1022623
------------------------------------------------------------------------------

. capture program drop emprtn

. program emprtn, rclass
  1.         qui suest fst4 snd4
  2.         foreach X of numlist 2 5 10 15 20 25 {
  3.         lincom ([fst4_mean]_b[_cons]-[snd4_mean]_b[initialemp])*`X' ///
>                                 +[fst4_mean]_b[emptendif2]*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif3]*`X'*`X'*`X' ///
>                                 +[fst4_mean]_b[emptendif4]*`X'*`X'*`X'*`X'
  4.         }
  5. end

. emprtn

 ( 1)  4*[fst4_mean]emptendif2 + 8*[fst4_mean]emptendif3 +
       16*[fst4_mean]emptendif4 + 2*[fst4_mean]_cons - 2*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0394847     .12378    -0.32   0.750    -.2820889    .2031196
------------------------------------------------------------------------------

 ( 1)  25*[fst4_mean]emptendif2 + 125*[fst4_mean]emptendif3 +
       625*[fst4_mean]emptendif4 + 5*[fst4_mean]_cons - 5*[snd4_mean]initialemp =
       0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0945716   .3090351    -0.31   0.760    -.7002693    .5111261
------------------------------------------------------------------------------

 ( 1)  100*[fst4_mean]emptendif2 + 1000*[fst4_mean]emptendif3 +
       10000*[fst4_mean]emptendif4 + 10*[fst4_mean]_cons -
       10*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1607819   .6230588    -0.26   0.796    -1.381955    1.060391
------------------------------------------------------------------------------

 ( 1)  225*[fst4_mean]emptendif2 + 3375*[fst4_mean]emptendif3 +
       50625*[fst4_mean]emptendif4 + 15*[fst4_mean]_cons -
       15*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1829129   .9442526    -0.19   0.846    -2.033614    1.667788
------------------------------------------------------------------------------

 ( 1)  400*[fst4_mean]emptendif2 + 8000*[fst4_mean]emptendif3 +
       160000*[fst4_mean]emptendif4 + 20*[fst4_mean]_cons -
       20*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1630692    1.26905    -0.13   0.898    -2.650362    2.324223
------------------------------------------------------------------------------

 ( 1)  625*[fst4_mean]emptendif2 + 15625*[fst4_mean]emptendif3 +
       390625*[fst4_mean]emptendif4 + 25*[fst4_mean]_cons -
       25*[snd4_mean]initialemp = 0

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1211775   1.594196    -0.08   0.939    -3.245744    3.003389
------------------------------------------------------------------------------

. 
end of do-file

.  
. 
. log close
      name:  <unnamed>
       log:  C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submit
> tion\Log\EstTopel.log
  log type:  text
 closed on:  13 Feb 2019, 17:58:00
---------------------------------------------------------------------------------
