---------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submit
> tion\Log\ReplicationToda.log
  log type:  text
 opened on:  15 Feb 2019, 21:14:19

. 
. /**/
. ** make the same sample as Toda
. qui {

. *** construct employer tenure
. forvalues X = 2005/2014{ 
  2.         *** working more than 800h & not switched->+1
.         /// If the sample dropped on the way was resurrected, 
>         /// it is assumed that he kept being employed for the period
>         /// in which it was dropped.
>         dis "current year is `X' "
  3.         bysort id (year): replace emptenure=emptenure[_n-1]+(year-year[_n-1]
> ) ///
>                 if dswitch==0 & year==`X' & _n>1
  4.         *** switched->0
.         bysort id (year): replace emptenure=0.5 ///
>                 if dswitch==1 & year==`X'
  5. }
current year is 2005 
(693 real changes made)
(589 real changes made)
current year is 2006 
(1149 real changes made)
(484 real changes made)
current year is 2007 
(1449 real changes made)
(404 real changes made)
current year is 2008 
(1891 real changes made)
(554 real changes made)
current year is 2009 
(2141 real changes made)
(549 real changes made)
current year is 2010 
(2932 real changes made)
(1002 real changes made)
current year is 2011 
(3509 real changes made)
(928 real changes made)
current year is 2012 
(3855 real changes made)
(768 real changes made)
current year is 2013 
(3991 real changes made)
(709 real changes made)
current year is 2014 
(4264 real changes made)
(778 real changes made)

. do "$Code\SampleSelection.do"

. *******************************************************
. *Title: SampleSelection
. *Date: Oct 25th, 2018
. *Written by Ayaka Nakamura
. * 
. * This file restrict observations
. ********************************************************
. 
. * Define indicator indicating which survey data
. local isJHPS id<20000

. local isOldKHPS id>=20000&id<40000

. local isNewKHPS id>=40000

. 
. 
. * restrict age 18--64
. keep if age>=18 & age<=64
(19,516 observations deleted)

. sum age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     78,382    46.31751    11.15877         19         64

. * keep household head
. ** head: Are you head of household?
. ** earnmost: Are you head of household?
. keep if dearnmost==1
(48,886 observations deleted)

. * drop female
. drop if sex==2
(5,744 observations deleted)

. sum sex

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         sex |     23,752           1           0          1          1

. drop sex

. * keep employee
. drop if demployed==0
(6,070 observations deleted)

. sum demployed

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   demployed |     17,682           1           0          1          1

. drop demployed

. * drop government
. drop if dsize==6
(0 observations deleted)

. keep if owner==1 | owner==2 | owner==3
(2,228 observations deleted)

. sum owner

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       owner |     15,454    1.986864     .409106          1          3

. drop owner

. * drop workinghour<500, workinghour>3120, hourlywage==0
. drop if workinghour<500
(427 observations deleted)

. drop if workinghour>3120
(2,361 observations deleted)

. drop if hourlywage==0
(0 observations deleted)

. 
. 
end of do-file

. *** replace workexp
. replace workexp=age-schooling-6
(8,954 real changes made, 21 to missing)

. *** sample selection: male, employed, 2004--2007, 20--60, regular
. keep if year<=2007
(8,180 observations deleted)

. tab year

       year |      Freq.     Percent        Cum.
------------+-----------------------------------
       2004 |      1,225       27.31       27.31
       2005 |      1,041       23.21       50.51
       2006 |        919       20.49       71.00
       2007 |      1,301       29.00      100.00
------------+-----------------------------------
      Total |      4,486      100.00

. keep if age>=20 & age<=60
(264 observations deleted)

. sum age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      4,222    44.36476    9.516084         20         60

. keep if dregular==1
(360 observations deleted)

. tab dregular

   dregular |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,862      100.00      100.00
------------+-----------------------------------
      Total |      3,862      100.00

. save "$Inputfd\jhps_hc_toda.dta", replace
file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Inp
> ut\jhps_hc_toda.dta saved

. */
. 
. ** Summary statistics
. qui {

. sum realwage schooling dsize emptenure workexp, de

                          realwage
-------------------------------------------------------------
      Percentiles      Smallest
 1%     6.508085       5.592465
 5%     6.883965       5.658697
10%     7.046725       5.694479       Obs               3,447
25%     7.331374       5.763855       Sum of Wgt.       3,447

50%     7.648522                      Mean           7.681856
                        Largest       Std. Dev.      .5424748
75%      7.99635       9.835473
90%     8.311897       9.856703       Variance       .2942789
95%     8.616005       9.870348       Skewness       .5257733
99%     9.295599       10.35261       Kurtosis        4.33688

                          schooling
-------------------------------------------------------------
      Percentiles      Smallest
 1%            9              9
 5%           12              9
10%           12              9       Obs               3,832
25%           12              9       Sum of Wgt.       3,832

50%           12                      Mean           13.63439
                        Largest       Std. Dev.      2.120538
75%           16             16
90%           16             16       Variance       4.496681
95%           16             16       Skewness      -.1800701
99%           16             16       Kurtosis       1.907568

                            dsize
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               3,862
25%            0              0       Sum of Wgt.       3,862

50%            1                      Mean           1.064474
                        Largest       Std. Dev.      .8830831
75%            2              2
90%            2              2       Variance       .7798358
95%            2              2       Skewness        -.12579
99%            2              2       Kurtosis       1.294213

                        Tenure months
-------------------------------------------------------------
      Percentiles      Smallest
 1%           .5              0
 5%            1              0
10%            2              0       Obs               3,393
25%            6              0       Sum of Wgt.       3,393

50%           15                      Mean           15.90318
                        Largest       Std. Dev.      10.91358
75%           24             42
90%           32             43       Variance       119.1063
95%           36             43       Skewness       .4012648
99%           40             44       Kurtosis       2.160709

                           workexp
-------------------------------------------------------------
      Percentiles      Smallest
 1%            5              1
 5%            9              1
10%           12              2       Obs               3,832
25%           17              2       Sum of Wgt.       3,832

50%           24                      Mean           24.60125
                        Largest       Std. Dev.      9.653711
75%           33             45
90%           37             45       Variance       93.19413
95%           39             45       Skewness      -.0777755
99%           43             45       Kurtosis       2.090221

. 
. ** AS
. *** OLS
. forvalues poly_x=1/4{
  2.         dis "/* OLS  `poly_x'th order */"
  3.         reg ///
>                         `commonVar' ///
>                         `todaemp`poly_x'' ///
>                         `todaexp`poly_x'' ///
>                         , vce(r)
  4.         est sto olstoda`poly_x'
  5. }
/* OLS  1th order */

Linear regression                               Number of obs     =      2,984
                                                F(33, 2950)       =      37.44
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2262
                                                Root MSE          =     .47958

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         occ |
          2  |   .0314315    .142817     0.22   0.826    -.2485995    .3114625
          3  |   .1400523   .1416064     0.99   0.323     -.137605    .4177096
          4  |   .0923515   .1469934     0.63   0.530    -.1958685    .3805715
          5  |   .3972948   .1418516     2.80   0.005     .1191567    .6754329
          6  |   .2125366   .1400878     1.52   0.129    -.0621431    .4872163
          7  |   .2170434   .1451705     1.50   0.135    -.0676025    .5016892
          8  |   .1452918   .1390787     1.04   0.296    -.1274093    .4179929
          9  |   .2264224   .1430848     1.58   0.114    -.0541338    .5069785
         10  |   .2563264   .1419784     1.81   0.071    -.0220603    .5347131
         11  |  -.0027383    .145675    -0.02   0.985    -.2883733    .2828967
         12  |   .0757171   .1645025     0.46   0.645    -.2468342    .3982685
             |
         ind |
          2  |   .1354007   .1580239     0.86   0.392    -.1744476    .4452489
          3  |   .2067739   .2682533     0.77   0.441    -.3192086    .7327565
          4  |   .0465755   .0801872     0.58   0.561     -.110653    .2038039
          5  |   .1137984   .0769291     1.48   0.139    -.0370417    .2646385
          6  |   .0493949   .0808893     0.61   0.541    -.1092104    .2080001
          7  |   .2063401   .1167817     1.77   0.077    -.0226418     .435322
          8  |   .1420012   .0812506     1.75   0.081    -.0173123    .3013148
          9  |   .1325594   .0907984     1.46   0.144    -.0454752     .310594
         10  |   .0851937   .0854048     1.00   0.319    -.0822654    .2526529
         11  |   .1305308   .0894563     1.46   0.145    -.0448722    .3059338
         12  |    .212324   .0925692     2.29   0.022     .0308172    .3938307
         13  |   .1709847   .1011676     1.69   0.091    -.0273815    .3693509
         14  |   .1367339   .0962012     1.42   0.155    -.0518944    .3253622
         15  |   .1202124   .0880639     1.37   0.172    -.0524606    .2928854
         16  |   .1287895    .081666     1.58   0.115    -.0313385    .2889175
         17  |   .0436615   .1440231     0.30   0.762    -.2387345    .3260575
         18  |   .1861428   .1449771     1.28   0.199    -.0981237    .4704094
             |
    1.dunion |   .0585998    .022679     2.58   0.010     .0141315     .103068
   schooling |   .0440301   .0048985     8.99   0.000     .0344253    .0536348
             |
       dsize |
          1  |  -.0019381   .0270739    -0.07   0.943    -.0550238    .0511477
          2  |   .1061506    .025855     4.11   0.000     .0554548    .1568463
             |
   emptenure |   .0144802   .0008583    16.87   0.000     .0127974    .0161631
       _cons |   6.475206    .133299    48.58   0.000     6.213838    6.736575
------------------------------------------------------------------------------
/* OLS  2th order */

Linear regression                               Number of obs     =      2,984
                                                F(36, 2947)       =      35.78
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2502
                                                Root MSE          =     .47231

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         occ |
          2  |  -.0009676   .1578851    -0.01   0.995    -.3105438    .3086085
          3  |   .1523013   .1551895     0.98   0.326    -.1519895    .4565921
          4  |    .095944   .1593933     0.60   0.547    -.2165895    .4084775
          5  |   .3794507   .1554084     2.44   0.015     .0747306    .6841708
          6  |   .2261581   .1537579     1.47   0.141    -.0753257    .5276419
          7  |   .2198664   .1586409     1.39   0.166    -.0911917    .5309246
          8  |   .1550979   .1529454     1.01   0.311    -.1447927    .4549886
          9  |   .2424165   .1563964     1.55   0.121    -.0642408    .5490738
         10  |   .2674452   .1555124     1.72   0.086    -.0374787     .572369
         11  |  -.0244591   .1583203    -0.15   0.877    -.3348888    .2859705
         12  |   .0641082   .1762093     0.36   0.716    -.2813976     .409614
             |
         ind |
          2  |   .1843001   .1758111     1.05   0.295    -.1604249    .5290251
          3  |   .2124756    .301036     0.71   0.480    -.3777866    .8027378
          4  |   .0743081   .0913263     0.81   0.416    -.1047617    .2533779
          5  |   .1328978   .0883089     1.50   0.132    -.0402555    .3060511
          6  |   .0876446   .0917257     0.96   0.339    -.0922083    .2674976
          7  |   .2469948   .1252223     1.97   0.049     .0014628    .4925269
          8  |   .1704728   .0922519     1.85   0.065    -.0104119    .3513576
          9  |   .1243609   .1005082     1.24   0.216    -.0727126    .3214343
         10  |   .1160097   .0961101     1.21   0.228      -.07244    .3044593
         11  |   .1738562   .0990583     1.76   0.079    -.0203744    .3680867
         12  |    .242936   .1016885     2.39   0.017     .0435483    .4423237
         13  |   .2181283    .108589     2.01   0.045     .0052104    .4310463
         14  |   .1708195   .1033458     1.65   0.098    -.0318179    .3734568
         15  |   .1569387   .0972622     1.61   0.107    -.0337701    .3476475
         16  |   .1464471    .092692     1.58   0.114    -.0353005    .3281946
         17  |   .0972307    .145737     0.67   0.505    -.1885259    .3829873
         18  |    .225599      .1472     1.53   0.125    -.0630263    .5142243
             |
    1.dunion |   .0721949   .0224684     3.21   0.001     .0281395    .1162503
   schooling |   .0455982   .0050595     9.01   0.000     .0356777    .0555187
             |
       dsize |
          1  |   .0151704   .0269914     0.56   0.574    -.0377536    .0680944
          2  |   .1252237   .0257771     4.86   0.000     .0746808    .1757667
             |
   emptenure |   .0172585   .0033036     5.22   0.000     .0107809    .0237361
             |
 c.emptenure#|
 c.emptenure |  -.0001739   .0000866    -2.01   0.045    -.0003437   -4.18e-06
             |
     workexp |   .0369568     .00499     7.41   0.000     .0271725    .0467411
             |
   c.workexp#|
   c.workexp |  -.0006196   .0001018    -6.09   0.000    -.0008193     -.00042
             |
       _cons |   5.950112   .1515413    39.26   0.000     5.652975     6.24725
------------------------------------------------------------------------------
/* OLS  3th order */

Linear regression                               Number of obs     =      2,984
                                                F(38, 2945)       =      33.17
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2531
                                                Root MSE          =     .47156

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         occ |
          2  |  -.0022426   .1619179    -0.01   0.989    -.3197264    .3152412
          3  |   .1507747   .1581958     0.95   0.341    -.1594109    .4609603
          4  |   .1028072   .1622451     0.63   0.526    -.2153181    .4209325
          5  |   .3858202   .1583971     2.44   0.015     .0752398    .6964005
          6  |   .2266132    .156764     1.45   0.148    -.0807649    .5339914
          7  |   .2139502   .1616147     1.32   0.186     -.102939    .5308393
          8  |    .155339     .15598     1.00   0.319    -.1505019    .4611798
          9  |   .2422337   .1593456     1.52   0.129    -.0702064    .5546737
         10  |   .2642707   .1584814     1.67   0.096    -.0464749    .5750163
         11  |  -.0302471   .1615573    -0.19   0.851    -.3470238    .2865296
         12  |   .0696499   .1791148     0.39   0.697    -.2815529    .4208527
             |
         ind |
          2  |   .2174753   .1814852     1.20   0.231    -.1383755    .5733261
          3  |   .2148864   .2949771     0.73   0.466    -.3634958    .7932686
          4  |   .0751659   .0905792     0.83   0.407     -.102439    .2527708
          5  |   .1387198   .0876181     1.58   0.113    -.0330792    .3105188
          6  |    .090515   .0909854     0.99   0.320    -.0878864    .2689164
          7  |   .2499378   .1247526     2.00   0.045     .0053266    .4945489
          8  |   .1708665   .0914946     1.87   0.062    -.0085334    .3502664
          9  |   .1248382   .0997054     1.25   0.211    -.0706612    .3203376
         10  |   .1192262   .0953633     1.25   0.211    -.0677592    .3062116
         11  |   .1788327   .0984292     1.82   0.069    -.0141643    .3718298
         12  |   .2487717   .1010046     2.46   0.014      .050725    .4468185
         13  |   .2221759    .108174     2.05   0.040     .0100715    .4342803
         14  |   .1778751   .1026408     1.73   0.083    -.0233799    .3791302
         15  |   .1651388   .0965192     1.71   0.087    -.0241132    .3543907
         16  |   .1494422   .0920539     1.62   0.105    -.0310542    .3299386
         17  |   .1111188   .1446027     0.77   0.442    -.1724138    .3946515
         18  |   .2322906   .1464876     1.59   0.113    -.0549379     .519519
             |
    1.dunion |   .0716437   .0223843     3.20   0.001     .0277533    .1155341
   schooling |   .0471206   .0051744     9.11   0.000     .0369749    .0572663
             |
       dsize |
          1  |   .0128628     .02693     0.48   0.633    -.0399408    .0656664
          2  |   .1256366   .0256765     4.89   0.000     .0752909    .1759823
             |
   emptenure |   .0316977   .0075543     4.20   0.000     .0168856    .0465099
             |
 c.emptenure#|
 c.emptenure |  -.0011971    .000457    -2.62   0.009    -.0020932    -.000301
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure |   .0000183   7.54e-06     2.43   0.015     3.51e-06    .0000331
             |
     workexp |   .0600945   .0138981     4.32   0.000     .0328435    .0873455
             |
   c.workexp#|
   c.workexp |  -.0016341   .0006256    -2.61   0.009    -.0028607   -.0004076
             |
   c.workexp#|
   c.workexp#|
   c.workexp |   .0000135   8.59e-06     1.57   0.116    -3.35e-06    .0000303
             |
       _cons |   5.735697   .1773886    32.33   0.000     5.387879    6.083515
------------------------------------------------------------------------------
/* OLS  4th order */

Linear regression                               Number of obs     =      2,984
                                                F(40, 2943)       =      30.79
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2548
                                                Root MSE          =     .47118

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         occ |
          2  |   .0338215   .1687141     0.20   0.841    -.2969881    .3646311
          3  |    .167164   .1629048     1.03   0.305    -.1522549    .4865828
          4  |   .1194151    .166922     0.72   0.474    -.2078805    .4467107
          5  |   .3960919   .1630729     2.43   0.015     .0763434    .7158404
          6  |   .2409059   .1614746     1.49   0.136    -.0757086    .5575205
          7  |   .2282496   .1663112     1.37   0.170    -.0978484    .5543475
          8  |   .1667302   .1607233     1.04   0.300    -.1484112    .4818716
          9  |   .2548533   .1640196     1.55   0.120    -.0667515    .5764582
         10  |   .2766841   .1631587     1.70   0.090    -.0432327    .5966009
         11  |  -.0178843    .166146    -0.11   0.914    -.3436584    .3078898
         12  |   .0808426   .1831395     0.44   0.659     -.278252    .4399372
             |
         ind |
          2  |   .1976249    .182056     1.09   0.278    -.1593451    .5545949
          3  |   .1819336   .2937185     0.62   0.536     -.393981    .7578482
          4  |   .0627408    .091505     0.69   0.493    -.1166795    .2421611
          5  |   .1247897   .0885765     1.41   0.159    -.0488884    .2984678
          6  |   .0753166   .0917592     0.82   0.412    -.1046021    .2552353
          7  |   .2297898   .1254799     1.83   0.067    -.0162474     .475827
          8  |   .1588214   .0923874     1.72   0.086     -.022329    .3399718
          9  |   .1107404    .100328     1.10   0.270    -.0859798    .3074606
         10  |   .1067386   .0962461     1.11   0.268    -.0819778    .2954551
         11  |   .1657693   .0993469     1.67   0.095    -.0290272    .3605658
         12  |   .2353233   .1018118     2.31   0.021     .0356937    .4349528
         13  |   .2138247   .1083535     1.97   0.049     .0013684    .4262811
         14  |   .1679221   .1031165     1.63   0.104    -.0342657    .3701099
         15  |   .1495264   .0972668     1.54   0.124    -.0411913    .3402442
         16  |   .1359832   .0931521     1.46   0.144    -.0466667    .3186331
         17  |   .1031817   .1459339     0.71   0.480    -.1829611    .3893245
         18  |   .2244012   .1456145     1.54   0.123    -.0611153    .5099178
             |
    1.dunion |   .0729529   .0224084     3.26   0.001     .0290151    .1168907
   schooling |    .047362   .0051804     9.14   0.000     .0372044    .0575195
             |
       dsize |
          1  |   .0107023   .0269626     0.40   0.691    -.0421652    .0635699
          2  |    .125349   .0256758     4.88   0.000     .0750046    .1756933
             |
   emptenure |    .060688   .0138046     4.40   0.000     .0336204    .0877555
             |
 c.emptenure#|
 c.emptenure |   -.004682   .0014314    -3.27   0.001    -.0074887   -.0018753
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure |   .0001584   .0000539     2.94   0.003     .0000528     .000264
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure#|
 c.emptenure |  -1.78e-06   6.62e-07    -2.68   0.007    -3.08e-06   -4.80e-07
             |
     workexp |   .0456604   .0311871     1.46   0.143    -.0154903     .106811
             |
   c.workexp#|
   c.workexp |  -.0001346    .002324    -0.06   0.954    -.0046914    .0044222
             |
   c.workexp#|
   c.workexp#|
   c.workexp |  -.0000404   .0000697    -0.58   0.562    -.0001771    .0000962
             |
   c.workexp#|
   c.workexp#|
   c.workexp#|
   c.workexp |   6.25e-07   7.22e-07     0.87   0.387    -7.90e-07    2.04e-06
             |
       _cons |   5.714523   .2121862    26.93   0.000     5.298475    6.130571
------------------------------------------------------------------------------

. 
. *** AS
. forvalues poly_x=1/4{
  2.         qui {
  3.                 use "$Inputfd\jhps_hc_toda.dta", clear
  4.                 destring, replace
  5.                 tsset id year
  6.                 do "$Code\ConstructIV.do"
  7.                 ivregress 2sls ///
>                                         `commonVar' ///
>                                         `todaexp`poly_x'' ///
>                                         (`todaemp`poly_x'' = `todaiv`poly_x'') 
> ///
>                                         , vce(r)
  8.                 est sto isvtoda`poly_x'
  9.                 drop if _est_isvtoda`poly_x'==0
 10.                 drop *iv *iv? avg*
 11.                 do "$Code\ConstructIV.do"
 12.         }
 13.         dis "/* AS'sIV  `poly_x'th order */"
 14.         ivregress 2sls ///
>                                 `commonVar' ///
>                                         `todaexp`poly_x'' ///
>                                         (`todaemp`poly_x'' = `todaiv`poly_x'') 
> ///
>                                 , vce(r)
 15.         est sto isvtoda`poly_x'
 16. }
/* AS'sIV  1th order */

Instrumental variables (2SLS) regression          Number of obs   =      2,984
                                                  Wald chi2(33)   =     683.28
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1688
                                                  Root MSE        =      .4942

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   emptenure |    .027956   .0098237     2.85   0.004     .0087018    .0472101
             |
         occ |
          2  |   .0077747   .1193042     0.07   0.948    -.2260572    .2416065
          3  |    .164032   .1123763     1.46   0.144    -.0562215    .3842856
          4  |    .114562   .1185272     0.97   0.334     -.117747     .346871
          5  |   .2904513    .135725     2.14   0.032     .0244352    .5564674
          6  |   .1755546   .1128317     1.56   0.120    -.0455914    .3967006
          7  |   .2529733   .1188397     2.13   0.033     .0200518    .4858948
          8  |   .1622525   .1079452     1.50   0.133    -.0493162    .3738213
          9  |   .2423981   .1135151     2.14   0.033     .0199125    .4648837
         10  |   .2473292   .1117217     2.21   0.027     .0283588    .4662997
         11  |   .0331569    .118663     0.28   0.780    -.1994183     .265732
         12  |   .0372282   .1412649     0.26   0.792    -.2396459    .3141022
             |
         ind |
          2  |  -.0268137   .1637281    -0.16   0.870     -.347715    .2940875
          3  |   .1868008   .2651027     0.70   0.481     -.332791    .7063926
          4  |   .0272979   .0841462     0.32   0.746    -.1376257    .1922214
          5  |   .0672498   .0856762     0.78   0.432    -.1006725    .2351721
          6  |   .0095017   .0884395     0.11   0.914    -.1638366      .18284
          7  |   .2224772   .1213163     1.83   0.067    -.0152985    .4602528
          8  |   .1468348   .0846375     1.73   0.083    -.0190515    .3127212
          9  |   .1599891   .0966022     1.66   0.098    -.0293477    .3493259
         10  |   .0643828   .0894671     0.72   0.472    -.1109696    .2397351
         11  |   .1184957   .0929863     1.27   0.203    -.0637542    .3007455
         12  |   .2025315   .0971677     2.08   0.037     .0120862    .3929767
         13  |   .1692646   .1023257     1.65   0.098    -.0312901    .3698193
         14  |   .1710416   .1006314     1.70   0.089    -.0261923    .3682756
         15  |   .1396537   .0922725     1.51   0.130    -.0411972    .3205045
         16  |   .1465212   .0851419     1.72   0.085    -.0203539    .3133964
         17  |   .0378649   .1409532     0.27   0.788    -.2383984    .3141282
         18  |   .1730845   .1557649     1.11   0.266     -.132209    .4783781
             |
    1.dunion |   .0299192   .0302229     0.99   0.322    -.0293166    .0891551
   schooling |   .0587948    .011917     4.93   0.000     .0354378    .0821517
             |
       dsize |
          1  |   -.022868   .0318284    -0.72   0.472    -.0852507    .0395146
          2  |   .0363558   .0576203     0.63   0.528    -.0765779    .1492894
             |
       _cons |   6.129725   .2742802    22.35   0.000     5.592145    6.667304
------------------------------------------------------------------------------
Instrumented:  emptenure
Instruments:   2.occ 3.occ 4.occ 5.occ 6.occ 7.occ 8.occ 9.occ 10.occ 11.occ
               12.occ 2.ind 3.ind 4.ind 5.ind 6.ind 7.ind 8.ind 9.ind 10.ind
               11.ind 12.ind 13.ind 14.ind 15.ind 16.ind 17.ind 18.ind
               1.dunion schooling 1.dsize 2.dsize emptenureiv
/* AS'sIV  2th order */

Instrumental variables (2SLS) regression          Number of obs   =      2,984
                                                  Wald chi2(36)   =    1869.34
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1844
                                                  Root MSE        =     .48954

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   emptenure |   .0622999   .0265724     2.34   0.019     .0102188    .1143809
             |
 c.emptenure#|
 c.emptenure |   -.001119   .0005905    -1.90   0.058    -.0022762    .0000383
             |
         occ |
          2  |  -.1579069   .1416148    -1.12   0.265    -.4354668     .119653
          3  |   .1460894    .113948     1.28   0.200    -.0772447    .3694234
          4  |    .127929   .1179124     1.08   0.278    -.1031751     .359033
          5  |   .3223068   .1655572     1.95   0.052    -.0021794     .646793
          6  |    .179029   .1395645     1.28   0.200    -.0945123    .4525703
          7  |   .2430363   .1144928     2.12   0.034     .0186346    .4674379
          8  |   .1447279   .1114787     1.30   0.194    -.0737663    .3632222
          9  |   .2315866   .1195958     1.94   0.053    -.0028169    .4659901
         10  |   .2484359   .1265488     1.96   0.050     .0004049     .496467
         11  |  -.0180149   .1195058    -0.15   0.880     -.252242    .2162123
         12  |   .0188344    .158327     0.12   0.905    -.2914808    .3291496
             |
         ind |
          2  |   .1133022   .1895408     0.60   0.550    -.2581909    .4847954
          3  |   .2832069   .2655975     1.07   0.286    -.2373547    .8037685
          4  |   .1217488   .0887216     1.37   0.170    -.0521423    .2956399
          5  |   .1601165   .0937781     1.71   0.088    -.0236851    .3439182
          6  |   .1242173   .1011503     1.23   0.219    -.0740336    .3224682
          7  |   .2813628   .1238076     2.27   0.023     .0387043    .5240213
          8  |   .2367034   .0932098     2.54   0.011     .0540155    .4193912
          9  |   .2306657   .1270918     1.81   0.070    -.0184297     .479761
         10  |   .1643228   .0987741     1.66   0.096    -.0292708    .3579165
         11  |   .2140864   .1019696     2.10   0.036     .0142296    .4139432
         12  |   .2835814   .1006723     2.82   0.005     .0862674    .4808954
         13  |   .2697016   .1080505     2.50   0.013     .0579266    .4814766
         14  |   .2368784   .1099713     2.15   0.031     .0213385    .4524183
         15  |   .2258941   .1027842     2.20   0.028     .0244408    .4273473
         16  |   .2270845   .1030803     2.20   0.028     .0250509    .4291181
         17  |   .1463912   .1353433     1.08   0.279    -.1188768    .4116592
         18  |   .3121593   .1581572     1.97   0.048     .0021769    .6221417
             |
    1.dunion |   .0323899    .056451     0.57   0.566    -.0782521    .1430319
   schooling |    .047846   .0063235     7.57   0.000     .0354521    .0602399
             |
       dsize |
          1  |  -.0164348   .0529991    -0.31   0.756    -.1203112    .0874416
          2  |   .0671089   .1060843     0.63   0.527    -.1408125    .2750304
             |
     workexp |   .0084648   .0179801     0.47   0.638    -.0267755     .043705
             |
   c.workexp#|
   c.workexp |  -.0000942   .0003295    -0.29   0.775    -.0007401    .0005517
             |
       _cons |   5.902256   .1458455    40.47   0.000     5.616404    6.188108
------------------------------------------------------------------------------
Instrumented:  emptenure c.emptenure#c.emptenure
Instruments:   2.occ 3.occ 4.occ 5.occ 6.occ 7.occ 8.occ 9.occ 10.occ 11.occ
               12.occ 2.ind 3.ind 4.ind 5.ind 6.ind 7.ind 8.ind 9.ind 10.ind
               11.ind 12.ind 13.ind 14.ind 15.ind 16.ind 17.ind 18.ind
               1.dunion schooling 1.dsize 2.dsize workexp
               c.workexp#c.workexp emptenureiv emptenureiv2
/* AS'sIV  3th order */

Instrumental variables (2SLS) regression          Number of obs   =      2,984
                                                  Wald chi2(38)   =    2162.18
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1881
                                                  Root MSE        =     .48843

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   emptenure |    .053675   .0346626     1.55   0.122    -.0142624    .1216124
             |
 c.emptenure#|
 c.emptenure |   -.000565   .0020933    -0.27   0.787    -.0046677    .0035377
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure |  -.0000104   .0000359    -0.29   0.773    -.0000808    .0000601
             |
         occ |
          2  |  -.1554967    .143043    -1.09   0.277    -.4358559    .1248624
          3  |   .1494031   .1150419     1.30   0.194    -.0760749    .3748812
          4  |   .1298168   .1190563     1.09   0.276    -.1035291    .3631628
          5  |   .3330779   .1670885     1.99   0.046     .0055905    .6605653
          6  |   .1857507   .1408493     1.32   0.187    -.0903087    .4618102
          7  |   .2424211   .1162595     2.09   0.037     .0145568    .4702855
          8  |   .1493088   .1125373     1.33   0.185    -.0712602    .3698779
          9  |   .2344668   .1211118     1.94   0.053    -.0029079    .4718416
         10  |   .2563002    .126443     2.03   0.043     .0084764     .504124
         11  |   -.015213   .1235044    -0.12   0.902    -.2572772    .2268513
         12  |   .0245039   .1606254     0.15   0.879    -.2903161    .3393239
             |
         ind |
          2  |   .1173965    .207219     0.57   0.571    -.2887453    .5235383
          3  |   .2985023   .2672501     1.12   0.264    -.2252983     .822303
          4  |   .1281476   .0893047     1.43   0.151    -.0468863    .3031815
          5  |    .168228   .0929965     1.81   0.070    -.0140417    .3504977
          6  |   .1339758   .0998625     1.34   0.180    -.0617512    .3297027
          7  |   .2900962   .1237123     2.34   0.019     .0476245     .532568
          8  |   .2413907    .094157     2.56   0.010     .0568462    .4259351
          9  |   .2350092    .131817     1.78   0.075    -.0233474    .4933659
         10  |    .173466   .0980803     1.77   0.077    -.0187678    .3656999
         11  |   .2201593   .1014939     2.17   0.030      .021235    .4190836
         12  |   .2888068   .1006024     2.87   0.004     .0916297    .4859839
         13  |    .281171   .1079585     2.60   0.009     .0695761    .4927658
         14  |   .2428154   .1117225     2.17   0.030     .0238433    .4617875
         15  |   .2318934   .1035921     2.24   0.025     .0288565    .4349303
         16  |   .2320927   .1058432     2.19   0.028     .0246439    .4395416
         17  |   .1531716   .1352434     1.13   0.257    -.1119006    .4182438
         18  |    .320326   .1579872     2.03   0.043     .0106767    .6299753
             |
    1.dunion |    .035789   .0567222     0.63   0.528    -.0753844    .1469624
   schooling |    .049634   .0071597     6.93   0.000     .0356012    .0636668
             |
       dsize |
          1  |  -.0131448   .0524572    -0.25   0.802    -.1159589    .0896694
          2  |   .0734523   .1068668     0.69   0.492    -.1360027    .2829074
             |
     workexp |   .0335233   .0263175     1.27   0.203     -.018058    .0851046
             |
   c.workexp#|
   c.workexp |  -.0013229   .0012516    -1.06   0.291    -.0037759    .0011302
             |
   c.workexp#|
   c.workexp#|
   c.workexp |   .0000181   .0000175     1.03   0.301    -.0000162    .0000524
             |
       _cons |   5.747512   .1534046    37.47   0.000     5.446845     6.04818
------------------------------------------------------------------------------
Instrumented:  emptenure c.emptenure#c.emptenure
               c.emptenure#c.emptenure#c.emptenure
Instruments:   2.occ 3.occ 4.occ 5.occ 6.occ 7.occ 8.occ 9.occ 10.occ 11.occ
               12.occ 2.ind 3.ind 4.ind 5.ind 6.ind 7.ind 8.ind 9.ind 10.ind
               11.ind 12.ind 13.ind 14.ind 15.ind 16.ind 17.ind 18.ind
               1.dunion schooling 1.dsize 2.dsize workexp
               c.workexp#c.workexp c.workexp#c.workexp#c.workexp emptenureiv
               emptenureiv2 emptenureiv3
/* AS'sIV  4th order */

Instrumental variables (2SLS) regression          Number of obs   =      2,984
                                                  Wald chi2(40)   =    1029.79
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1904
                                                  Root MSE        =     .48774

------------------------------------------------------------------------------
             |               Robust
    realwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   emptenure |   .0827304   .0509143     1.62   0.104    -.0170598    .1825206
             |
 c.emptenure#|
 c.emptenure |  -.0044542   .0055048    -0.81   0.418    -.0152434    .0063349
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure |   .0001541   .0002157     0.71   0.475    -.0002687    .0005769
             |
 c.emptenure#|
 c.emptenure#|
 c.emptenure#|
 c.emptenure |  -2.07e-06   2.63e-06    -0.79   0.430    -7.22e-06    3.08e-06
             |
         occ |
          2  |  -.0946925   .1751682    -0.54   0.589    -.4380159    .2486308
          3  |   .1583775   .1192066     1.33   0.184    -.0752631    .3920181
          4  |   .1391756   .1231496     1.13   0.258    -.1021932    .3805444
          5  |   .3213152   .1673231     1.92   0.055     -.006632    .6492624
          6  |   .1855215   .1423061     1.30   0.192    -.0933933    .4644363
          7  |   .2533728    .121125     2.09   0.036     .0159722    .4907734
          8  |   .1539746   .1162096     1.32   0.185    -.0737922    .3817413
          9  |   .2380298   .1245524     1.91   0.056    -.0060884     .482148
         10  |   .2559484    .128413     1.99   0.046     .0042634    .5076333
         11  |   .0040559   .1297342     0.03   0.975    -.2502184    .2583303
         12  |   .0244022   .1626365     0.15   0.881    -.2943594    .3431638
             |
         ind |
          2  |   .0650257   .2060511     0.32   0.752    -.3388271    .4688784
          3  |   .2416211   .2625888     0.92   0.357    -.2730435    .7562857
          4  |     .10155   .0959385     1.06   0.290     -.086486     .289586
          5  |   .1352603   .1021258     1.32   0.185    -.0649026    .3354233
          6  |   .0964393    .111242     0.87   0.386    -.1215911    .3144697
          7  |   .2596957   .1316391     1.97   0.049     .0016878    .5177036
          8  |   .2157522   .1005452     2.15   0.032     .0186872    .4128172
          9  |   .2148467   .1351302     1.59   0.112    -.0500037     .479697
         10  |   .1428059   .1072822     1.33   0.183    -.0674633    .3530751
         11  |   .1892718   .1081108     1.75   0.080    -.0226215    .4011651
         12  |   .2628424   .1061355     2.48   0.013     .0548207    .4708641
         13  |   .2558593    .111222     2.30   0.021     .0378681    .4738505
         14  |   .2295495   .1126708     2.04   0.042     .0087188    .4503802
         15  |   .2088024   .1099425     1.90   0.058    -.0066808    .4242857
         16  |   .2115876   .1096706     1.93   0.054    -.0033628    .4265381
         17  |   .1293356   .1402635     0.92   0.356    -.1455758     .404247
         18  |   .2923488   .1629578     1.79   0.073    -.0270427    .6117402
             |
    1.dunion |   .0313474   .0557923     0.56   0.574    -.0780034    .1406982
   schooling |   .0504239   .0072382     6.97   0.000     .0362372    .0646106
             |
       dsize |
          1  |   -.020758   .0528541    -0.39   0.695    -.1243502    .0828341
          2  |   .0585529   .1068397     0.55   0.584    -.1508491    .2679548
             |
     workexp |   .0515851   .0496476     1.04   0.299    -.0457224    .1488925
             |
   c.workexp#|
   c.workexp |  -.0021276   .0043033    -0.49   0.621    -.0105619    .0063068
             |
   c.workexp#|
   c.workexp#|
   c.workexp |   .0000286   .0001456     0.20   0.844    -.0002568    .0003141
             |
   c.workexp#|
   c.workexp#|
   c.workexp#|
   c.workexp |  -2.93e-08   1.59e-06    -0.02   0.985    -3.15e-06    3.09e-06
             |
       _cons |   5.623787   .2146741    26.20   0.000     5.203033     6.04454
------------------------------------------------------------------------------
Instrumented:  emptenure c.emptenure#c.emptenure
               c.emptenure#c.emptenure#c.emptenure
               c.emptenure#c.emptenure#c.emptenure#c.emptenure
Instruments:   2.occ 3.occ 4.occ 5.occ 6.occ 7.occ 8.occ 9.occ 10.occ 11.occ
               12.occ 2.ind 3.ind 4.ind 5.ind 6.ind 7.ind 8.ind 9.ind 10.ind
               11.ind 12.ind 13.ind 14.ind 15.ind 16.ind 17.ind 18.ind
               1.dunion schooling 1.dsize 2.dsize workexp
               c.workexp#c.workexp c.workexp#c.workexp#c.workexp
               c.workexp#c.workexp#c.workexp#c.workexp emptenureiv
               emptenureiv2 emptenureiv3 emptenureiv4

. 
. ** culc. return
. forvalues poly_x=1/4{ /* loop within ten_inomial */
  2.                 *** culculation
.                 est res olstoda`poly_x'
  3.                 margins, exp(`culcemp`poly_x'') ///
>                 at(emptenure=(0(1)25)) noe post
  4.                 est sto olstodar`poly_x'
  5.                 est res isvtoda`poly_x'
  6.                 margins, exp(`culcemp`poly_x'') ///
>                 at(emptenure=(0(1)25)) noe post
  7.                 est sto isvtodar`poly_x'
  8.                 
.                 *** plot
.                 qui coefplot (olstodar`poly_x', label(OLS)) (isvtodar`poly_x', 
> label(IV)), ///
>                 `comSetPlot'
  9.                 graph export "$Output\plot_as_toda_`poly_x'.pdf", replace
 10. }
(results olstoda1 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      2,984
Model VCE    : Robust

Expression   : emptenure*_b[emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |          0  (empty)
          2  |   .0144802   .0008583    16.87   0.000     .0127981    .0161624
          3  |   .0289605   .0017165    16.87   0.000     .0255962    .0323248
          4  |   .0434407   .0025748    16.87   0.000     .0383943    .0484872
          5  |    .057921    .003433    16.87   0.000     .0511923    .0646496
          6  |   .0724012   .0042913    16.87   0.000     .0639904     .080812
          7  |   .0868814   .0051495    16.87   0.000     .0767885    .0969743
          8  |   .1013617   .0060078    16.87   0.000     .0895866    .1131367
          9  |   .1158419   .0068661    16.87   0.000     .1023847    .1292991
         10  |   .1303222   .0077243    16.87   0.000     .1151828    .1454615
         11  |   .1448024   .0085826    16.87   0.000     .1279809    .1616239
         12  |   .1592826   .0094408    16.87   0.000      .140779    .1777863
         13  |   .1737629   .0102991    16.87   0.000      .153577    .1939487
         14  |   .1882431   .0111573    16.87   0.000     .1663751    .2101111
         15  |   .2027233   .0120156    16.87   0.000     .1791732    .2262735
         16  |   .2172036   .0128738    16.87   0.000     .1919713    .2424359
         17  |   .2316838   .0137321    16.87   0.000     .2047694    .2585983
         18  |   .2461641   .0145904    16.87   0.000     .2175675    .2747606
         19  |   .2606443   .0154486    16.87   0.000     .2303656     .290923
         20  |   .2751245   .0163069    16.87   0.000     .2431636    .3070854
         21  |   .2896048   .0171651    16.87   0.000     .2559617    .3232478
         22  |    .304085   .0180234    16.87   0.000     .2687598    .3394102
         23  |   .3185653   .0188816    16.87   0.000     .2815579    .3555726
         24  |   .3330455   .0197399    16.87   0.000      .294356     .371735
         25  |   .3475257   .0205982    16.87   0.000     .3071541    .3878974
         26  |    .362006   .0214564    16.87   0.000     .3199522    .4040598
------------------------------------------------------------------------------
(results isvtoda1 are active now)
Warning: expression() does not contain predict() or xb().

Predictive margins                              Number of obs     =      2,984
Model VCE    : Robust

Expression   : emptenure*_b[emptenure]

1._at        : emptenure       =           0

2._at        : emptenure       =           1

3._at        : emptenure       =           2

4._at        : emptenure       =           3

5._at        : emptenure       =           4

6._at        : emptenure       =           5

7._at        : emptenure       =           6

8._at        : emptenure       =           7

9._at        : emptenure       =           8

10._at       : emptenure       =           9

11._at       : emptenure       =          10

12._at       : emptenure       =          11

13._at       : emptenure       =          12

14._at       : emptenure       =          13

15._at       : emptenure       =          14

16._at       : emptenure       =          15

17._at       : emptenure       =          16

18._at       : emptenure       =          17

19._at       : emptenure       =          18

20._at       : emptenure       =          19

21._at       : emptenure       =          20

22._at       : emptenure       =          21

23._at       : emptenure       =          22

24._at       : emptenure       =          23

25._at       : emptenure       =          24

26._at       : emptenure       =          25

------------------------------------------------------------------------------
             |            Delta-method
             |     Margin   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         _at |
          1  |          0  (empty)
          2  |    .027956   .0098237     2.85   0.004     .0087018    .0472101
          3  |   .0559119   .0196474     2.85   0.004     .0174036    .0944202
          4  |   .0838679   .0294712     2.85   0.004     .0261054    .1416303
          5  |   .1118238   .0392949     2.85   0.004     .0348072    .1888404
          6  |   .1397798   .0491186     2.85   0.004     .0435091    .2360505
          7  |   .1677357   .0589423     2.85   0.004     .0522109    .2832605
          8  |   .1956917    .068766     2.85   0.004     .0609127    .3304706
          9  |   .2236476   .0785898     2.85   0.004     .0696145    .3776807
         10  |   .2516036   .0884135     2.85   0.004     .0783163    .4248908
         11  |   .2795595   .0982372     2.85   0.004     .0870181    .4721009
         12  |   .3075155   .1080609     2.85   0.004     .0957199     .519311
         13  |   .3354714   .1178847     2.85   0.004     .1044217    .5665211
         14  |   .3634274   .1277084     2.85   0.004     .1131235    .6137312
         15  |   .3913833   .1375321     2.85   0.004     .1218254    .6609413
         16  |   .4193393   .1473558     2.85   0.004     .1305272    .7081514
         17  |   .4472952   .1571795     2.85   0.004      .139229    .7553614
         18  |   .4752512   .1670033     2.85   0.004     .1479308    .8025715
         19  |   .5032071    .176827     2.85   0.004     .1566326    .8497816
         20  |   .5311631   .1866507     2.85   0.004     .1653344    .8969917
         21  |    .559119   .1964744     2.85   0.004     .1740362    .9442018
         22  |    .587075   .2062981     2.85   0.004      .182738    .9914119
         23  |   .6150309   .2161219     2.85   0.004     .1914399    1.038622
         24  |   .6429869   .2259456     2.85   0.004     .2001417    1.085832
         25  |   .6709428   .2357693     2.85   0.004     .2088435    1.133042
         26  |   .6988988    .245593     2.85   0.004     .2175453    1.180252
------------------------------------------------------------------------------
(file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Ou
> tput\plot_as_toda_1.pdf written in PDF format)
(results olstoda2 are active now)
Warning: expression() does not contain predict() or xb().
