{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Output\DataCorrection.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 5 Oct 2018, 20:19:04
{txt}
{com}. 
. * 1--4
. ** new cohort: データ整理+学歴勤務履歴データの抽出
. {c -(}
. ** JHPS2009
. {c -(}
. * 変数名の変更
. ** 本人
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\JHPS2009.csv", clear 
{res}{text}(523 vars, 4,022 obs)
{com}. rename (v1 v4 v5 v6 v7 v101 v102 v103 v142 v146 ///
> v153 v154 v155 v156 v159 v160 ///
> v167 v168 v169 ///
> v173 v174 v175 v176 v177 v178 ///
> v180 v181 v182) ///
> (id marital sex byear bmonth head earnif earnmost edbg workstatus ///
> occ owner ind size employed regular ///
> empsinceyear empsincemonth union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 世帯主ダミー作成
. ** 世帯主ですか
. replace head=0 if head!=1
{txt}(1,989 real changes made)
{com}. ** 主たる生計維持者
. replace earnmost=1 if head==1&earnif==2
{txt}(1,796 real changes made)
{com}. replace earnmost=0 if earnmost!=1
{txt}(2,094 real changes made)
{com}. * switch dummy
. gen switch=0
. * 使わない変数を落とす
. drop earnif v*
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2009_pr.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2009_pr.dta saved
{com}. 
. ** 配偶者
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\JHPS2009.csv", clear 
{res}{text}(523 vars, 4,022 obs)
{com}. rename (v1 v4  v12 v13 v14 v101 v102 v103 v274 v279 ///
> v286 v287 v288 v289 v292 v293 ///
> v300 v301 v302 ///
> v306 v307 v308 v309 v310 v311 ///
> v313 v314 v315) ///
> (id marital sex byear bmonth head earnif earnmost edbg workstatus ///
> occ owner ind size employed regular ///
> empsinceyear empsincemonth union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 続柄が配偶者のサンプルのみ残す
. keep if marital==1
{txt}(1,133 observations deleted)
{com}. * 世帯主ダミー作成
. ** 世帯主ですか
. replace head=0 if head!=2
{txt}(1,652 real changes made)
{com}. replace head=1 if head==2
{txt}(1,237 real changes made)
{com}. ** 主たる生計維持者
. replace earnmost=1 if earnmost==2|head==1&earnif==2
{txt}(1,183 real changes made)
{com}. replace earnmost=0 if earnmost!=1
{txt}(1,646 real changes made)
{com}. * switch dummy
. gen switch=0
. * 使わない変数を落とす
. drop earnif v*
. * idを+10000
. replace id=id+10000
{txt}(2,889 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2009_sp.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2009_sp.dta saved
{com}. 
. ** 本人と配偶者サンプルをバインド
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2009_pr.dta", clear
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2009_sp.dta"
. gen year=2009
. * ageを作成
. mvdecode byear, mv(9999) /* 欠損値を作成 */
       {txt}byear:{res}{col 15}10{txt} missing values generated
{com}. mvdecode bmonth, mv(99)
      {txt}bmonth:{res}{col 15}14{txt} missing values generated
{com}. replace byear=2020 if byear==. /* 欠損値をあり得ない値に変更 */
{txt}(10 real changes made)
{com}. replace bmonth=0 if bmonth==.
{txt}(14 real changes made)
{com}. replace bmonth=bmonth+10 /* 誕生月を+10 */
{txt}(6,911 real changes made)
{com}. tostring byear bmonth, replace /* 誕生年月を文字列に変更 */
{txt}byear was {res:int} now {res:str4}
bmonth was {res:byte} now {res:str2}
{com}. gen bday=byear+bmonth+"15" /* 生年月日の文字列を作成(誕生日は15日と仮定) */
. destring bday, replace /* 文字列を数字に戻す */
{txt}bday: all characters numeric; {res}replaced {txt}as {res}long
{com}. replace bday=bday-1000 /* 誕生月を+10した分を戻す */
{txt}(6,911 real changes made)
{com}. gen age=round((20090130-bday)/10000) /* 調査日時点での年齢を計算 */
. replace age=. if age<0 /* 欠損値だったサンプルの年齢を欠損値に */
{txt}(10 real changes made, 10 to missing)
{com}. drop byear bmonth bday
. * emptenureを作成
. for num 8888 9999: mvdecode empsinceyear, mv(X)

{res}->  mvdecode empsinceyear, mv(8888)
{txt}empsinceyear:{res}{col 15}2191{txt} missing values generated

{res}->  mvdecode empsinceyear, mv(9999)
{txt}empsinceyear:{res}{col 15}345{txt} missing values generated
{com}. for num 88 99: mvdecode empsincemonth, mv(X)

{res}->  mvdecode empsincemonth, mv(88)
{txt}empsincemo~h:{res}{col 15}2191{txt} missing values generated

{res}->  mvdecode empsincemonth, mv(99)
{txt}empsincemo~h:{res}{col 15}487{txt} missing values generated
{com}. replace empsinceyear=2020 if empsinceyear==.
{txt}(2,536 real changes made)
{com}. replace empsincemonth=0 if empsincemonth==.
{txt}(2,678 real changes made)
{com}. replace empsincemonth=empsincemonth+10
{txt}(6,911 real changes made)
{com}. tostring empsinceyear empsincemonth, replace
{txt}empsinceyear was {res:int} now {res:str4}
empsincemonth was {res:byte} now {res:str2}
{com}. gen eday=empsinceyear+empsincemonth+"15"
. destring eday, replace
{txt}eday: all characters numeric; {res}replaced {txt}as {res}long
{com}. replace eday=eday-1000
{txt}(6,911 real changes made)
{com}. gen emptenure=(20090130-eday)/10000
. replace emptenure=. if emptenure<0
{txt}(2,567 real changes made, 2,567 to missing)
{com}. drop empsinceyear empsincemonth eday
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2009.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2009.dta saved
{com}. 
. * cohort dummy
. keep id
. gen cohort=9
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta saved
{com}. {c )-}
. 
. ** JHPS2010
. {c -(}
. * 変数名の変更
. ** 本人
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\JHPS2010.csv", clear 
{res}{text}(1,510 vars, 3,470 obs)
{com}. rename (v1 v4 v5 v6 v7 v101 v102 v103 v175 ///
> v182 v183 v184 v185 v188 v189 ///
> v231 v196 ///
> v198 v199 v200 v201 v202 v203 ///
> v205 v206 v207) ///
> (id marital sex byear bmonth head earnif earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. *** 就業履歴データの変数名変更
. **** temporal employee
. for X in num 368/420 \ Y in num 18/70: ///
> rename vX casY

{res}->  rename v368 cas18

->  rename v369 cas19

->  rename v370 cas20

->  rename v371 cas21

->  rename v372 cas22

->  rename v373 cas23

->  rename v374 cas24

->  rename v375 cas25

->  rename v376 cas26

->  rename v377 cas27

->  rename v378 cas28

->  rename v379 cas29

->  rename v380 cas30

->  rename v381 cas31

->  rename v382 cas32

->  rename v383 cas33

->  rename v384 cas34

->  rename v385 cas35

->  rename v386 cas36

->  rename v387 cas37

->  rename v388 cas38

->  rename v389 cas39

->  rename v390 cas40

->  rename v391 cas41

->  rename v392 cas42

->  rename v393 cas43

->  rename v394 cas44

->  rename v395 cas45

->  rename v396 cas46

->  rename v397 cas47

->  rename v398 cas48

->  rename v399 cas49

->  rename v400 cas50

->  rename v401 cas51

->  rename v402 cas52

->  rename v403 cas53

->  rename v404 cas54

->  rename v405 cas55

->  rename v406 cas56

->  rename v407 cas57

->  rename v408 cas58

->  rename v409 cas59

->  rename v410 cas60

->  rename v411 cas61

->  rename v412 cas62

->  rename v413 cas63

->  rename v414 cas64

->  rename v415 cas65

->  rename v416 cas66

->  rename v417 cas67

->  rename v418 cas68

->  rename v419 cas69

->  rename v420 cas70
{com}. **** regular employee
. for X in num 421/473 \ Y in num 18/70: ///
> rename vX regY

{res}->  rename v421 reg18

->  rename v422 reg19

->  rename v423 reg20

->  rename v424 reg21

->  rename v425 reg22

->  rename v426 reg23

->  rename v427 reg24

->  rename v428 reg25

->  rename v429 reg26

->  rename v430 reg27

->  rename v431 reg28

->  rename v432 reg29

->  rename v433 reg30

->  rename v434 reg31

->  rename v435 reg32

->  rename v436 reg33

->  rename v437 reg34

->  rename v438 reg35

->  rename v439 reg36

->  rename v440 reg37

->  rename v441 reg38

->  rename v442 reg39

->  rename v443 reg40

->  rename v444 reg41

->  rename v445 reg42

->  rename v446 reg43

->  rename v447 reg44

->  rename v448 reg45

->  rename v449 reg46

->  rename v450 reg47

->  rename v451 reg48

->  rename v452 reg49

->  rename v453 reg50

->  rename v454 reg51

->  rename v455 reg52

->  rename v456 reg53

->  rename v457 reg54

->  rename v458 reg55

->  rename v459 reg56

->  rename v460 reg57

->  rename v461 reg58

->  rename v462 reg59

->  rename v463 reg60

->  rename v464 reg61

->  rename v465 reg62

->  rename v466 reg63

->  rename v467 reg64

->  rename v468 reg65

->  rename v469 reg66

->  rename v470 reg67

->  rename v471 reg68

->  rename v472 reg69

->  rename v473 reg70
{com}. **** self employed
. for X in num 474/526 \ Y in num 18/70: ///
> rename vX selfY

{res}->  rename v474 self18

->  rename v475 self19

->  rename v476 self20

->  rename v477 self21

->  rename v478 self22

->  rename v479 self23

->  rename v480 self24

->  rename v481 self25

->  rename v482 self26

->  rename v483 self27

->  rename v484 self28

->  rename v485 self29

->  rename v486 self30

->  rename v487 self31

->  rename v488 self32

->  rename v489 self33

->  rename v490 self34

->  rename v491 self35

->  rename v492 self36

->  rename v493 self37

->  rename v494 self38

->  rename v495 self39

->  rename v496 self40

->  rename v497 self41

->  rename v498 self42

->  rename v499 self43

->  rename v500 self44

->  rename v501 self45

->  rename v502 self46

->  rename v503 self47

->  rename v504 self48

->  rename v505 self49

->  rename v506 self50

->  rename v507 self51

->  rename v508 self52

->  rename v509 self53

->  rename v510 self54

->  rename v511 self55

->  rename v512 self56

->  rename v513 self57

->  rename v514 self58

->  rename v515 self59

->  rename v516 self60

->  rename v517 self61

->  rename v518 self62

->  rename v519 self63

->  rename v520 self64

->  rename v521 self65

->  rename v522 self66

->  rename v523 self67

->  rename v524 self68

->  rename v525 self69

->  rename v526 self70
{com}. **** 内職
. for X in num 527/579 \ Y in num 18/70: ///
> rename vX sideY

{res}->  rename v527 side18

->  rename v528 side19

->  rename v529 side20

->  rename v530 side21

->  rename v531 side22

->  rename v532 side23

->  rename v533 side24

->  rename v534 side25

->  rename v535 side26

->  rename v536 side27

->  rename v537 side28

->  rename v538 side29

->  rename v539 side30

->  rename v540 side31

->  rename v541 side32

->  rename v542 side33

->  rename v543 side34

->  rename v544 side35

->  rename v545 side36

->  rename v546 side37

->  rename v547 side38

->  rename v548 side39

->  rename v549 side40

->  rename v550 side41

->  rename v551 side42

->  rename v552 side43

->  rename v553 side44

->  rename v554 side45

->  rename v555 side46

->  rename v556 side47

->  rename v557 side48

->  rename v558 side49

->  rename v559 side50

->  rename v560 side51

->  rename v561 side52

->  rename v562 side53

->  rename v563 side54

->  rename v564 side55

->  rename v565 side56

->  rename v566 side57

->  rename v567 side58

->  rename v568 side59

->  rename v569 side60

->  rename v570 side61

->  rename v571 side62

->  rename v572 side63

->  rename v573 side64

->  rename v574 side65

->  rename v575 side66

->  rename v576 side67

->  rename v577 side68

->  rename v578 side69

->  rename v579 side70
{com}. **** family worker
. for X in num 580/632 \ Y in num 18/70: ///
> rename vX fmwY

{res}->  rename v580 fmw18

->  rename v581 fmw19

->  rename v582 fmw20

->  rename v583 fmw21

->  rename v584 fmw22

->  rename v585 fmw23

->  rename v586 fmw24

->  rename v587 fmw25

->  rename v588 fmw26

->  rename v589 fmw27

->  rename v590 fmw28

->  rename v591 fmw29

->  rename v592 fmw30

->  rename v593 fmw31

->  rename v594 fmw32

->  rename v595 fmw33

->  rename v596 fmw34

->  rename v597 fmw35

->  rename v598 fmw36

->  rename v599 fmw37

->  rename v600 fmw38

->  rename v601 fmw39

->  rename v602 fmw40

->  rename v603 fmw41

->  rename v604 fmw42

->  rename v605 fmw43

->  rename v606 fmw44

->  rename v607 fmw45

->  rename v608 fmw46

->  rename v609 fmw47

->  rename v610 fmw48

->  rename v611 fmw49

->  rename v612 fmw50

->  rename v613 fmw51

->  rename v614 fmw52

->  rename v615 fmw53

->  rename v616 fmw54

->  rename v617 fmw55

->  rename v618 fmw56

->  rename v619 fmw57

->  rename v620 fmw58

->  rename v621 fmw59

->  rename v622 fmw60

->  rename v623 fmw61

->  rename v624 fmw62

->  rename v625 fmw63

->  rename v626 fmw64

->  rename v627 fmw65

->  rename v628 fmw66

->  rename v629 fmw67

->  rename v630 fmw68

->  rename v631 fmw69

->  rename v632 fmw70
{com}. * 世帯主ダミー作成
. ** 世帯主ですか
. replace head=0 if head!=1
{txt}(1,683 real changes made)
{com}. ** 主たる生計維持者
. replace earnmost=1 if head==1&earnif==2
{txt}(1,558 real changes made)
{com}. replace earnmost=0 if earnmost!=1
{txt}(1,793 real changes made)
{com}. * 使わない変数を落とす
. drop earnif v*
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2010_pr.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2010_pr.dta saved
{com}. 
. ** 配偶者
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\JHPS2010.csv", clear 
{res}{text}(1,510 vars, 3,470 obs)
{com}. rename (v1 v4  v12 v13 v14 v101 v102 v103 v796 ///
> v803 v804 v805 v806 v809 v810 ///
> v852 v817 ///
> v819 v820 v821 v822 v823 v824 ///
> v826 v827 v828) ///
> (id marital sex byear bmonth head earnif earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 続柄が配偶者のサンプルのみ残す
. keep if marital==1
{txt}(930 observations deleted)
{com}. *** 就業履歴データの変数名変更
. **** temporal employee
. for X in num 989/1041 \ Y in num 18/70: ///
> rename vX casY

{res}->  rename v989 cas18

->  rename v990 cas19

->  rename v991 cas20

->  rename v992 cas21

->  rename v993 cas22

->  rename v994 cas23

->  rename v995 cas24

->  rename v996 cas25

->  rename v997 cas26

->  rename v998 cas27

->  rename v999 cas28

->  rename v1000 cas29

->  rename v1001 cas30

->  rename v1002 cas31

->  rename v1003 cas32

->  rename v1004 cas33

->  rename v1005 cas34

->  rename v1006 cas35

->  rename v1007 cas36

->  rename v1008 cas37

->  rename v1009 cas38

->  rename v1010 cas39

->  rename v1011 cas40

->  rename v1012 cas41

->  rename v1013 cas42

->  rename v1014 cas43

->  rename v1015 cas44

->  rename v1016 cas45

->  rename v1017 cas46

->  rename v1018 cas47

->  rename v1019 cas48

->  rename v1020 cas49

->  rename v1021 cas50

->  rename v1022 cas51

->  rename v1023 cas52

->  rename v1024 cas53

->  rename v1025 cas54

->  rename v1026 cas55

->  rename v1027 cas56

->  rename v1028 cas57

->  rename v1029 cas58

->  rename v1030 cas59

->  rename v1031 cas60

->  rename v1032 cas61

->  rename v1033 cas62

->  rename v1034 cas63

->  rename v1035 cas64

->  rename v1036 cas65

->  rename v1037 cas66

->  rename v1038 cas67

->  rename v1039 cas68

->  rename v1040 cas69

->  rename v1041 cas70
{com}. **** regular employee
. for X in num 1042/1094 \ Y in num 18/70: ///
> rename vX regY

{res}->  rename v1042 reg18

->  rename v1043 reg19

->  rename v1044 reg20

->  rename v1045 reg21

->  rename v1046 reg22

->  rename v1047 reg23

->  rename v1048 reg24

->  rename v1049 reg25

->  rename v1050 reg26

->  rename v1051 reg27

->  rename v1052 reg28

->  rename v1053 reg29

->  rename v1054 reg30

->  rename v1055 reg31

->  rename v1056 reg32

->  rename v1057 reg33

->  rename v1058 reg34

->  rename v1059 reg35

->  rename v1060 reg36

->  rename v1061 reg37

->  rename v1062 reg38

->  rename v1063 reg39

->  rename v1064 reg40

->  rename v1065 reg41

->  rename v1066 reg42

->  rename v1067 reg43

->  rename v1068 reg44

->  rename v1069 reg45

->  rename v1070 reg46

->  rename v1071 reg47

->  rename v1072 reg48

->  rename v1073 reg49

->  rename v1074 reg50

->  rename v1075 reg51

->  rename v1076 reg52

->  rename v1077 reg53

->  rename v1078 reg54

->  rename v1079 reg55

->  rename v1080 reg56

->  rename v1081 reg57

->  rename v1082 reg58

->  rename v1083 reg59

->  rename v1084 reg60

->  rename v1085 reg61

->  rename v1086 reg62

->  rename v1087 reg63

->  rename v1088 reg64

->  rename v1089 reg65

->  rename v1090 reg66

->  rename v1091 reg67

->  rename v1092 reg68

->  rename v1093 reg69

->  rename v1094 reg70
{com}. **** self employed
. for X in num 1095/1147 \ Y in num 18/70: ///
> rename vX selfY

{res}->  rename v1095 self18

->  rename v1096 self19

->  rename v1097 self20

->  rename v1098 self21

->  rename v1099 self22

->  rename v1100 self23

->  rename v1101 self24

->  rename v1102 self25

->  rename v1103 self26

->  rename v1104 self27

->  rename v1105 self28

->  rename v1106 self29

->  rename v1107 self30

->  rename v1108 self31

->  rename v1109 self32

->  rename v1110 self33

->  rename v1111 self34

->  rename v1112 self35

->  rename v1113 self36

->  rename v1114 self37

->  rename v1115 self38

->  rename v1116 self39

->  rename v1117 self40

->  rename v1118 self41

->  rename v1119 self42

->  rename v1120 self43

->  rename v1121 self44

->  rename v1122 self45

->  rename v1123 self46

->  rename v1124 self47

->  rename v1125 self48

->  rename v1126 self49

->  rename v1127 self50

->  rename v1128 self51

->  rename v1129 self52

->  rename v1130 self53

->  rename v1131 self54

->  rename v1132 self55

->  rename v1133 self56

->  rename v1134 self57

->  rename v1135 self58

->  rename v1136 self59

->  rename v1137 self60

->  rename v1138 self61

->  rename v1139 self62

->  rename v1140 self63

->  rename v1141 self64

->  rename v1142 self65

->  rename v1143 self66

->  rename v1144 self67

->  rename v1145 self68

->  rename v1146 self69

->  rename v1147 self70
{com}. **** 内職
. for X in num 1148/1200 \ Y in num 18/70: ///
> rename vX sideY

{res}->  rename v1148 side18

->  rename v1149 side19

->  rename v1150 side20

->  rename v1151 side21

->  rename v1152 side22

->  rename v1153 side23

->  rename v1154 side24

->  rename v1155 side25

->  rename v1156 side26

->  rename v1157 side27

->  rename v1158 side28

->  rename v1159 side29

->  rename v1160 side30

->  rename v1161 side31

->  rename v1162 side32

->  rename v1163 side33

->  rename v1164 side34

->  rename v1165 side35

->  rename v1166 side36

->  rename v1167 side37

->  rename v1168 side38

->  rename v1169 side39

->  rename v1170 side40

->  rename v1171 side41

->  rename v1172 side42

->  rename v1173 side43

->  rename v1174 side44

->  rename v1175 side45

->  rename v1176 side46

->  rename v1177 side47

->  rename v1178 side48

->  rename v1179 side49

->  rename v1180 side50

->  rename v1181 side51

->  rename v1182 side52

->  rename v1183 side53

->  rename v1184 side54

->  rename v1185 side55

->  rename v1186 side56

->  rename v1187 side57

->  rename v1188 side58

->  rename v1189 side59

->  rename v1190 side60

->  rename v1191 side61

->  rename v1192 side62

->  rename v1193 side63

->  rename v1194 side64

->  rename v1195 side65

->  rename v1196 side66

->  rename v1197 side67

->  rename v1198 side68

->  rename v1199 side69

->  rename v1200 side70
{com}. **** family worker
. for X in num 1201/1253 \ Y in num 18/70: ///
> rename vX fmwY

{res}->  rename v1201 fmw18

->  rename v1202 fmw19

->  rename v1203 fmw20

->  rename v1204 fmw21

->  rename v1205 fmw22

->  rename v1206 fmw23

->  rename v1207 fmw24

->  rename v1208 fmw25

->  rename v1209 fmw26

->  rename v1210 fmw27

->  rename v1211 fmw28

->  rename v1212 fmw29

->  rename v1213 fmw30

->  rename v1214 fmw31

->  rename v1215 fmw32

->  rename v1216 fmw33

->  rename v1217 fmw34

->  rename v1218 fmw35

->  rename v1219 fmw36

->  rename v1220 fmw37

->  rename v1221 fmw38

->  rename v1222 fmw39

->  rename v1223 fmw40

->  rename v1224 fmw41

->  rename v1225 fmw42

->  rename v1226 fmw43

->  rename v1227 fmw44

->  rename v1228 fmw45

->  rename v1229 fmw46

->  rename v1230 fmw47

->  rename v1231 fmw48

->  rename v1232 fmw49

->  rename v1233 fmw50

->  rename v1234 fmw51

->  rename v1235 fmw52

->  rename v1236 fmw53

->  rename v1237 fmw54

->  rename v1238 fmw55

->  rename v1239 fmw56

->  rename v1240 fmw57

->  rename v1241 fmw58

->  rename v1242 fmw59

->  rename v1243 fmw60

->  rename v1244 fmw61

->  rename v1245 fmw62

->  rename v1246 fmw63

->  rename v1247 fmw64

->  rename v1248 fmw65

->  rename v1249 fmw66

->  rename v1250 fmw67

->  rename v1251 fmw68

->  rename v1252 fmw69

->  rename v1253 fmw70
{com}. * 世帯主ダミー作成
. ** 世帯主ですか
. replace head=0 if head!=2
{txt}(1,456 real changes made)
{com}. replace head=1 if head==2
{txt}(1,084 real changes made)
{com}. ** 主たる生計維持者
. replace earnmost=1 if earnmost==2|head==1&earnif==2
{txt}(1,016 real changes made)
{com}. replace earnmost=0 if earnmost!=1
{txt}(1,463 real changes made)
{com}. * 使わない変数を落とす
. drop earnif v*
. * idを+10000
. replace id=id+10000
{txt}(2,540 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2010_sp.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2010_sp.dta saved
{com}. 
. ** 本人と配偶者サンプルをバインド
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2010_pr.dta", clear
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2010_sp.dta"
. gen year=2010
. * ageを作成
. mvdecode byear, mv(9999)
       {txt}byear:{res}{col 15}2{txt} missing values generated
{com}. mvdecode bmonth, mv(99)
      {txt}bmonth:{res}{col 15}4{txt} missing values generated
{com}. replace byear=2020 if byear==.
{txt}(2 real changes made)
{com}. replace bmonth=0 if bmonth==.
{txt}(4 real changes made)
{com}. replace bmonth=bmonth+10
{txt}(6,010 real changes made)
{com}. tostring byear bmonth, replace
{txt}byear was {res:int} now {res:str4}
bmonth was {res:byte} now {res:str2}
{com}. gen bday=byear+bmonth+"15"
. destring bday, replace
{txt}bday: all characters numeric; {res}replaced {txt}as {res}long
{com}. replace bday=bday-1000
{txt}(6,010 real changes made)
{com}. gen age=round((20100130-bday)/10000)
. replace age=. if age<0
{txt}(2 real changes made, 2 to missing)
{com}. drop byear bmonth bday
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2010.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2010.dta saved
{com}. 
. * cohort dummy
. keep id
. gen cohort=9
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta"
. duplicates drop id, force

{p 0 4}{txt}Duplicates in terms of {res} id{p_end}

{txt}(5,982 observations deleted)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta saved
{com}. {c )-}
. 
. ** JHPS2011
. {c -(}
. * 変数名の変更
. ** 本人
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\JHPS2011.csv", clear 
{res}{text}(684 vars, 3,160 obs)
{com}. rename (v1 v4 v5 v6 v7 v101 v102 v103 v169 ///
> v176 v177 v178 v179 v182 v183 ///
> v219 v190 ///
> v192 v193 v194 v195 v196 v197 ///
> v199 v200 v201) ///
> (id marital sex byear bmonth head earnif earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 世帯主ダミー作成
. ** 世帯主ですか
. replace head=0 if head!=1
{txt}(1,507 real changes made)
{com}. ** 主たる生計維持者
. replace earnmost=1 if head==1&earnif==2
{txt}(1,473 real changes made)
{com}. replace earnmost=0 if earnmost!=1
{txt}(1,560 real changes made)
{com}. * 使わない変数を落とす
. drop earnif v*
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2011_pr.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2011_pr.dta saved
{com}. 
. ** 配偶者
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\JHPS2011.csv", clear 
{res}{text}(684 vars, 3,160 obs)
{com}. rename (v1 v4  v12 v13 v14 v101 v102 v103 v382 ///
> v389 v390 v391 v392 v395 v396 ///
> v432 v403 ///
> v405 v406 v407 v408 v409 v410 ///
> v412 v413 v414) ///
> (id marital sex byear bmonth head earnif earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 続柄が配偶者のサンプルのみ残す
. keep if marital==1
{txt}(823 observations deleted)
{com}. * 世帯主ダミー作成
. * 世帯主ダミー作成
. ** 世帯主ですか
. replace head=0 if head!=2
{txt}(1,366 real changes made)
{com}. replace head=1 if head==2
{txt}(971 real changes made)
{com}. ** 主たる生計維持者
. replace earnmost=1 if earnmost==2|head==1&earnif==2
{txt}(910 real changes made)
{com}. replace earnmost=0 if earnmost!=1
{txt}(1,367 real changes made)
{com}. * 使わない変数を落とす
. drop earnif v*
. * idを+10000
. replace id=id+10000
{txt}(2,337 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2011_sp.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2011_sp.dta saved
{com}. 
. ** 本人と配偶者サンプルをバインド
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2011_pr.dta", clear
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2011_sp.dta"
. gen year=2011
. * ageを作成
. mvdecode byear, mv(9999)
       {txt}byear:{res}{col 15}1{txt} missing value generated
{com}. mvdecode bmonth, mv(99)
      {txt}bmonth:{res}{col 15}3{txt} missing values generated
{com}. replace byear=2020 if byear==.
{txt}(1 real change made)
{com}. replace bmonth=0 if bmonth==.
{txt}(3 real changes made)
{com}. replace bmonth=bmonth+10
{txt}(5,497 real changes made)
{com}. tostring byear bmonth, replace
{txt}byear was {res:int} now {res:str4}
bmonth was {res:byte} now {res:str2}
{com}. gen bday=byear+bmonth+"15"
. destring bday, replace
{txt}bday: all characters numeric; {res}replaced {txt}as {res}long
{com}. replace bday=bday-1000
{txt}(5,497 real changes made)
{com}. gen age=round((20110130-bday)/10000)
. replace age=. if age<0
{txt}(1 real change made, 1 to missing)
{com}. drop byear bmonth bday
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2011.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2011.dta saved
{com}. 
. * cohort dummy
. keep id
. gen cohort=9
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta"
. duplicates drop id, force

{p 0 4}{txt}Duplicates in terms of {res} id{p_end}

{txt}(5,471 observations deleted)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta saved
{com}. {c )-}
. 
. ** JHPS2012
. {c -(}
. * 変数名の変更
. ** 本人
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\JHPS2012.csv", clear 
{res}{text}(762 vars, 2,821 obs)
{com}. rename (v1 v4 v5 v6 v7 v101 v102 v103 v190 ///
> v197 v198 v199 v200 v203 v204 ///
> v240 v211 ///
> v213 v214 v215 v216 v217 v218 ///
> v220 v221 v222) ///
> (id marital sex byear bmonth head earnif earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 世帯主ダミー作成
. ** 世帯主ですか
. replace head=0 if head!=1
{txt}(1,307 real changes made)
{com}. ** 主たる生計維持者
. replace earnmost=1 if head==1&earnif==2
{txt}(1,329 real changes made)
{com}. replace earnmost=0 if earnmost!=1
{txt}(1,398 real changes made)
{com}. * 使わない変数を落とす
. drop earnif v*
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2012_pr.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2012_pr.dta saved
{com}. 
. ** 配偶者
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\JHPS2012.csv", clear 
{res}{text}(762 vars, 2,821 obs)
{com}. rename (v1 v4  v12 v13 v14 v101 v102 v103 v420 ///
> v427 v428 v429 v430 v433 v434 ///
> v470 v441 ///
> v443 v444 v445 v446 v447 v448 ///
> v450 v451 v452) ///
> (id marital sex byear bmonth head earnif earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 続柄が配偶者のサンプルのみ残す
. keep if marital==1
{txt}(739 observations deleted)
{com}. * 世帯主ダミー作成
. ** 世帯主ですか
. replace head=0 if head!=2
{txt}(1,223 real changes made)
{com}. replace head=1 if head==2
{txt}(859 real changes made)
{com}. ** 主たる生計維持者
. replace earnmost=1 if earnmost==2|head==1&earnif==2
{txt}(834 real changes made)
{com}. replace earnmost=0 if earnmost!=1
{txt}(1,208 real changes made)
{com}. * 使わない変数を落とす
. drop earnif v*
. * idを+10000
. replace id=id+10000
{txt}(2,082 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2012_sp.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2012_sp.dta saved
{com}. 
. ** 本人と配偶者サンプルをバインド
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2012_pr.dta", clear
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2012_sp.dta"
. gen year=2012
. * ageを作成
. mvdecode byear, mv(9999)
. mvdecode bmonth, mv(99)
      {txt}bmonth:{res}{col 15}1{txt} missing value generated
{com}. replace byear=2020 if byear==.
{txt}(0 real changes made)
{com}. replace bmonth=0 if bmonth==.
{txt}(1 real change made)
{com}. replace bmonth=bmonth+10
{txt}(4,903 real changes made)
{com}. tostring byear bmonth, replace
{txt}byear was {res:int} now {res:str4}
bmonth was {res:byte} now {res:str2}
{com}. gen bday=byear+bmonth+"15"
. destring bday, replace
{txt}bday: all characters numeric; {res}replaced {txt}as {res}long
{com}. replace bday=bday-1000
{txt}(4,903 real changes made)
{com}. gen age=round((20120130-bday)/10000)
. replace age=. if age<0
{txt}(0 real changes made)
{com}. drop byear bmonth bday
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2012.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2012.dta saved
{com}. 
. * cohort dummy
. keep id
. gen cohort=9
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta"
. duplicates drop id, force

{p 0 4}{txt}Duplicates in terms of {res} id{p_end}

{txt}(4,882 observations deleted)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta saved
{com}. {c )-}
. 
. ** JHPS2013
. {c -(}
. * 変数名の変更
. ** 本人
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\JHPS2013.csv", clear 
{res}{text}(803 vars, 2,581 obs)
{com}. rename (v1 v4 v5 v6 v7 v101 v102 v103 v184 ///
> v191 v192 v193 v194 v197 v198 ///
> v234 v205 ///
> v207 v208 v209 v210 v211 v212 ///
> v214 v215 v216) ///
> (id marital sex byear bmonth head earnif earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 世帯主ダミー作成
. ** 世帯主ですか
. replace head=0 if head!=1
{txt}(1,190 real changes made)
{com}. ** 主たる生計維持者
. replace earnmost=1 if head==1&earnif==2
{txt}(1,246 real changes made)
{com}. replace earnmost=0 if earnmost!=1
{txt}(1,236 real changes made)
{com}. * 使わない変数を落とす
. drop earnif v*
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2013_pr.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2013_pr.dta saved
{com}. 
. ** 配偶者
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\JHPS2013.csv", clear 
{res}{text}(803 vars, 2,581 obs)
{com}. rename (v1 v4  v12 v13 v14 v101 v102 v103 v449 ///
> v456 v457 v458 v459 v462 v463 ///
> v499 v470 ///
> v472 v473 v474 v475 v476 v477 ///
> v479 v480 v481) ///
> (id marital sex byear bmonth head earnif earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 続柄が配偶者のサンプルのみ残す
. keep if marital==1
{txt}(663 observations deleted)
{com}. * 世帯主ダミー作成
. * 世帯主ダミー作成
. ** 世帯主ですか
. replace head=0 if head!=2
{txt}(1,103 real changes made)
{com}. replace head=1 if head==2
{txt}(815 real changes made)
{com}. ** 主たる生計維持者
. replace earnmost=1 if earnmost==2|head==1&earnif==2
{txt}(770 real changes made)
{com}. replace earnmost=0 if earnmost!=1
{txt}(1,106 real changes made)
{com}. * 使わない変数を落とす
. drop earnif v*
. * idを+10000
. replace id=id+10000
{txt}(1,918 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2013_sp.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2013_sp.dta saved
{com}. 
. ** 本人と配偶者サンプルをバインド
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2013_pr.dta", clear
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2013_sp.dta"
. gen year=2013
. * ageを作成
. mvdecode byear, mv(9999)
. mvdecode bmonth, mv(99)
      {txt}bmonth:{res}{col 15}1{txt} missing value generated
{com}. replace byear=2020 if byear==.
{txt}(0 real changes made)
{com}. replace bmonth=0 if bmonth==. 
{txt}(1 real change made)
{com}. replace bmonth=bmonth+10
{txt}(4,499 real changes made)
{com}. tostring byear bmonth, replace
{txt}byear was {res:int} now {res:str4}
bmonth was {res:byte} now {res:str2}
{com}. gen bday=byear+bmonth+"15"
. destring bday, replace
{txt}bday: all characters numeric; {res}replaced {txt}as {res}long
{com}. replace bday=bday-1000
{txt}(4,499 real changes made)
{com}. gen age=round((20130130-bday)/10000)
. replace age=. if age<0
{txt}(0 real changes made)
{com}. drop byear bmonth bday
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2013.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2013.dta saved
{com}. 
. * cohort dummy
. keep id
. gen cohort=9
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta"
. duplicates drop id, force

{p 0 4}{txt}Duplicates in terms of {res} id{p_end}

{txt}(4,482 observations deleted)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta saved
{com}. {c )-}
. 
. ** JHPS2014
. {c -(}
. * 変数名の変更
. ** 本人
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\JHPS2014.csv", clear 
{res}{text}(957 vars, 2,358 obs)
{com}. rename (v1 v4 v5 v6 v7 v101 v102 v103 v220 ///
> v227 v228 v229 v230 v233 v234 ///
> v265 v242 ///
> v244 v245 v246 v247 v248 v249 ///
> v251 v252 v253) ///
> (id marital sex byear bmonth head earnif earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 世帯主ダミー作成
. ** 世帯主ですか
. replace head=0 if head!=1
{txt}(1,053 real changes made)
{com}. ** 主たる生計維持者
. replace earnmost=1 if head==1&earnif==2
{txt}(1,154 real changes made)
{com}. replace earnmost=0 if earnmost!=1
{txt}(1,124 real changes made)
{com}. * 使わない変数を落とす
. drop earnif v*
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2014_pr.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2014_pr.dta saved
{com}. 
. ** 配偶者
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\JHPS2014.csv", clear 
{res}{text}(957 vars, 2,358 obs)
{com}. rename (v1 v4  v12 v13 v14 v101 v102 v103 v498 ///
> v505 v506 v507 v508 v511 v512 ///
> v543 v520 ///
> v522 v523 v524 v525 v526 v527 ///
> v529 v530 v531) ///
> (id marital sex byear bmonth head earnif earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 続柄が配偶者のサンプルのみ残す
. keep if marital==1
{txt}(587 observations deleted)
{com}. * 世帯主ダミー作成
. * 世帯主ダミー作成
. ** 世帯主ですか
. replace head=0 if head!=2
{txt}(1,026 real changes made)
{com}. replace head=1 if head==2
{txt}(745 real changes made)
{com}. ** 主たる生計維持者
. replace earnmost=1 if earnmost==2|head==1&earnif==2
{txt}(704 real changes made)
{com}. replace earnmost=0 if earnmost!=1
{txt}(1,022 real changes made)
{com}. * 使わない変数を落とす
. drop earnif v*
. * idを+10000
. replace id=id+10000
{txt}(1,771 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2014_sp.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2014_sp.dta saved
{com}. 
. ** 本人と配偶者サンプルをバインド
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2014_pr.dta", clear
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2014_sp.dta"
. gen year=2014
. * ageを作成
. mvdecode byear, mv(9999)
. mvdecode bmonth, mv(99)
      {txt}bmonth:{res}{col 15}1{txt} missing value generated
{com}. replace byear=2020 if byear==.
{txt}(0 real changes made)
{com}. replace bmonth=0 if bmonth==.
{txt}(1 real change made)
{com}. replace bmonth=bmonth+10
{txt}(4,129 real changes made)
{com}. tostring byear bmonth, replace
{txt}byear was {res:int} now {res:str4}
bmonth was {res:byte} now {res:str2}
{com}. gen bday=byear+bmonth+"15"
. destring bday, replace
{txt}bday: all characters numeric; {res}replaced {txt}as {res}long
{com}. replace bday=bday-1000
{txt}(4,129 real changes made)
{com}. gen age=round((20140130-bday)/10000)
. replace age=. if age<0
{txt}(0 real changes made)
{com}. drop byear bmonth bday
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2014.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2014.dta saved
{com}. 
. * cohort dummy
. keep id
. gen cohort=9
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta"
. duplicates drop id, force

{p 0 4}{txt}Duplicates in terms of {res} id{p_end}

{txt}(4,110 observations deleted)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta saved
{com}. {c )-}
. 
. ** KHPS2004
. {c -(}
. * 変数名の変更
. ** 本人
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\KHPS2004.csv", clear 
{res}{text}(1,981 vars, 4,005 obs)
{com}. rename (v1 v4 v5 v6 v7 v76 v106 v170 ///
> v228 v215 v216 v217 v218 v219 ///
> v238 v239 v240 ///
> v244 v245 v246 v247 v248 v249 ///
> v262 v263 v264) ///
> (id marital sex byear bmonth earnmost edbg workstatus ///
> occ owner ind size employed regular ///
> empsinceyear empsincemonth union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. *** 就業履歴データの変数名変更
. **** temporal employee
. for X in num 419/469 \ Y in num 18/68: ///
> rename vX casY

{res}->  rename v419 cas18

->  rename v420 cas19

->  rename v421 cas20

->  rename v422 cas21

->  rename v423 cas22

->  rename v424 cas23

->  rename v425 cas24

->  rename v426 cas25

->  rename v427 cas26

->  rename v428 cas27

->  rename v429 cas28

->  rename v430 cas29

->  rename v431 cas30

->  rename v432 cas31

->  rename v433 cas32

->  rename v434 cas33

->  rename v435 cas34

->  rename v436 cas35

->  rename v437 cas36

->  rename v438 cas37

->  rename v439 cas38

->  rename v440 cas39

->  rename v441 cas40

->  rename v442 cas41

->  rename v443 cas42

->  rename v444 cas43

->  rename v445 cas44

->  rename v446 cas45

->  rename v447 cas46

->  rename v448 cas47

->  rename v449 cas48

->  rename v450 cas49

->  rename v451 cas50

->  rename v452 cas51

->  rename v453 cas52

->  rename v454 cas53

->  rename v455 cas54

->  rename v456 cas55

->  rename v457 cas56

->  rename v458 cas57

->  rename v459 cas58

->  rename v460 cas59

->  rename v461 cas60

->  rename v462 cas61

->  rename v463 cas62

->  rename v464 cas63

->  rename v465 cas64

->  rename v466 cas65

->  rename v467 cas66

->  rename v468 cas67

->  rename v469 cas68
{com}. **** regular employee
. for X in num 470/520 \ Y in num 18/68: ///
> rename vX regY

{res}->  rename v470 reg18

->  rename v471 reg19

->  rename v472 reg20

->  rename v473 reg21

->  rename v474 reg22

->  rename v475 reg23

->  rename v476 reg24

->  rename v477 reg25

->  rename v478 reg26

->  rename v479 reg27

->  rename v480 reg28

->  rename v481 reg29

->  rename v482 reg30

->  rename v483 reg31

->  rename v484 reg32

->  rename v485 reg33

->  rename v486 reg34

->  rename v487 reg35

->  rename v488 reg36

->  rename v489 reg37

->  rename v490 reg38

->  rename v491 reg39

->  rename v492 reg40

->  rename v493 reg41

->  rename v494 reg42

->  rename v495 reg43

->  rename v496 reg44

->  rename v497 reg45

->  rename v498 reg46

->  rename v499 reg47

->  rename v500 reg48

->  rename v501 reg49

->  rename v502 reg50

->  rename v503 reg51

->  rename v504 reg52

->  rename v505 reg53

->  rename v506 reg54

->  rename v507 reg55

->  rename v508 reg56

->  rename v509 reg57

->  rename v510 reg58

->  rename v511 reg59

->  rename v512 reg60

->  rename v513 reg61

->  rename v514 reg62

->  rename v515 reg63

->  rename v516 reg64

->  rename v517 reg65

->  rename v518 reg66

->  rename v519 reg67

->  rename v520 reg68
{com}. **** self employed
. for X in num 521/571 \ Y in num 18/68: ///
> rename vX selfY

{res}->  rename v521 self18

->  rename v522 self19

->  rename v523 self20

->  rename v524 self21

->  rename v525 self22

->  rename v526 self23

->  rename v527 self24

->  rename v528 self25

->  rename v529 self26

->  rename v530 self27

->  rename v531 self28

->  rename v532 self29

->  rename v533 self30

->  rename v534 self31

->  rename v535 self32

->  rename v536 self33

->  rename v537 self34

->  rename v538 self35

->  rename v539 self36

->  rename v540 self37

->  rename v541 self38

->  rename v542 self39

->  rename v543 self40

->  rename v544 self41

->  rename v545 self42

->  rename v546 self43

->  rename v547 self44

->  rename v548 self45

->  rename v549 self46

->  rename v550 self47

->  rename v551 self48

->  rename v552 self49

->  rename v553 self50

->  rename v554 self51

->  rename v555 self52

->  rename v556 self53

->  rename v557 self54

->  rename v558 self55

->  rename v559 self56

->  rename v560 self57

->  rename v561 self58

->  rename v562 self59

->  rename v563 self60

->  rename v564 self61

->  rename v565 self62

->  rename v566 self63

->  rename v567 self64

->  rename v568 self65

->  rename v569 self66

->  rename v570 self67

->  rename v571 self68
{com}. **** 内職
. for X in num 572/622 \ Y in num 18/68: ///
> rename vX sideY

{res}->  rename v572 side18

->  rename v573 side19

->  rename v574 side20

->  rename v575 side21

->  rename v576 side22

->  rename v577 side23

->  rename v578 side24

->  rename v579 side25

->  rename v580 side26

->  rename v581 side27

->  rename v582 side28

->  rename v583 side29

->  rename v584 side30

->  rename v585 side31

->  rename v586 side32

->  rename v587 side33

->  rename v588 side34

->  rename v589 side35

->  rename v590 side36

->  rename v591 side37

->  rename v592 side38

->  rename v593 side39

->  rename v594 side40

->  rename v595 side41

->  rename v596 side42

->  rename v597 side43

->  rename v598 side44

->  rename v599 side45

->  rename v600 side46

->  rename v601 side47

->  rename v602 side48

->  rename v603 side49

->  rename v604 side50

->  rename v605 side51

->  rename v606 side52

->  rename v607 side53

->  rename v608 side54

->  rename v609 side55

->  rename v610 side56

->  rename v611 side57

->  rename v612 side58

->  rename v613 side59

->  rename v614 side60

->  rename v615 side61

->  rename v616 side62

->  rename v617 side63

->  rename v618 side64

->  rename v619 side65

->  rename v620 side66

->  rename v621 side67

->  rename v622 side68
{com}. **** family worker
. for X in num 623/673 \ Y in num 18/68: ///
> rename vX fmwY

{res}->  rename v623 fmw18

->  rename v624 fmw19

->  rename v625 fmw20

->  rename v626 fmw21

->  rename v627 fmw22

->  rename v628 fmw23

->  rename v629 fmw24

->  rename v630 fmw25

->  rename v631 fmw26

->  rename v632 fmw27

->  rename v633 fmw28

->  rename v634 fmw29

->  rename v635 fmw30

->  rename v636 fmw31

->  rename v637 fmw32

->  rename v638 fmw33

->  rename v639 fmw34

->  rename v640 fmw35

->  rename v641 fmw36

->  rename v642 fmw37

->  rename v643 fmw38

->  rename v644 fmw39

->  rename v645 fmw40

->  rename v646 fmw41

->  rename v647 fmw42

->  rename v648 fmw43

->  rename v649 fmw44

->  rename v650 fmw45

->  rename v651 fmw46

->  rename v652 fmw47

->  rename v653 fmw48

->  rename v654 fmw49

->  rename v655 fmw50

->  rename v656 fmw51

->  rename v657 fmw52

->  rename v658 fmw53

->  rename v659 fmw54

->  rename v660 fmw55

->  rename v661 fmw56

->  rename v662 fmw57

->  rename v663 fmw58

->  rename v664 fmw59

->  rename v665 fmw60

->  rename v666 fmw61

->  rename v667 fmw62

->  rename v668 fmw63

->  rename v669 fmw64

->  rename v670 fmw65

->  rename v671 fmw66

->  rename v672 fmw67

->  rename v673 fmw68
{com}. ** 主たる生計維持者
. replace earnmost=0 if earnmost!=1
{txt}(1,978 real changes made)
{com}. * 世帯主ダミー作成
. ** 世帯主ですか (*) only 主たる生計維持者 asked in this survey
. gen head=earnmost
. * switch dummy
. gen switch=0
. * 使わない変数を落とす
. drop v*
. * idを+20000
. replace id=id+20000
{txt}(4,005 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2004_pr.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2004_pr.dta saved
{com}. 
. ** 配偶者
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\KHPS2004.csv", clear 
{res}{text}(1,981 vars, 4,005 obs)
{com}. rename (v1 v4 v76 v803 v867 ///
> v925 v912 v913 v914 v915 v916 ///
> v935 v936 v937 ///
> v941 v942 v943 v944 v945 v946 ///
> v959 v960 v961) ///
> (id marital earnmost edbg workstatus ///
> occ owner ind size employed regular ///
> empsinceyear empsincemonth union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 続柄が配偶者のサンプルのみ残す
. keep if marital==1
{txt}(1,086 observations deleted)
{com}. * 続柄の変数名変更->配偶者の情報を抽出
. rename (v13 v14 v15 v16 ///
> v20 v21 v22 v23 ///
> v27 v28 v29 v30 ///
> v34 v35 v36 v37 ///
> v41 v42 v43 v44 ///
> v48 v49 v50 v51 ///
> v55 v56 v57 v58 ///
> v62 v63 v64 v65 ///
> v69 v70 v71 v72) ///
> (rel1no rel1sex rel1byear rel1bmonth ///
> rel2no rel2sex rel2byear rel2bmonth ///
> rel3no rel3sex rel3byear rel3bmonth ///
> rel4no rel4sex rel4byear rel4bmonth ///
> rel5no rel5sex rel5byear rel5bmonth ///
> rel6no rel6sex rel6byear rel6bmonth ///
> rel7no rel7sex rel7byear rel7bmonth ///
> rel8no rel8sex rel8byear rel8bmonth ///
> rel9no rel9sex rel9byear rel9bmonth)
{res}{com}. ** relation No. of spouse
. gen relno=0
. for num 1/9: replace relno=X+1 if relXno==1

{res}->  replace relno=1+1 if rel1no==1
{txt}(2,851 real changes made)

{res}->  replace relno=2+1 if rel2no==1
{txt}(23 real changes made)

{res}->  replace relno=3+1 if rel3no==1
{txt}(31 real changes made)

{res}->  replace relno=4+1 if rel4no==1
{txt}(10 real changes made)

{res}->  replace relno=5+1 if rel5no==1
{txt}(0 real changes made)

{res}->  replace relno=6+1 if rel6no==1
{txt}(1 real change made)

{res}->  replace relno=7+1 if rel7no==1
{txt}(0 real changes made)

{res}->  replace relno=8+1 if rel8no==1
{txt}(0 real changes made)

{res}->  replace relno=9+1 if rel9no==1
{txt}(0 real changes made)
{com}. ** sex
. gen sex=0
. for num 1/9: replace sex=relXsex if relXno==1

{res}->  replace sex=rel1sex if rel1no==1
{txt}(2,851 real changes made)

{res}->  replace sex=rel2sex if rel2no==1
{txt}(23 real changes made)

{res}->  replace sex=rel3sex if rel3no==1
{txt}(31 real changes made)

{res}->  replace sex=rel4sex if rel4no==1
{txt}(10 real changes made)

{res}->  replace sex=rel5sex if rel5no==1
{txt}(0 real changes made)

{res}->  replace sex=rel6sex if rel6no==1
{txt}(1 real change made)

{res}->  replace sex=rel7sex if rel7no==1
{txt}(0 real changes made)

{res}->  replace sex=rel8sex if rel8no==1
{txt}(0 real changes made)

{res}->  replace sex=rel9sex if rel9no==1
{txt}(0 real changes made)
{com}. ** byear
. gen byear=0
. for num 1/9: replace byear=relXbyear if relXno==1

{res}->  replace byear=rel1byear if rel1no==1
{txt}(2,851 real changes made)

{res}->  replace byear=rel2byear if rel2no==1
{txt}(23 real changes made)

{res}->  replace byear=rel3byear if rel3no==1
{txt}(31 real changes made)

{res}->  replace byear=rel4byear if rel4no==1
{txt}(10 real changes made)

{res}->  replace byear=rel5byear if rel5no==1
{txt}(0 real changes made)

{res}->  replace byear=rel6byear if rel6no==1
{txt}(1 real change made)

{res}->  replace byear=rel7byear if rel7no==1
{txt}(0 real changes made)

{res}->  replace byear=rel8byear if rel8no==1
{txt}(0 real changes made)

{res}->  replace byear=rel9byear if rel9no==1
{txt}(0 real changes made)
{com}. ** bmonth
. gen bmonth=0
. for num 1/9: replace bmonth=relXbmonth if relXno==1

{res}->  replace bmonth=rel1bmonth if rel1no==1
{txt}(2,847 real changes made)

{res}->  replace bmonth=rel2bmonth if rel2no==1
{txt}(23 real changes made)

{res}->  replace bmonth=rel3bmonth if rel3no==1
{txt}(31 real changes made)

{res}->  replace bmonth=rel4bmonth if rel4no==1
{txt}(10 real changes made)

{res}->  replace bmonth=rel5bmonth if rel5no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel6bmonth if rel6no==1
{txt}(1 real change made)

{res}->  replace bmonth=rel7bmonth if rel7no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel8bmonth if rel8no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel9bmonth if rel9no==1
{txt}(0 real changes made)
{com}. * 配偶者情報がないサンプルを落とす
. drop if relno==0
{txt}(3 observations deleted)
{com}. *** 就業履歴データの変数名変更
. **** temporal employee
. for X in num 1116/1166 \ Y in num 18/68: ///
> rename vX casY

{res}->  rename v1116 cas18

->  rename v1117 cas19

->  rename v1118 cas20

->  rename v1119 cas21

->  rename v1120 cas22

->  rename v1121 cas23

->  rename v1122 cas24

->  rename v1123 cas25

->  rename v1124 cas26

->  rename v1125 cas27

->  rename v1126 cas28

->  rename v1127 cas29

->  rename v1128 cas30

->  rename v1129 cas31

->  rename v1130 cas32

->  rename v1131 cas33

->  rename v1132 cas34

->  rename v1133 cas35

->  rename v1134 cas36

->  rename v1135 cas37

->  rename v1136 cas38

->  rename v1137 cas39

->  rename v1138 cas40

->  rename v1139 cas41

->  rename v1140 cas42

->  rename v1141 cas43

->  rename v1142 cas44

->  rename v1143 cas45

->  rename v1144 cas46

->  rename v1145 cas47

->  rename v1146 cas48

->  rename v1147 cas49

->  rename v1148 cas50

->  rename v1149 cas51

->  rename v1150 cas52

->  rename v1151 cas53

->  rename v1152 cas54

->  rename v1153 cas55

->  rename v1154 cas56

->  rename v1155 cas57

->  rename v1156 cas58

->  rename v1157 cas59

->  rename v1158 cas60

->  rename v1159 cas61

->  rename v1160 cas62

->  rename v1161 cas63

->  rename v1162 cas64

->  rename v1163 cas65

->  rename v1164 cas66

->  rename v1165 cas67

->  rename v1166 cas68
{com}. **** regular employee
. for X in num 1167/1217 \ Y in num 18/68: ///
> rename vX regY

{res}->  rename v1167 reg18

->  rename v1168 reg19

->  rename v1169 reg20

->  rename v1170 reg21

->  rename v1171 reg22

->  rename v1172 reg23

->  rename v1173 reg24

->  rename v1174 reg25

->  rename v1175 reg26

->  rename v1176 reg27

->  rename v1177 reg28

->  rename v1178 reg29

->  rename v1179 reg30

->  rename v1180 reg31

->  rename v1181 reg32

->  rename v1182 reg33

->  rename v1183 reg34

->  rename v1184 reg35

->  rename v1185 reg36

->  rename v1186 reg37

->  rename v1187 reg38

->  rename v1188 reg39

->  rename v1189 reg40

->  rename v1190 reg41

->  rename v1191 reg42

->  rename v1192 reg43

->  rename v1193 reg44

->  rename v1194 reg45

->  rename v1195 reg46

->  rename v1196 reg47

->  rename v1197 reg48

->  rename v1198 reg49

->  rename v1199 reg50

->  rename v1200 reg51

->  rename v1201 reg52

->  rename v1202 reg53

->  rename v1203 reg54

->  rename v1204 reg55

->  rename v1205 reg56

->  rename v1206 reg57

->  rename v1207 reg58

->  rename v1208 reg59

->  rename v1209 reg60

->  rename v1210 reg61

->  rename v1211 reg62

->  rename v1212 reg63

->  rename v1213 reg64

->  rename v1214 reg65

->  rename v1215 reg66

->  rename v1216 reg67

->  rename v1217 reg68
{com}. **** self employed
. for X in num 1218/1268 \ Y in num 18/68: ///
> rename vX selfY

{res}->  rename v1218 self18

->  rename v1219 self19

->  rename v1220 self20

->  rename v1221 self21

->  rename v1222 self22

->  rename v1223 self23

->  rename v1224 self24

->  rename v1225 self25

->  rename v1226 self26

->  rename v1227 self27

->  rename v1228 self28

->  rename v1229 self29

->  rename v1230 self30

->  rename v1231 self31

->  rename v1232 self32

->  rename v1233 self33

->  rename v1234 self34

->  rename v1235 self35

->  rename v1236 self36

->  rename v1237 self37

->  rename v1238 self38

->  rename v1239 self39

->  rename v1240 self40

->  rename v1241 self41

->  rename v1242 self42

->  rename v1243 self43

->  rename v1244 self44

->  rename v1245 self45

->  rename v1246 self46

->  rename v1247 self47

->  rename v1248 self48

->  rename v1249 self49

->  rename v1250 self50

->  rename v1251 self51

->  rename v1252 self52

->  rename v1253 self53

->  rename v1254 self54

->  rename v1255 self55

->  rename v1256 self56

->  rename v1257 self57

->  rename v1258 self58

->  rename v1259 self59

->  rename v1260 self60

->  rename v1261 self61

->  rename v1262 self62

->  rename v1263 self63

->  rename v1264 self64

->  rename v1265 self65

->  rename v1266 self66

->  rename v1267 self67

->  rename v1268 self68
{com}. **** 内職
. for X in num 1269/1319 \ Y in num 18/68: ///
> rename vX sideY

{res}->  rename v1269 side18

->  rename v1270 side19

->  rename v1271 side20

->  rename v1272 side21

->  rename v1273 side22

->  rename v1274 side23

->  rename v1275 side24

->  rename v1276 side25

->  rename v1277 side26

->  rename v1278 side27

->  rename v1279 side28

->  rename v1280 side29

->  rename v1281 side30

->  rename v1282 side31

->  rename v1283 side32

->  rename v1284 side33

->  rename v1285 side34

->  rename v1286 side35

->  rename v1287 side36

->  rename v1288 side37

->  rename v1289 side38

->  rename v1290 side39

->  rename v1291 side40

->  rename v1292 side41

->  rename v1293 side42

->  rename v1294 side43

->  rename v1295 side44

->  rename v1296 side45

->  rename v1297 side46

->  rename v1298 side47

->  rename v1299 side48

->  rename v1300 side49

->  rename v1301 side50

->  rename v1302 side51

->  rename v1303 side52

->  rename v1304 side53

->  rename v1305 side54

->  rename v1306 side55

->  rename v1307 side56

->  rename v1308 side57

->  rename v1309 side58

->  rename v1310 side59

->  rename v1311 side60

->  rename v1312 side61

->  rename v1313 side62

->  rename v1314 side63

->  rename v1315 side64

->  rename v1316 side65

->  rename v1317 side66

->  rename v1318 side67

->  rename v1319 side68
{com}. **** family worker
. for X in num 1320/1370 \ Y in num 18/68: ///
> rename vX fmwY

{res}->  rename v1320 fmw18

->  rename v1321 fmw19

->  rename v1322 fmw20

->  rename v1323 fmw21

->  rename v1324 fmw22

->  rename v1325 fmw23

->  rename v1326 fmw24

->  rename v1327 fmw25

->  rename v1328 fmw26

->  rename v1329 fmw27

->  rename v1330 fmw28

->  rename v1331 fmw29

->  rename v1332 fmw30

->  rename v1333 fmw31

->  rename v1334 fmw32

->  rename v1335 fmw33

->  rename v1336 fmw34

->  rename v1337 fmw35

->  rename v1338 fmw36

->  rename v1339 fmw37

->  rename v1340 fmw38

->  rename v1341 fmw39

->  rename v1342 fmw40

->  rename v1343 fmw41

->  rename v1344 fmw42

->  rename v1345 fmw43

->  rename v1346 fmw44

->  rename v1347 fmw45

->  rename v1348 fmw46

->  rename v1349 fmw47

->  rename v1350 fmw48

->  rename v1351 fmw49

->  rename v1352 fmw50

->  rename v1353 fmw51

->  rename v1354 fmw52

->  rename v1355 fmw53

->  rename v1356 fmw54

->  rename v1357 fmw55

->  rename v1358 fmw56

->  rename v1359 fmw57

->  rename v1360 fmw58

->  rename v1361 fmw59

->  rename v1362 fmw60

->  rename v1363 fmw61

->  rename v1364 fmw62

->  rename v1365 fmw63

->  rename v1366 fmw64

->  rename v1367 fmw65

->  rename v1368 fmw66

->  rename v1369 fmw67

->  rename v1370 fmw68
{com}. ** 主たる生計維持者
. replace earnmost=100 if earnmost==relno
{txt}(1,275 real changes made)
{com}. replace earnmost=0 if earnmost!=100
{txt}(1,641 real changes made)
{com}. replace earnmost=1 if earnmost==100
{txt}(1,275 real changes made)
{com}. * 世帯主ダミー作成
. ** 世帯主ですか (*) only 主たる生計維持者 asked in this survey
. gen head=earnmost
. * switch dummy
. gen switch=0
. * 使わない変数を落とす
. drop v* rel*
. * idを+30000
. replace id=id+30000
{txt}variable {bf}id{sf} was {bf}{res}int{sf}{txt} now {bf}{res}long{sf}
{txt}(2,916 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2004_sp.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2004_sp.dta saved
{com}. 
. ** 本人と配偶者サンプルをバインド
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2004_pr.dta", clear
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2004_sp.dta"
{txt}{p 0 7 2}
(note: variable
id was 
int, now long to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
sex was 
byte, now float to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
byear was 
int, now float to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
bmonth was 
byte, now float to accommodate using data's values)
{p_end}
{com}. gen year=2004
. * ageを作成
. mvdecode byear, mv(9999)
       {txt}byear:{res}{col 15}16{txt} missing values generated
{com}. mvdecode bmonth, mv(99)
      {txt}bmonth:{res}{col 15}16{txt} missing values generated
{com}. replace byear=2020 if byear==.
{txt}(16 real changes made)
{com}. replace bmonth=0 if bmonth==.
{txt}(16 real changes made)
{com}. replace bmonth=bmonth+10
{txt}(6,921 real changes made)
{com}. tostring byear bmonth, replace
{txt}byear was {res:float} now {res:str4}
bmonth was {res:float} now {res:str2}
{com}. gen bday=byear+bmonth+"15"
. destring bday, replace
{txt}bday: all characters numeric; {res}replaced {txt}as {res}long
{com}. replace bday=bday-1000
{txt}(6,921 real changes made)
{com}. gen age=round((20040130-bday)/10000)
. replace age=. if age<0
{txt}(16 real changes made, 16 to missing)
{com}. drop byear bmonth bday
. * emptenureを作成
. for num 8888 9999: mvdecode empsinceyear, mv(X)

{res}->  mvdecode empsinceyear, mv(8888)
{txt}empsinceyear:{res}{col 15}1888{txt} missing values generated

{res}->  mvdecode empsinceyear, mv(9999)
{txt}empsinceyear:{res}{col 15}308{txt} missing values generated
{com}. for num 88 99: mvdecode empsincemonth, mv(X)

{res}->  mvdecode empsincemonth, mv(88)
{txt}empsincemo~h:{res}{col 15}1888{txt} missing values generated

{res}->  mvdecode empsincemonth, mv(99)
{txt}empsincemo~h:{res}{col 15}308{txt} missing values generated
{com}. replace empsinceyear=2020 if empsinceyear==.
{txt}(2,196 real changes made)
{com}. replace empsincemonth=0 if empsincemonth==.
{txt}(2,196 real changes made)
{com}. replace empsincemonth=empsincemonth+10
{txt}(6,921 real changes made)
{com}. tostring empsinceyear empsincemonth, replace
{txt}empsinceyear was {res:int} now {res:str4}
empsincemonth was {res:byte} now {res:str2}
{com}. gen eday=empsinceyear+empsincemonth+"15"
. destring eday, replace
{txt}eday: all characters numeric; {res}replaced {txt}as {res}long
{com}. replace eday=eday-1000
{txt}(6,921 real changes made)
{com}. gen emptenure=(20040130-eday)/10000
. replace emptenure=. if emptenure<0
{txt}(2,239 real changes made, 2,239 to missing)
{com}. drop empsinceyear empsincemonth eday
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2004.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2004.dta saved
{com}. 
. * cohort dummy
. keep id
. gen cohort=4
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta"
. duplicates drop id, force

{p 0 4}{txt}Duplicates in terms of {res} id{p_end}

{txt}(0 observations are duplicates)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta saved
{com}. {c )-}
. 
. ** KHPS2005
. {c -(}
. * 変数名の変更
. ** 本人
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\KHPS2005.csv", clear 
{res}{text}(990 vars, 3,314 obs)
{com}. rename (v1 v4 v5 v6 v7 v76 v139 ///
> v171 v159 v160 v161 v164 v165 ///
> v207 v183 ///
> v185 v186 v187 v188 v189 v190 ///
> v203 v204 v205) ///
> (id marital sex byear bmonth earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. ** 主たる生計維持者
. replace earnmost=0 if earnmost!=1
{txt}(1,637 real changes made)
{com}. * 世帯主ダミー作成
. ** 世帯主ですか (*) only 主たる生計維持者 asked in this survey
. gen head=earnmost
. * 使わない変数を落とす
. drop v*
. * idを+20000
. replace id=id+20000
{txt}(3,314 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2005_pr.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2005_pr.dta saved
{com}. 
. ** 配偶者
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\KHPS2005.csv", clear 
{res}{text}(990 vars, 3,314 obs)
{com}. rename (v1 v4 v76 v392 ///
> v424 v412 v413 v414 v417 v418 ///
> v460 v436 ///
> v438 v439 v440 v441 v442 v443 ///
> v456 v457 v458) ///
> (id marital earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 続柄が配偶者のサンプルのみ残す
. keep if marital==1
{txt}(845 observations deleted)
{com}. * 続柄の変数名変更->配偶者の情報を抽出
. rename (v13 v14 v15 v16 ///
> v20 v21 v22 v23 ///
> v27 v28 v29 v30 ///
> v34 v35 v36 v37 ///
> v41 v42 v43 v44 ///
> v48 v49 v50 v51 ///
> v55 v56 v57 v58 ///
> v62 v63 v64 v65 ///
> v69 v70 v71 v72) ///
> (rel1no rel1sex rel1byear rel1bmonth ///
> rel2no rel2sex rel2byear rel2bmonth ///
> rel3no rel3sex rel3byear rel3bmonth ///
> rel4no rel4sex rel4byear rel4bmonth ///
> rel5no rel5sex rel5byear rel5bmonth ///
> rel6no rel6sex rel6byear rel6bmonth ///
> rel7no rel7sex rel7byear rel7bmonth ///
> rel8no rel8sex rel8byear rel8bmonth ///
> rel9no rel9sex rel9byear rel9bmonth)
{res}{com}. ** relation No. of spouse
. gen relno=0
. for num 1/9: replace relno=X+1 if relXno==1

{res}->  replace relno=1+1 if rel1no==1
{txt}(2,469 real changes made)

{res}->  replace relno=2+1 if rel2no==1
{txt}(0 real changes made)

{res}->  replace relno=3+1 if rel3no==1
{txt}(0 real changes made)

{res}->  replace relno=4+1 if rel4no==1
{txt}(0 real changes made)

{res}->  replace relno=5+1 if rel5no==1
{txt}(0 real changes made)

{res}->  replace relno=6+1 if rel6no==1
{txt}(0 real changes made)

{res}->  replace relno=7+1 if rel7no==1
{txt}(0 real changes made)

{res}->  replace relno=8+1 if rel8no==1
{txt}(0 real changes made)

{res}->  replace relno=9+1 if rel9no==1
{txt}(0 real changes made)
{com}. ** sex
. gen sex=0
. for num 1/9: replace sex=relXsex if relXno==1

{res}->  replace sex=rel1sex if rel1no==1
{txt}(2,469 real changes made)

{res}->  replace sex=rel2sex if rel2no==1
{txt}(0 real changes made)

{res}->  replace sex=rel3sex if rel3no==1
{txt}(0 real changes made)

{res}->  replace sex=rel4sex if rel4no==1
{txt}(0 real changes made)

{res}->  replace sex=rel5sex if rel5no==1
{txt}(0 real changes made)

{res}->  replace sex=rel6sex if rel6no==1
{txt}(0 real changes made)

{res}->  replace sex=rel7sex if rel7no==1
{txt}(0 real changes made)

{res}->  replace sex=rel8sex if rel8no==1
{txt}(0 real changes made)

{res}->  replace sex=rel9sex if rel9no==1
{txt}(0 real changes made)
{com}. ** byear
. gen byear=0
. for num 1/9: replace byear=relXbyear if relXno==1

{res}->  replace byear=rel1byear if rel1no==1
{txt}(2,469 real changes made)

{res}->  replace byear=rel2byear if rel2no==1
{txt}(0 real changes made)

{res}->  replace byear=rel3byear if rel3no==1
{txt}(0 real changes made)

{res}->  replace byear=rel4byear if rel4no==1
{txt}(0 real changes made)

{res}->  replace byear=rel5byear if rel5no==1
{txt}(0 real changes made)

{res}->  replace byear=rel6byear if rel6no==1
{txt}(0 real changes made)

{res}->  replace byear=rel7byear if rel7no==1
{txt}(0 real changes made)

{res}->  replace byear=rel8byear if rel8no==1
{txt}(0 real changes made)

{res}->  replace byear=rel9byear if rel9no==1
{txt}(0 real changes made)
{com}. ** bmonth
. gen bmonth=0
. for num 1/9: replace bmonth=relXbmonth if relXno==1

{res}->  replace bmonth=rel1bmonth if rel1no==1
{txt}(2,469 real changes made)

{res}->  replace bmonth=rel2bmonth if rel2no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel3bmonth if rel3no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel4bmonth if rel4no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel5bmonth if rel5no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel6bmonth if rel6no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel7bmonth if rel7no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel8bmonth if rel8no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel9bmonth if rel9no==1
{txt}(0 real changes made)
{com}. * 配偶者情報がないサンプルを落とす
. drop if relno==0
{txt}(0 observations deleted)
{com}. ** 主たる生計維持者
. replace earnmost=100 if earnmost==relno
{txt}(1,087 real changes made)
{com}. replace earnmost=0 if earnmost!=100
{txt}(1,382 real changes made)
{com}. replace earnmost=1 if earnmost==100
{txt}(1,087 real changes made)
{com}. * 世帯主ダミー作成
. ** 世帯主ですか (*) only 主たる生計維持者 asked in this survey
. gen head=earnmost
. * 使わない変数を落とす
. drop v* rel*
. * idを+30000
. replace id=id+30000
{txt}variable {bf}id{sf} was {bf}{res}int{sf}{txt} now {bf}{res}long{sf}
{txt}(2,469 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2005_sp.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2005_sp.dta saved
{com}. 
. ** 本人と配偶者サンプルをバインド
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2005_pr.dta", clear
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2005_sp.dta"
{txt}{p 0 7 2}
(note: variable
id was 
int, now long to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
sex was 
byte, now float to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
byear was 
int, now float to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
bmonth was 
byte, now float to accommodate using data's values)
{p_end}
{com}. gen year=2005
. * ageを作成
. mvdecode byear, mv(9999)
       {txt}byear:{res}{col 15}24{txt} missing values generated
{com}. mvdecode bmonth, mv(99)
      {txt}bmonth:{res}{col 15}24{txt} missing values generated
{com}. replace byear=2020 if byear==.
{txt}(24 real changes made)
{com}. replace bmonth=0 if bmonth==.
{txt}(24 real changes made)
{com}. replace bmonth=bmonth+10
{txt}(5,783 real changes made)
{com}. tostring byear bmonth, replace
{txt}byear was {res:float} now {res:str4}
bmonth was {res:float} now {res:str2}
{com}. gen bday=byear+bmonth+"15"
. destring bday, replace
{txt}bday: all characters numeric; {res}replaced {txt}as {res}long
{com}. replace bday=bday-1000
{txt}(5,783 real changes made)
{com}. gen age=round((20050130-bday)/10000)
. replace age=. if age<0
{txt}(24 real changes made, 24 to missing)
{com}. drop byear bmonth bday
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2005.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2005.dta saved
{com}. 
. * cohort dummy
. keep id
. gen cohort=4
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta"
. duplicates drop id, force

{p 0 4}{txt}Duplicates in terms of {res} id{p_end}

{txt}(5,753 observations deleted)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta saved
{com}. {c )-}
. 
. ** KHPS2006
. {c -(}
. * 変数名の変更
. ** 本人
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\KHPS2006.csv", clear 
{res}{text}(865 vars, 2,887 obs)
{com}. rename (v1 v4 v5 v6 v7 v76 v132 ///
> v152 v153 v154 v155 v158 v159 ///
> v195 v169 ///
> v171 v172 v173 v174 v175 v176 ///
> v189 v190 v191) ///
> (id marital sex byear bmonth earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. ** 主たる生計維持者
. replace earnmost=0 if earnmost!=1
{txt}(1,418 real changes made)
{com}. * 世帯主ダミー作成
. ** 世帯主ですか (*) only 主たる生計維持者 asked in this survey
. gen head=earnmost
. * 使わない変数を落とす
. drop v*
. * idを+20000
. replace id=id+20000
{txt}(2,887 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2006_pr.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2006_pr.dta saved
{com}. 
. ** 配偶者
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\KHPS2006.csv", clear 
{res}{text}(865 vars, 2,887 obs)
{com}. rename (v1 v4 v76 v348 ///
> v368 v369 v370 v371 v374 v375 ///
> v411 v385 ///
> v387 v388 v389 v390 v391 v392 ///
> v405 v406 v407) ///
> (id marital earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 続柄が配偶者のサンプルのみ残す
. keep if marital==1
{txt}(697 observations deleted)
{com}. * 続柄の変数名変更->配偶者の情報を抽出
. rename (v13 v14 v15 v16 ///
> v20 v21 v22 v23 ///
> v27 v28 v29 v30 ///
> v34 v35 v36 v37 ///
> v41 v42 v43 v44 ///
> v48 v49 v50 v51 ///
> v55 v56 v57 v58 ///
> v62 v63 v64 v65 ///
> v69 v70 v71 v72) ///
> (rel1no rel1sex rel1byear rel1bmonth ///
> rel2no rel2sex rel2byear rel2bmonth ///
> rel3no rel3sex rel3byear rel3bmonth ///
> rel4no rel4sex rel4byear rel4bmonth ///
> rel5no rel5sex rel5byear rel5bmonth ///
> rel6no rel6sex rel6byear rel6bmonth ///
> rel7no rel7sex rel7byear rel7bmonth ///
> rel8no rel8sex rel8byear rel8bmonth ///
> rel9no rel9sex rel9byear rel9bmonth)
{res}{com}. ** relation No. of spouse
. gen relno=0
. for num 1/9: replace relno=X+1 if relXno==1

{res}->  replace relno=1+1 if rel1no==1
{txt}(2,190 real changes made)

{res}->  replace relno=2+1 if rel2no==1
{txt}(0 real changes made)

{res}->  replace relno=3+1 if rel3no==1
{txt}(0 real changes made)

{res}->  replace relno=4+1 if rel4no==1
{txt}(0 real changes made)

{res}->  replace relno=5+1 if rel5no==1
{txt}(0 real changes made)

{res}->  replace relno=6+1 if rel6no==1
{txt}(0 real changes made)

{res}->  replace relno=7+1 if rel7no==1
{txt}(0 real changes made)

{res}->  replace relno=8+1 if rel8no==1
{txt}(0 real changes made)

{res}->  replace relno=9+1 if rel9no==1
{txt}(0 real changes made)
{com}. ** sex
. gen sex=0
. for num 1/9: replace sex=relXsex if relXno==1

{res}->  replace sex=rel1sex if rel1no==1
{txt}(2,190 real changes made)

{res}->  replace sex=rel2sex if rel2no==1
{txt}(0 real changes made)

{res}->  replace sex=rel3sex if rel3no==1
{txt}(0 real changes made)

{res}->  replace sex=rel4sex if rel4no==1
{txt}(0 real changes made)

{res}->  replace sex=rel5sex if rel5no==1
{txt}(0 real changes made)

{res}->  replace sex=rel6sex if rel6no==1
{txt}(0 real changes made)

{res}->  replace sex=rel7sex if rel7no==1
{txt}(0 real changes made)

{res}->  replace sex=rel8sex if rel8no==1
{txt}(0 real changes made)

{res}->  replace sex=rel9sex if rel9no==1
{txt}(0 real changes made)
{com}. ** byear
. gen byear=0
. for num 1/9: replace byear=relXbyear if relXno==1

{res}->  replace byear=rel1byear if rel1no==1
{txt}(2,190 real changes made)

{res}->  replace byear=rel2byear if rel2no==1
{txt}(0 real changes made)

{res}->  replace byear=rel3byear if rel3no==1
{txt}(0 real changes made)

{res}->  replace byear=rel4byear if rel4no==1
{txt}(0 real changes made)

{res}->  replace byear=rel5byear if rel5no==1
{txt}(0 real changes made)

{res}->  replace byear=rel6byear if rel6no==1
{txt}(0 real changes made)

{res}->  replace byear=rel7byear if rel7no==1
{txt}(0 real changes made)

{res}->  replace byear=rel8byear if rel8no==1
{txt}(0 real changes made)

{res}->  replace byear=rel9byear if rel9no==1
{txt}(0 real changes made)
{com}. ** bmonth
. gen bmonth=0
. for num 1/9: replace bmonth=relXbmonth if relXno==1

{res}->  replace bmonth=rel1bmonth if rel1no==1
{txt}(2,190 real changes made)

{res}->  replace bmonth=rel2bmonth if rel2no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel3bmonth if rel3no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel4bmonth if rel4no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel5bmonth if rel5no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel6bmonth if rel6no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel7bmonth if rel7no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel8bmonth if rel8no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel9bmonth if rel9no==1
{txt}(0 real changes made)
{com}. * 配偶者情報がないサンプルを落とす
. drop if relno==0
{txt}(0 observations deleted)
{com}. ** 主たる生計維持者
. replace earnmost=100 if earnmost==relno
{txt}(987 real changes made)
{com}. replace earnmost=0 if earnmost!=100
{txt}(1,203 real changes made)
{com}. replace earnmost=1 if earnmost==100
{txt}(987 real changes made)
{com}. * 世帯主ダミー作成
. ** 世帯主ですか (*) only 主たる生計維持者 asked in this survey
. gen head=earnmost
. * 使わない変数を落とす
. drop v* rel*
. * idを+30000
. replace id=id+30000
{txt}variable {bf}id{sf} was {bf}{res}int{sf}{txt} now {bf}{res}long{sf}
{txt}(2,190 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2006_sp.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2006_sp.dta saved
{com}. 
. ** 本人と配偶者サンプルをバインド
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2006_pr.dta", clear
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2006_sp.dta"
{txt}{p 0 7 2}
(note: variable
id was 
int, now long to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
sex was 
byte, now float to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
byear was 
int, now float to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
bmonth was 
byte, now float to accommodate using data's values)
{p_end}
{com}. gen year=2006
. * ageを作成
. mvdecode byear, mv(9999)
       {txt}byear:{res}{col 15}25{txt} missing values generated
{com}. mvdecode bmonth, mv(99)
      {txt}bmonth:{res}{col 15}25{txt} missing values generated
{com}. replace byear=2020 if byear==.
{txt}(25 real changes made)
{com}. replace bmonth=0 if bmonth==.
{txt}(25 real changes made)
{com}. replace bmonth=bmonth+10
{txt}(5,077 real changes made)
{com}. tostring byear bmonth, replace
{txt}byear was {res:float} now {res:str4}
bmonth was {res:float} now {res:str2}
{com}. gen bday=byear+bmonth+"15"
. destring bday, replace
{txt}bday: all characters numeric; {res}replaced {txt}as {res}long
{com}. replace bday=bday-1000
{txt}(5,077 real changes made)
{com}. gen age=round((20060130-bday)/10000)
. replace age=. if age<0
{txt}(25 real changes made, 25 to missing)
{com}. drop byear bmonth bday
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2006.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2006.dta saved
{com}. 
. * cohort dummy
. keep id
. gen cohort=4
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta"
. duplicates drop id, force

{p 0 4}{txt}Duplicates in terms of {res} id{p_end}

{txt}(5,054 observations deleted)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta saved
{com}. {c )-}
. 
. ** KHPS2007
. {c -(}
. * 変数名の変更
. ** 本人
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\KHPS2007.csv", clear 
{res}{text}(689 vars, 2,643 obs)
{com}. rename (v1 v4 v5 v6 v7 v76 v138 ///
> v158 v159 v160 v161 v164 v165 ///
> v201 v175 ///
> v177 v178 v179 v180 v181 v182 ///
> v195 v196 v197) ///
> (id marital sex byear bmonth earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. ** 主たる生計維持者
. replace earnmost=0 if earnmost!=1
{txt}(1,272 real changes made)
{com}. * 世帯主ダミー作成
. ** 世帯主ですか (*) only 主たる生計維持者 asked in this survey
. gen head=earnmost
. * 使わない変数を落とす
. drop v*
. * idを+20000
. replace id=id+20000
{txt}(2,643 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2007_pr.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2007_pr.dta saved
{com}. 
. ** 配偶者
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\KHPS2007.csv", clear 
{res}{text}(689 vars, 2,643 obs)
{com}. rename (v1 v4 v76 v309 ///
> v329 v330 v331 v332 v335 v336 ///
> v372 v346 ///
> v348 v349 v350 v351 v352 v353 ///
> v366 v367 v368) ///
> (id marital earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 続柄が配偶者のサンプルのみ残す
. keep if marital==1
{txt}(630 observations deleted)
{com}. * 続柄の変数名変更->配偶者の情報を抽出
. rename (v13 v14 v15 v16 ///
> v20 v21 v22 v23 ///
> v27 v28 v29 v30 ///
> v34 v35 v36 v37 ///
> v41 v42 v43 v44 ///
> v48 v49 v50 v51 ///
> v55 v56 v57 v58 ///
> v62 v63 v64 v65 ///
> v69 v70 v71 v72) ///
> (rel1no rel1sex rel1byear rel1bmonth ///
> rel2no rel2sex rel2byear rel2bmonth ///
> rel3no rel3sex rel3byear rel3bmonth ///
> rel4no rel4sex rel4byear rel4bmonth ///
> rel5no rel5sex rel5byear rel5bmonth ///
> rel6no rel6sex rel6byear rel6bmonth ///
> rel7no rel7sex rel7byear rel7bmonth ///
> rel8no rel8sex rel8byear rel8bmonth ///
> rel9no rel9sex rel9byear rel9bmonth)
{res}{com}. ** relation No. of spouse
. gen relno=0
. for num 1/9: replace relno=X+1 if relXno==1

{res}->  replace relno=1+1 if rel1no==1
{txt}(2,013 real changes made)

{res}->  replace relno=2+1 if rel2no==1
{txt}(0 real changes made)

{res}->  replace relno=3+1 if rel3no==1
{txt}(0 real changes made)

{res}->  replace relno=4+1 if rel4no==1
{txt}(0 real changes made)

{res}->  replace relno=5+1 if rel5no==1
{txt}(0 real changes made)

{res}->  replace relno=6+1 if rel6no==1
{txt}(0 real changes made)

{res}->  replace relno=7+1 if rel7no==1
{txt}(0 real changes made)

{res}->  replace relno=8+1 if rel8no==1
{txt}(0 real changes made)

{res}->  replace relno=9+1 if rel9no==1
{txt}(0 real changes made)
{com}. ** sex
. gen sex=0
. for num 1/9: replace sex=relXsex if relXno==1

{res}->  replace sex=rel1sex if rel1no==1
{txt}(2,013 real changes made)

{res}->  replace sex=rel2sex if rel2no==1
{txt}(0 real changes made)

{res}->  replace sex=rel3sex if rel3no==1
{txt}(0 real changes made)

{res}->  replace sex=rel4sex if rel4no==1
{txt}(0 real changes made)

{res}->  replace sex=rel5sex if rel5no==1
{txt}(0 real changes made)

{res}->  replace sex=rel6sex if rel6no==1
{txt}(0 real changes made)

{res}->  replace sex=rel7sex if rel7no==1
{txt}(0 real changes made)

{res}->  replace sex=rel8sex if rel8no==1
{txt}(0 real changes made)

{res}->  replace sex=rel9sex if rel9no==1
{txt}(0 real changes made)
{com}. ** byear
. gen byear=0
. for num 1/9: replace byear=relXbyear if relXno==1

{res}->  replace byear=rel1byear if rel1no==1
{txt}(2,013 real changes made)

{res}->  replace byear=rel2byear if rel2no==1
{txt}(0 real changes made)

{res}->  replace byear=rel3byear if rel3no==1
{txt}(0 real changes made)

{res}->  replace byear=rel4byear if rel4no==1
{txt}(0 real changes made)

{res}->  replace byear=rel5byear if rel5no==1
{txt}(0 real changes made)

{res}->  replace byear=rel6byear if rel6no==1
{txt}(0 real changes made)

{res}->  replace byear=rel7byear if rel7no==1
{txt}(0 real changes made)

{res}->  replace byear=rel8byear if rel8no==1
{txt}(0 real changes made)

{res}->  replace byear=rel9byear if rel9no==1
{txt}(0 real changes made)
{com}. ** bmonth
. gen bmonth=0
. for num 1/9: replace bmonth=relXbmonth if relXno==1

{res}->  replace bmonth=rel1bmonth if rel1no==1
{txt}(2,013 real changes made)

{res}->  replace bmonth=rel2bmonth if rel2no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel3bmonth if rel3no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel4bmonth if rel4no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel5bmonth if rel5no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel6bmonth if rel6no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel7bmonth if rel7no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel8bmonth if rel8no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel9bmonth if rel9no==1
{txt}(0 real changes made)
{com}. * 配偶者情報がないサンプルを落とす
. drop if relno==0
{txt}(0 observations deleted)
{com}. ** 主たる生計維持者
. replace earnmost=100 if earnmost==relno
{txt}(891 real changes made)
{com}. replace earnmost=0 if earnmost!=100
{txt}(1,122 real changes made)
{com}. replace earnmost=1 if earnmost==100
{txt}(891 real changes made)
{com}. * 世帯主ダミー作成
. ** 世帯主ですか (*) only 主たる生計維持者 asked in this survey
. gen head=earnmost
. * 使わない変数を落とす
. drop v* rel*
. * idを+30000
. replace id=id+30000
{txt}variable {bf}id{sf} was {bf}{res}int{sf}{txt} now {bf}{res}long{sf}
{txt}(2,013 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2007_sp.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2007_sp.dta saved
{com}. 
. ** 本人と配偶者サンプルをバインド
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2007_pr.dta", clear
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2007_sp.dta"
{txt}{p 0 7 2}
(note: variable
id was 
int, now long to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
sex was 
byte, now float to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
byear was 
int, now float to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
bmonth was 
byte, now float to accommodate using data's values)
{p_end}
{com}. gen year=2007
. * ageを作成
. mvdecode byear, mv(9999)
       {txt}byear:{res}{col 15}12{txt} missing values generated
{com}. mvdecode bmonth, mv(99)
      {txt}bmonth:{res}{col 15}12{txt} missing values generated
{com}. replace byear=2020 if byear==.
{txt}(12 real changes made)
{com}. replace bmonth=0 if bmonth==.
{txt}(12 real changes made)
{com}. replace bmonth=bmonth+10
{txt}(4,656 real changes made)
{com}. tostring byear bmonth, replace
{txt}byear was {res:float} now {res:str4}
bmonth was {res:float} now {res:str2}
{com}. gen bday=byear+bmonth+"15"
. destring bday, replace
{txt}bday: all characters numeric; {res}replaced {txt}as {res}long
{com}. replace bday=bday-1000
{txt}(4,656 real changes made)
{com}. gen age=round((20070130-bday)/10000)
. replace age=. if age<0
{txt}(12 real changes made, 12 to missing)
{com}. drop byear bmonth bday
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2007.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2007.dta saved
{com}. 
. * cohort dummy
. keep id
. gen cohort=4
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta"
. duplicates drop id, force

{p 0 4}{txt}Duplicates in terms of {res} id{p_end}

{txt}(4,636 observations deleted)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta saved
{com}. {c )-}
. 
. ** KHPS2007_new
. {c -(}
. * 変数名の変更
. ** 本人
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\KHPS2007_new.csv", clear 
{res}{text}(1,750 vars, 1,419 obs)
{com}. rename (v1 v4 v5 v6 v7 v76 v135 v156 ///
> v203 v204 v205 v206 v209 v210 ///
> v222 v223 v224 ///
> v228 v229 v230 v231 v232 v233 ///
> v246 v247 v248) ///
> (id marital sex byear bmonth earnmost edbg workstatus ///
> occ owner ind size employed regular ///
> empsinceyear empsincemonth union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. *** 就業履歴データの変数名変更
. **** temporal employee
. for X in num 420/473 \ Y in num 15/68: ///
> rename vX casY

{res}->  rename v420 cas15

->  rename v421 cas16

->  rename v422 cas17

->  rename v423 cas18

->  rename v424 cas19

->  rename v425 cas20

->  rename v426 cas21

->  rename v427 cas22

->  rename v428 cas23

->  rename v429 cas24

->  rename v430 cas25

->  rename v431 cas26

->  rename v432 cas27

->  rename v433 cas28

->  rename v434 cas29

->  rename v435 cas30

->  rename v436 cas31

->  rename v437 cas32

->  rename v438 cas33

->  rename v439 cas34

->  rename v440 cas35

->  rename v441 cas36

->  rename v442 cas37

->  rename v443 cas38

->  rename v444 cas39

->  rename v445 cas40

->  rename v446 cas41

->  rename v447 cas42

->  rename v448 cas43

->  rename v449 cas44

->  rename v450 cas45

->  rename v451 cas46

->  rename v452 cas47

->  rename v453 cas48

->  rename v454 cas49

->  rename v455 cas50

->  rename v456 cas51

->  rename v457 cas52

->  rename v458 cas53

->  rename v459 cas54

->  rename v460 cas55

->  rename v461 cas56

->  rename v462 cas57

->  rename v463 cas58

->  rename v464 cas59

->  rename v465 cas60

->  rename v466 cas61

->  rename v467 cas62

->  rename v468 cas63

->  rename v469 cas64

->  rename v470 cas65

->  rename v471 cas66

->  rename v472 cas67

->  rename v473 cas68
{com}. **** regular employee
. for X in num 474/527 \ Y in num 15/68: ///
> rename vX regY

{res}->  rename v474 reg15

->  rename v475 reg16

->  rename v476 reg17

->  rename v477 reg18

->  rename v478 reg19

->  rename v479 reg20

->  rename v480 reg21

->  rename v481 reg22

->  rename v482 reg23

->  rename v483 reg24

->  rename v484 reg25

->  rename v485 reg26

->  rename v486 reg27

->  rename v487 reg28

->  rename v488 reg29

->  rename v489 reg30

->  rename v490 reg31

->  rename v491 reg32

->  rename v492 reg33

->  rename v493 reg34

->  rename v494 reg35

->  rename v495 reg36

->  rename v496 reg37

->  rename v497 reg38

->  rename v498 reg39

->  rename v499 reg40

->  rename v500 reg41

->  rename v501 reg42

->  rename v502 reg43

->  rename v503 reg44

->  rename v504 reg45

->  rename v505 reg46

->  rename v506 reg47

->  rename v507 reg48

->  rename v508 reg49

->  rename v509 reg50

->  rename v510 reg51

->  rename v511 reg52

->  rename v512 reg53

->  rename v513 reg54

->  rename v514 reg55

->  rename v515 reg56

->  rename v516 reg57

->  rename v517 reg58

->  rename v518 reg59

->  rename v519 reg60

->  rename v520 reg61

->  rename v521 reg62

->  rename v522 reg63

->  rename v523 reg64

->  rename v524 reg65

->  rename v525 reg66

->  rename v526 reg67

->  rename v527 reg68
{com}. **** self employed
. for X in num 528/581 \ Y in num 15/68: ///
> rename vX selfY

{res}->  rename v528 self15

->  rename v529 self16

->  rename v530 self17

->  rename v531 self18

->  rename v532 self19

->  rename v533 self20

->  rename v534 self21

->  rename v535 self22

->  rename v536 self23

->  rename v537 self24

->  rename v538 self25

->  rename v539 self26

->  rename v540 self27

->  rename v541 self28

->  rename v542 self29

->  rename v543 self30

->  rename v544 self31

->  rename v545 self32

->  rename v546 self33

->  rename v547 self34

->  rename v548 self35

->  rename v549 self36

->  rename v550 self37

->  rename v551 self38

->  rename v552 self39

->  rename v553 self40

->  rename v554 self41

->  rename v555 self42

->  rename v556 self43

->  rename v557 self44

->  rename v558 self45

->  rename v559 self46

->  rename v560 self47

->  rename v561 self48

->  rename v562 self49

->  rename v563 self50

->  rename v564 self51

->  rename v565 self52

->  rename v566 self53

->  rename v567 self54

->  rename v568 self55

->  rename v569 self56

->  rename v570 self57

->  rename v571 self58

->  rename v572 self59

->  rename v573 self60

->  rename v574 self61

->  rename v575 self62

->  rename v576 self63

->  rename v577 self64

->  rename v578 self65

->  rename v579 self66

->  rename v580 self67

->  rename v581 self68
{com}. **** 内職
. for X in num 582/635 \ Y in num 15/68: ///
> rename vX sideY

{res}->  rename v582 side15

->  rename v583 side16

->  rename v584 side17

->  rename v585 side18

->  rename v586 side19

->  rename v587 side20

->  rename v588 side21

->  rename v589 side22

->  rename v590 side23

->  rename v591 side24

->  rename v592 side25

->  rename v593 side26

->  rename v594 side27

->  rename v595 side28

->  rename v596 side29

->  rename v597 side30

->  rename v598 side31

->  rename v599 side32

->  rename v600 side33

->  rename v601 side34

->  rename v602 side35

->  rename v603 side36

->  rename v604 side37

->  rename v605 side38

->  rename v606 side39

->  rename v607 side40

->  rename v608 side41

->  rename v609 side42

->  rename v610 side43

->  rename v611 side44

->  rename v612 side45

->  rename v613 side46

->  rename v614 side47

->  rename v615 side48

->  rename v616 side49

->  rename v617 side50

->  rename v618 side51

->  rename v619 side52

->  rename v620 side53

->  rename v621 side54

->  rename v622 side55

->  rename v623 side56

->  rename v624 side57

->  rename v625 side58

->  rename v626 side59

->  rename v627 side60

->  rename v628 side61

->  rename v629 side62

->  rename v630 side63

->  rename v631 side64

->  rename v632 side65

->  rename v633 side66

->  rename v634 side67

->  rename v635 side68
{com}. **** family worker
. for X in num 636/689 \ Y in num 15/68: ///
> rename vX fmwY

{res}->  rename v636 fmw15

->  rename v637 fmw16

->  rename v638 fmw17

->  rename v639 fmw18

->  rename v640 fmw19

->  rename v641 fmw20

->  rename v642 fmw21

->  rename v643 fmw22

->  rename v644 fmw23

->  rename v645 fmw24

->  rename v646 fmw25

->  rename v647 fmw26

->  rename v648 fmw27

->  rename v649 fmw28

->  rename v650 fmw29

->  rename v651 fmw30

->  rename v652 fmw31

->  rename v653 fmw32

->  rename v654 fmw33

->  rename v655 fmw34

->  rename v656 fmw35

->  rename v657 fmw36

->  rename v658 fmw37

->  rename v659 fmw38

->  rename v660 fmw39

->  rename v661 fmw40

->  rename v662 fmw41

->  rename v663 fmw42

->  rename v664 fmw43

->  rename v665 fmw44

->  rename v666 fmw45

->  rename v667 fmw46

->  rename v668 fmw47

->  rename v669 fmw48

->  rename v670 fmw49

->  rename v671 fmw50

->  rename v672 fmw51

->  rename v673 fmw52

->  rename v674 fmw53

->  rename v675 fmw54

->  rename v676 fmw55

->  rename v677 fmw56

->  rename v678 fmw57

->  rename v679 fmw58

->  rename v680 fmw59

->  rename v681 fmw60

->  rename v682 fmw61

->  rename v683 fmw62

->  rename v684 fmw63

->  rename v685 fmw64

->  rename v686 fmw65

->  rename v687 fmw66

->  rename v688 fmw67

->  rename v689 fmw68
{com}. ** 主たる生計維持者
. replace earnmost=0 if earnmost!=1
{txt}(763 real changes made)
{com}. * 世帯主ダミー作成
. ** 世帯主ですか (*) only 主たる生計維持者 asked in this survey
. gen head=earnmost
. * switch dummy
. gen switch=0
. * 使わない変数を落とす
. drop v*
. * idを+40000
. replace id=id+40000
{txt}variable {bf}id{sf} was {bf}{res}int{sf}{txt} now {bf}{res}long{sf}
{txt}(1,419 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2007_new_pr.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2007_new_pr.dta saved
{com}. 
. ** 配偶者
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\KHPS2007_new.csv", clear 
{res}{text}(1,750 vars, 1,419 obs)
{com}. rename (v1 v4 v14 v15 v16 v76 v813 v834 ///
> v881 v882 v823 v824 v887 v888 ///
> v900 v901 v902 ///
> v906 v907 v908 v909 v910 v911 ///
> v924 v925 v926) ///
> (id marital sex byear bmonth earnmost edbg workstatus ///
> occ owner ind size employed regular ///
> empsinceyear empsincemonth union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 続柄が配偶者のサンプルのみ残す
. keep if marital==1
{txt}(376 observations deleted)
{com}. *** 就業履歴データの変数名変更
. **** temporal employee
. for X in num 1098/1151 \ Y in num 15/68: ///
> rename vX casY

{res}->  rename v1098 cas15

->  rename v1099 cas16

->  rename v1100 cas17

->  rename v1101 cas18

->  rename v1102 cas19

->  rename v1103 cas20

->  rename v1104 cas21

->  rename v1105 cas22

->  rename v1106 cas23

->  rename v1107 cas24

->  rename v1108 cas25

->  rename v1109 cas26

->  rename v1110 cas27

->  rename v1111 cas28

->  rename v1112 cas29

->  rename v1113 cas30

->  rename v1114 cas31

->  rename v1115 cas32

->  rename v1116 cas33

->  rename v1117 cas34

->  rename v1118 cas35

->  rename v1119 cas36

->  rename v1120 cas37

->  rename v1121 cas38

->  rename v1122 cas39

->  rename v1123 cas40

->  rename v1124 cas41

->  rename v1125 cas42

->  rename v1126 cas43

->  rename v1127 cas44

->  rename v1128 cas45

->  rename v1129 cas46

->  rename v1130 cas47

->  rename v1131 cas48

->  rename v1132 cas49

->  rename v1133 cas50

->  rename v1134 cas51

->  rename v1135 cas52

->  rename v1136 cas53

->  rename v1137 cas54

->  rename v1138 cas55

->  rename v1139 cas56

->  rename v1140 cas57

->  rename v1141 cas58

->  rename v1142 cas59

->  rename v1143 cas60

->  rename v1144 cas61

->  rename v1145 cas62

->  rename v1146 cas63

->  rename v1147 cas64

->  rename v1148 cas65

->  rename v1149 cas66

->  rename v1150 cas67

->  rename v1151 cas68
{com}. **** regular employee
. for X in num 1152/1205 \ Y in num 15/68: ///
> rename vX regY

{res}->  rename v1152 reg15

->  rename v1153 reg16

->  rename v1154 reg17

->  rename v1155 reg18

->  rename v1156 reg19

->  rename v1157 reg20

->  rename v1158 reg21

->  rename v1159 reg22

->  rename v1160 reg23

->  rename v1161 reg24

->  rename v1162 reg25

->  rename v1163 reg26

->  rename v1164 reg27

->  rename v1165 reg28

->  rename v1166 reg29

->  rename v1167 reg30

->  rename v1168 reg31

->  rename v1169 reg32

->  rename v1170 reg33

->  rename v1171 reg34

->  rename v1172 reg35

->  rename v1173 reg36

->  rename v1174 reg37

->  rename v1175 reg38

->  rename v1176 reg39

->  rename v1177 reg40

->  rename v1178 reg41

->  rename v1179 reg42

->  rename v1180 reg43

->  rename v1181 reg44

->  rename v1182 reg45

->  rename v1183 reg46

->  rename v1184 reg47

->  rename v1185 reg48

->  rename v1186 reg49

->  rename v1187 reg50

->  rename v1188 reg51

->  rename v1189 reg52

->  rename v1190 reg53

->  rename v1191 reg54

->  rename v1192 reg55

->  rename v1193 reg56

->  rename v1194 reg57

->  rename v1195 reg58

->  rename v1196 reg59

->  rename v1197 reg60

->  rename v1198 reg61

->  rename v1199 reg62

->  rename v1200 reg63

->  rename v1201 reg64

->  rename v1202 reg65

->  rename v1203 reg66

->  rename v1204 reg67

->  rename v1205 reg68
{com}. **** self employed
. for X in num 1206/1259 \ Y in num 15/68: ///
> rename vX selfY

{res}->  rename v1206 self15

->  rename v1207 self16

->  rename v1208 self17

->  rename v1209 self18

->  rename v1210 self19

->  rename v1211 self20

->  rename v1212 self21

->  rename v1213 self22

->  rename v1214 self23

->  rename v1215 self24

->  rename v1216 self25

->  rename v1217 self26

->  rename v1218 self27

->  rename v1219 self28

->  rename v1220 self29

->  rename v1221 self30

->  rename v1222 self31

->  rename v1223 self32

->  rename v1224 self33

->  rename v1225 self34

->  rename v1226 self35

->  rename v1227 self36

->  rename v1228 self37

->  rename v1229 self38

->  rename v1230 self39

->  rename v1231 self40

->  rename v1232 self41

->  rename v1233 self42

->  rename v1234 self43

->  rename v1235 self44

->  rename v1236 self45

->  rename v1237 self46

->  rename v1238 self47

->  rename v1239 self48

->  rename v1240 self49

->  rename v1241 self50

->  rename v1242 self51

->  rename v1243 self52

->  rename v1244 self53

->  rename v1245 self54

->  rename v1246 self55

->  rename v1247 self56

->  rename v1248 self57

->  rename v1249 self58

->  rename v1250 self59

->  rename v1251 self60

->  rename v1252 self61

->  rename v1253 self62

->  rename v1254 self63

->  rename v1255 self64

->  rename v1256 self65

->  rename v1257 self66

->  rename v1258 self67

->  rename v1259 self68
{com}. **** 内職
. for X in num 1260/1313 \ Y in num 15/68: ///
> rename vX sideY

{res}->  rename v1260 side15

->  rename v1261 side16

->  rename v1262 side17

->  rename v1263 side18

->  rename v1264 side19

->  rename v1265 side20

->  rename v1266 side21

->  rename v1267 side22

->  rename v1268 side23

->  rename v1269 side24

->  rename v1270 side25

->  rename v1271 side26

->  rename v1272 side27

->  rename v1273 side28

->  rename v1274 side29

->  rename v1275 side30

->  rename v1276 side31

->  rename v1277 side32

->  rename v1278 side33

->  rename v1279 side34

->  rename v1280 side35

->  rename v1281 side36

->  rename v1282 side37

->  rename v1283 side38

->  rename v1284 side39

->  rename v1285 side40

->  rename v1286 side41

->  rename v1287 side42

->  rename v1288 side43

->  rename v1289 side44

->  rename v1290 side45

->  rename v1291 side46

->  rename v1292 side47

->  rename v1293 side48

->  rename v1294 side49

->  rename v1295 side50

->  rename v1296 side51

->  rename v1297 side52

->  rename v1298 side53

->  rename v1299 side54

->  rename v1300 side55

->  rename v1301 side56

->  rename v1302 side57

->  rename v1303 side58

->  rename v1304 side59

->  rename v1305 side60

->  rename v1306 side61

->  rename v1307 side62

->  rename v1308 side63

->  rename v1309 side64

->  rename v1310 side65

->  rename v1311 side66

->  rename v1312 side67

->  rename v1313 side68
{com}. **** family worker
. for X in num 1314/1367 \ Y in num 15/68: ///
> rename vX fmwY

{res}->  rename v1314 fmw15

->  rename v1315 fmw16

->  rename v1316 fmw17

->  rename v1317 fmw18

->  rename v1318 fmw19

->  rename v1319 fmw20

->  rename v1320 fmw21

->  rename v1321 fmw22

->  rename v1322 fmw23

->  rename v1323 fmw24

->  rename v1324 fmw25

->  rename v1325 fmw26

->  rename v1326 fmw27

->  rename v1327 fmw28

->  rename v1328 fmw29

->  rename v1329 fmw30

->  rename v1330 fmw31

->  rename v1331 fmw32

->  rename v1332 fmw33

->  rename v1333 fmw34

->  rename v1334 fmw35

->  rename v1335 fmw36

->  rename v1336 fmw37

->  rename v1337 fmw38

->  rename v1338 fmw39

->  rename v1339 fmw40

->  rename v1340 fmw41

->  rename v1341 fmw42

->  rename v1342 fmw43

->  rename v1343 fmw44

->  rename v1344 fmw45

->  rename v1345 fmw46

->  rename v1346 fmw47

->  rename v1347 fmw48

->  rename v1348 fmw49

->  rename v1349 fmw50

->  rename v1350 fmw51

->  rename v1351 fmw52

->  rename v1352 fmw53

->  rename v1353 fmw54

->  rename v1354 fmw55

->  rename v1355 fmw56

->  rename v1356 fmw57

->  rename v1357 fmw58

->  rename v1358 fmw59

->  rename v1359 fmw60

->  rename v1360 fmw61

->  rename v1361 fmw62

->  rename v1362 fmw63

->  rename v1363 fmw64

->  rename v1364 fmw65

->  rename v1365 fmw66

->  rename v1366 fmw67

->  rename v1367 fmw68
{com}. ** 主たる生計維持者
. replace earnmost=100 if earnmost==2
{txt}(500 real changes made)
{com}. replace earnmost=0 if earnmost!=100
{txt}(543 real changes made)
{com}. replace earnmost=1 if earnmost==100
{txt}(500 real changes made)
{com}. * 世帯主ダミー作成
. ** 世帯主ですか (*) only 主たる生計維持者 asked in this survey
. gen head=earnmost
. * switch dummy
. gen switch=0
. * 使わない変数を落とす
. drop v*
. * idを+30000
. replace id=id+30000
{txt}variable {bf}id{sf} was {bf}{res}int{sf}{txt} now {bf}{res}long{sf}
{txt}(1,043 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2007_new_sp.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2007_new_sp.dta saved
{com}. 
. ** 本人と配偶者サンプルをバインド
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2007_new_pr.dta", clear
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2007_new_sp.dta"
. gen year=2007
. * ageを作成
. mvdecode byear, mv(9999)
       {txt}byear:{res}{col 15}13{txt} missing values generated
{com}. mvdecode bmonth, mv(99)
      {txt}bmonth:{res}{col 15}13{txt} missing values generated
{com}. replace byear=2020 if byear==.
{txt}(13 real changes made)
{com}. replace bmonth=0 if bmonth==.
{txt}(13 real changes made)
{com}. replace bmonth=bmonth+10
{txt}(2,462 real changes made)
{com}. tostring byear bmonth, replace
{txt}byear was {res:int} now {res:str4}
bmonth was {res:byte} now {res:str2}
{com}. gen bday=byear+bmonth+"15"
. destring bday, replace
{txt}bday: all characters numeric; {res}replaced {txt}as {res}long
{com}. replace bday=bday-1000
{txt}(2,462 real changes made)
{com}. gen age=round((20070130-bday)/10000)
. replace age=. if age<0
{txt}(13 real changes made, 13 to missing)
{com}. drop byear bmonth bday
. * emptenureを作成
. for num 8888 9999: mvdecode empsinceyear, mv(X)

{res}->  mvdecode empsinceyear, mv(8888)
{txt}empsinceyear:{res}{col 15}623{txt} missing values generated

{res}->  mvdecode empsinceyear, mv(9999)
{txt}empsinceyear:{res}{col 15}120{txt} missing values generated
{com}. for num 88 99: mvdecode empsincemonth, mv(X)

{res}->  mvdecode empsincemonth, mv(88)
{txt}empsincemo~h:{res}{col 15}623{txt} missing values generated

{res}->  mvdecode empsincemonth, mv(99)
{txt}empsincemo~h:{res}{col 15}120{txt} missing values generated
{com}. replace empsinceyear=2020 if empsinceyear==.
{txt}(743 real changes made)
{com}. replace empsincemonth=0 if empsincemonth==.
{txt}(743 real changes made)
{com}. replace empsincemonth=empsincemonth+10
{txt}(2,462 real changes made)
{com}. tostring empsinceyear empsincemonth, replace
{txt}empsinceyear was {res:int} now {res:str4}
empsincemonth was {res:byte} now {res:str2}
{com}. gen eday=empsinceyear+empsincemonth+"15"
. destring eday, replace
{txt}eday: all characters numeric; {res}replaced {txt}as {res}long
{com}. replace eday=eday-1000
{txt}(2,462 real changes made)
{com}. gen emptenure=(20070130-eday)/10000
. replace emptenure=. if emptenure<0
{txt}(751 real changes made, 751 to missing)
{com}. drop empsinceyear empsincemonth eday
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2007_new.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2007_new.dta saved
{com}. 
. * cohort dummy
. keep id
. gen cohort=7
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta"
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta saved
{com}. {c )-}
. 
. ** KHPS2008
. {c -(}
. * 変数名の変更
. ** 本人
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\KHPS2008.csv", clear 
{res}{text}(823 vars, 3,691 obs)
{com}. rename (v1 v4 v5 v6 v7 v85 v148 ///
> v168 v169 v170 v171 v174 v175 ///
> v215 v188 ///
> v190 v191 v192 v193 v194 v195 ///
> v209 v210 v211) ///
> (id marital sex byear bmonth earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. ** 主たる生計維持者
. replace earnmost=0 if earnmost!=1
{txt}(1,813 real changes made)
{com}. * 世帯主ダミー作成
. ** 世帯主ですか (*) only 主たる生計維持者 asked in this survey
. gen head=earnmost
. * 使わない変数を落とす
. drop v*
. * idを+20000
. replace id=id+20000
{txt}(3,691 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2008_pr.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2008_pr.dta saved
{com}. 
. ** 配偶者
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\KHPS2008.csv", clear 
{res}{text}(823 vars, 3,691 obs)
{com}. rename (v1 v4 v85 v376 ///
> v396 v397 v398 v399 v402 v403 ///
> v443 v416 ///
> v418 v419 v420 v421 v422 v423 ///
> v437 v438 v439) ///
> (id marital earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 続柄が配偶者のサンプルのみ残す
. keep if marital==1
{txt}(885 observations deleted)
{com}. * 続柄の変数名変更->配偶者の情報を抽出
. rename (v13 v14 v15 v16 ///
> v21 v22 v23 v24 ///
> v29 v30 v31 v32 ///
> v37 v38 v39 v40 ///
> v45 v46 v47 v48 ///
> v53 v54 v55 v56 ///
> v61 v62 v63 v64 ///
> v69 v70 v71 v72 ///
> v77 v78 v79 v80) ///
> (rel1no rel1sex rel1byear rel1bmonth ///
> rel2no rel2sex rel2byear rel2bmonth ///
> rel3no rel3sex rel3byear rel3bmonth ///
> rel4no rel4sex rel4byear rel4bmonth ///
> rel5no rel5sex rel5byear rel5bmonth ///
> rel6no rel6sex rel6byear rel6bmonth ///
> rel7no rel7sex rel7byear rel7bmonth ///
> rel8no rel8sex rel8byear rel8bmonth ///
> rel9no rel9sex rel9byear rel9bmonth)
{res}{com}. ** relation No. of spouse
. gen relno=0
. for num 1/9: replace relno=X+1 if relXno==1

{res}->  replace relno=1+1 if rel1no==1
{txt}(2,806 real changes made)

{res}->  replace relno=2+1 if rel2no==1
{txt}(0 real changes made)

{res}->  replace relno=3+1 if rel3no==1
{txt}(0 real changes made)

{res}->  replace relno=4+1 if rel4no==1
{txt}(0 real changes made)

{res}->  replace relno=5+1 if rel5no==1
{txt}(0 real changes made)

{res}->  replace relno=6+1 if rel6no==1
{txt}(0 real changes made)

{res}->  replace relno=7+1 if rel7no==1
{txt}(0 real changes made)

{res}->  replace relno=8+1 if rel8no==1
{txt}(0 real changes made)

{res}->  replace relno=9+1 if rel9no==1
{txt}(0 real changes made)
{com}. ** sex
. gen sex=0
. for num 1/9: replace sex=relXsex if relXno==1

{res}->  replace sex=rel1sex if rel1no==1
{txt}(2,806 real changes made)

{res}->  replace sex=rel2sex if rel2no==1
{txt}(0 real changes made)

{res}->  replace sex=rel3sex if rel3no==1
{txt}(0 real changes made)

{res}->  replace sex=rel4sex if rel4no==1
{txt}(0 real changes made)

{res}->  replace sex=rel5sex if rel5no==1
{txt}(0 real changes made)

{res}->  replace sex=rel6sex if rel6no==1
{txt}(0 real changes made)

{res}->  replace sex=rel7sex if rel7no==1
{txt}(0 real changes made)

{res}->  replace sex=rel8sex if rel8no==1
{txt}(0 real changes made)

{res}->  replace sex=rel9sex if rel9no==1
{txt}(0 real changes made)
{com}. ** byear
. gen byear=0
. for num 1/9: replace byear=relXbyear if relXno==1

{res}->  replace byear=rel1byear if rel1no==1
{txt}(2,806 real changes made)

{res}->  replace byear=rel2byear if rel2no==1
{txt}(0 real changes made)

{res}->  replace byear=rel3byear if rel3no==1
{txt}(0 real changes made)

{res}->  replace byear=rel4byear if rel4no==1
{txt}(0 real changes made)

{res}->  replace byear=rel5byear if rel5no==1
{txt}(0 real changes made)

{res}->  replace byear=rel6byear if rel6no==1
{txt}(0 real changes made)

{res}->  replace byear=rel7byear if rel7no==1
{txt}(0 real changes made)

{res}->  replace byear=rel8byear if rel8no==1
{txt}(0 real changes made)

{res}->  replace byear=rel9byear if rel9no==1
{txt}(0 real changes made)
{com}. ** bmonth
. gen bmonth=0
. for num 1/9: replace bmonth=relXbmonth if relXno==1

{res}->  replace bmonth=rel1bmonth if rel1no==1
{txt}(2,804 real changes made)

{res}->  replace bmonth=rel2bmonth if rel2no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel3bmonth if rel3no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel4bmonth if rel4no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel5bmonth if rel5no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel6bmonth if rel6no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel7bmonth if rel7no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel8bmonth if rel8no==1
{txt}(0 real changes made)

{res}->  replace bmonth=rel9bmonth if rel9no==1
{txt}(0 real changes made)
{com}. * 配偶者情報がないサンプルを落とす
. drop if relno==0
{txt}(0 observations deleted)
{com}. ** 主たる生計維持者
. replace earnmost=100 if earnmost==relno
{txt}(1,293 real changes made)
{com}. replace earnmost=0 if earnmost!=100
{txt}(1,513 real changes made)
{com}. replace earnmost=1 if earnmost==100
{txt}(1,293 real changes made)
{com}. * 世帯主ダミー作成
. ** 世帯主ですか (*) only 主たる生計維持者 asked in this survey
. gen head=earnmost
. * 使わない変数を落とす
. drop v* rel*
. * idを+30000
. replace id=id+30000
{txt}variable {bf}id{sf} was {bf}{res}int{sf}{txt} now {bf}{res}long{sf}
{txt}(2,806 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2008_sp.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2008_sp.dta saved
{com}. 
. ** 本人と配偶者サンプルをバインド
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2008_pr.dta", clear
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2008_sp.dta"
{txt}{p 0 7 2}
(note: variable
id was 
int, now long to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
sex was 
byte, now float to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
byear was 
int, now float to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
bmonth was 
byte, now float to accommodate using data's values)
{p_end}
{com}. gen year=2008
. * ageを作成
. mvdecode byear, mv(9999)
       {txt}byear:{res}{col 15}30{txt} missing values generated
{com}. mvdecode bmonth, mv(99)
      {txt}bmonth:{res}{col 15}30{txt} missing values generated
{com}. replace byear=2020 if byear==.
{txt}(30 real changes made)
{com}. replace bmonth=0 if bmonth==.
{txt}(30 real changes made)
{com}. replace bmonth=bmonth+10
{txt}(6,497 real changes made)
{com}. tostring byear bmonth, replace
{txt}byear was {res:float} now {res:str4}
bmonth was {res:float} now {res:str2}
{com}. gen bday=byear+bmonth+"15"
. destring bday, replace
{txt}bday: all characters numeric; {res}replaced {txt}as {res}long
{com}. replace bday=bday-1000
{txt}(6,497 real changes made)
{com}. gen age=round((20080130-bday)/10000)
. replace age=. if age<0
{txt}(30 real changes made, 30 to missing)
{com}. drop byear bmonth bday
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2008.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2008.dta saved
{com}. 
. * cohort dummy
. keep id
. merge 1:1 id using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          12,515
{txt}{col 9}from master{col 30}{res}           1,267{txt}  (_merge==1)
{col 9}from using{col 30}{res}          11,248{txt}  (_merge==2)

{col 5}matched{col 30}{res}           5,230{txt}  (_merge==3)
{col 5}{hline 41}
{com}. replace cohort=4 if cohort==.
{txt}(1,267 real changes made)
{com}. drop _merge
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta saved
{com}. {c )-}
. 
. ** KHPS2009
. {c -(}
. * 変数名の変更
. ** 本人
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\KHPS2009.csv", clear 
{res}{text}(884 vars, 3,422 obs)
{com}. rename (v1 v4 v5 v6 v7 v85 v86 v87 v160 ///
> v180 v181 v182 v183 v186 v187 ///
> v238 v195 ///
> v197 v198 v199 v200 v201 v202 ///
> v216 v217 v218) ///
> (id marital sex byear bmonth head earnif earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 世帯主ダミー作成
. ** 世帯主ですか
. replace head=0 if head!=1
{txt}(1,656 real changes made)
{com}. ** 主たる生計維持者
. replace earnmost=1 if head==1&earnif==2
{txt}(1,573 real changes made)
{com}. replace earnmost=0 if earnmost!=1
{txt}(1,752 real changes made)
{com}. * 使わない変数を落とす
. drop earnif v*
. * idを+20000
. replace id=id+20000
{txt}(3,422 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2009_pr.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2009_pr.dta saved
{com}. 
. ** 配偶者
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\KHPS2009.csv", clear 
{res}{text}(884 vars, 3,422 obs)
{com}. rename (v1 v4  v14 v15 v16 v86 v87 v88 v429 ///
> v449 v450 v451 v452 v455 v456 ///
> v507 v464 ///
> v466 v467 v468 v469 v470 v471 ///
> v485 v486 v487) ///
> (id marital sex byear bmonth head earnif earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 続柄が配偶者のサンプルのみ残す
. keep if marital==1
{txt}(811 observations deleted)
{com}. * 世帯主ダミー作成
. * 世帯主ダミー作成
. ** 世帯主ですか
. replace head=0 if head!=2
{txt}(289 real changes made)
{com}. replace head=1 if head==2
{txt}(2,322 real changes made)
{com}. ** 主たる生計維持者
. replace earnmost=1 if earnmost==2|head==1&earnif==2
{txt}(2,409 real changes made)
{com}. replace earnmost=0 if earnmost!=1
{txt}(70 real changes made)
{com}. * 使わない変数を落とす
. drop earnif v*
. * idを+30000
. replace id=id+30000
{txt}variable {bf}id{sf} was {bf}{res}int{sf}{txt} now {bf}{res}long{sf}
{txt}(2,611 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2009_sp.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2009_sp.dta saved
{com}. 
. ** 本人と配偶者サンプルをバインド
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2009_pr.dta", clear
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2009_sp.dta"
{txt}{p 0 7 2}
(note: variable
id was 
int, now long to accommodate using data's values)
{p_end}
{com}. gen year=2009
. * ageを作成
. mvdecode byear, mv(9999)
       {txt}byear:{res}{col 15}34{txt} missing values generated
{com}. mvdecode bmonth, mv(99)
      {txt}bmonth:{res}{col 15}34{txt} missing values generated
{com}. replace byear=2020 if byear==.
{txt}(34 real changes made)
{com}. replace bmonth=0 if bmonth==.
{txt}(34 real changes made)
{com}. replace bmonth=bmonth+10
{txt}(6,033 real changes made)
{com}. tostring byear bmonth, replace
{txt}byear was {res:int} now {res:str4}
bmonth was {res:byte} now {res:str2}
{com}. gen bday=byear+bmonth+"15"
. destring bday, replace
{txt}bday: all characters numeric; {res}replaced {txt}as {res}long
{com}. replace bday=bday-1000
{txt}(6,033 real changes made)
{com}. gen age=round((20090130-bday)/10000)
. replace age=. if age<0
{txt}(34 real changes made, 34 to missing)
{com}. drop byear bmonth bday
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2009.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2009.dta saved
{com}. 
. * cohort dummy
. keep id
. merge 1:1 id using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          11,756
{txt}{col 9}from master{col 30}{res}              22{txt}  (_merge==1)
{col 9}from using{col 30}{res}          11,734{txt}  (_merge==2)

{col 5}matched{col 30}{res}           6,011{txt}  (_merge==3)
{col 5}{hline 41}
{com}. replace cohort=4 if cohort==.
{txt}(22 real changes made)
{com}. drop _merge
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta saved
{com}. {c )-}
. 
. ** KHPS2010
. {c -(}
. * 変数名の変更
. ** 本人
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\KHPS2010.csv", clear 
{res}{text}(857 vars, 3,207 obs)
{com}. rename (v1 v4 v5 v6 v7 v85 v86 v87 v161 ///
> v181 v182 v183 v184 v187 v188 ///
> v243 v196 ///
> v198 v199 v200 v201 v202 v203 ///
> v217 v218 v219) ///
> (id marital sex byear bmonth head earnif earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 世帯主ダミー作成
. ** 世帯主ですか
. replace head=0 if head!=1
{txt}(1,542 real changes made)
{com}. ** 主たる生計維持者
. replace earnmost=1 if head==1&earnif==2
{txt}(1,477 real changes made)
{com}. replace earnmost=0 if earnmost!=1
{txt}(1,621 real changes made)
{com}. * 使わない変数を落とす
. drop earnif v*
. * idを+20000
. replace id=id+20000
{txt}(3,207 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2010_pr.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2010_pr.dta saved
{com}. 
. ** 配偶者
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\KHPS2010.csv", clear 
{res}{text}(857 vars, 3,207 obs)
{com}. rename (v1 v4  v14 v15 v16 v85 v86 v87 v426 ///
> v446 v447 v448 v449 v452 v453 ///
> v508 v461 ///
> v463 v464 v465 v466 v467 v468 ///
> v482 v483 v484) ///
> (id marital sex byear bmonth head earnif earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 続柄が配偶者のサンプルのみ残す
. keep if marital==1
{txt}(736 observations deleted)
{com}. * 世帯主ダミー作成
. * 世帯主ダミー作成
. ** 世帯主ですか
. replace head=0 if head!=2
{txt}(1,323 real changes made)
{com}. replace head=1 if head==2
{txt}(1,148 real changes made)
{com}. ** 主たる生計維持者
. replace earnmost=1 if earnmost==2|head==1&earnif==2
{txt}(1,095 real changes made)
{com}. replace earnmost=0 if earnmost!=1
{txt}(1,321 real changes made)
{com}. * 使わない変数を落とす
. drop earnif v*
. * idを+10000
. replace id=id+30000
{txt}variable {bf}id{sf} was {bf}{res}int{sf}{txt} now {bf}{res}long{sf}
{txt}(2,471 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2010_sp.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2010_sp.dta saved
{com}. 
. ** 本人と配偶者サンプルをバインド
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2010_pr.dta", clear
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2010_sp.dta"
{txt}{p 0 7 2}
(note: variable
id was 
int, now long to accommodate using data's values)
{p_end}
{com}. gen year=2010
. * ageを作成
. mvdecode byear, mv(9999)
       {txt}byear:{res}{col 15}9{txt} missing values generated
{com}. mvdecode bmonth, mv(99)
      {txt}bmonth:{res}{col 15}9{txt} missing values generated
{com}. replace byear=2020 if byear==.
{txt}(9 real changes made)
{com}. replace bmonth=0 if bmonth==.
{txt}(9 real changes made)
{com}. replace bmonth=bmonth+10
{txt}(5,678 real changes made)
{com}. tostring byear bmonth, replace
{txt}byear was {res:int} now {res:str4}
bmonth was {res:byte} now {res:str2}
{com}. gen bday=byear+bmonth+"15"
. destring bday, replace
{txt}bday: all characters numeric; {res}replaced {txt}as {res}long
{com}. replace bday=bday-1000
{txt}(5,678 real changes made)
{com}. gen age=round((20100130-bday)/10000)
. replace age=. if age<0
{txt}(9 real changes made, 9 to missing)
{com}. drop byear bmonth bday
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2010.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2010.dta saved
{com}. 
. * cohort dummy
. keep id
. merge 1:1 id using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          12,143
{txt}{col 9}from master{col 30}{res}              27{txt}  (_merge==1)
{col 9}from using{col 30}{res}          12,116{txt}  (_merge==2)

{col 5}matched{col 30}{res}           5,651{txt}  (_merge==3)
{col 5}{hline 41}
{com}. replace cohort=4 if cohort==.
{txt}(27 real changes made)
{com}. drop _merge
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta saved
{com}. {c )-}
. 
. ** KHPS2011
. {c -(}
. * 変数名の変更
. ** 本人
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\KHPS2011.csv", clear 
{res}{text}(859 vars, 3,030 obs)
{com}. rename (v1 v4 v5 v6 v7 v85 v86 v87 v173 ///
> v193 v194 v195 v196 v199 v200 ///
> v249 v208 ///
> v210 v211 v212 v213 v214 v215 ///
> v229 v230 v231) ///
> (id marital sex byear bmonth head earnif earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 世帯主ダミー作成
. ** 世帯主ですか
. replace head=0 if head!=1
{txt}(1,432 real changes made)
{com}. ** 主たる生計維持者
. replace earnmost=1 if head==1&earnif==2
{txt}(1,403 real changes made)
{com}. replace earnmost=0 if earnmost!=1
{txt}(1,530 real changes made)
{com}. * 使わない変数を落とす
. drop earnif v*
. * idを+20000
. replace id=id+20000
{txt}(3,030 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2011_pr.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2011_pr.dta saved
{com}. 
. ** 配偶者
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\KHPS2011.csv", clear 
{res}{text}(859 vars, 3,030 obs)
{com}. rename (v1 v4  v14 v15 v16 v85 v86 v87 v431 ///
> v451 v452 v453 v454 v457 v458 ///
> v507 v466 ///
> v468 v469 v470 v471 v472 v473 ///
> v487 v488 v489) ///
> (id marital sex byear bmonth head earnif earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 続柄が配偶者のサンプルのみ残す
. keep if marital==1
{txt}(679 observations deleted)
{com}. * 世帯主ダミー作成
. * 世帯主ダミー作成
. ** 世帯主ですか
. replace head=0 if head!=2
{txt}(1,259 real changes made)
{com}. replace head=1 if head==2
{txt}(1,092 real changes made)
{com}. ** 主たる生計維持者
. replace earnmost=1 if earnmost==2|head==1&earnif==2
{txt}(1,054 real changes made)
{com}. replace earnmost=0 if earnmost!=1
{txt}(1,244 real changes made)
{com}. * 使わない変数を落とす
. drop earnif v*
. * idを+10000
. replace id=id+30000
{txt}variable {bf}id{sf} was {bf}{res}int{sf}{txt} now {bf}{res}long{sf}
{txt}(2,351 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2011_sp.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2011_sp.dta saved
{com}. 
. ** 本人と配偶者サンプルをバインド
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2011_pr.dta", clear
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2011_sp.dta"
{txt}{p 0 7 2}
(note: variable
id was 
int, now long to accommodate using data's values)
{p_end}
{com}. gen year=2011
. * ageを作成
. mvdecode byear, mv(9999)
       {txt}byear:{res}{col 15}10{txt} missing values generated
{com}. mvdecode bmonth, mv(99)
      {txt}bmonth:{res}{col 15}10{txt} missing values generated
{com}. replace byear=2020 if byear==.
{txt}(10 real changes made)
{com}. replace bmonth=0 if bmonth==.
{txt}(10 real changes made)
{com}. replace bmonth=bmonth+10
{txt}(5,381 real changes made)
{com}. tostring byear bmonth, replace
{txt}byear was {res:int} now {res:str4}
bmonth was {res:byte} now {res:str2}
{com}. gen bday=byear+bmonth+"15"
. destring bday, replace
{txt}bday: all characters numeric; {res}replaced {txt}as {res}long
{com}. replace bday=bday-1000
{txt}(5,381 real changes made)
{com}. gen age=round((20110130-bday)/10000)
. replace age=. if age<0
{txt}(10 real changes made, 10 to missing)
{com}. drop byear bmonth bday
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2011.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2011.dta saved
{com}. 
. * cohort dummy
. keep id
. merge 1:1 id using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          12,441
{txt}{col 9}from master{col 30}{res}              14{txt}  (_merge==1)
{col 9}from using{col 30}{res}          12,427{txt}  (_merge==2)

{col 5}matched{col 30}{res}           5,367{txt}  (_merge==3)
{col 5}{hline 41}
{com}. replace cohort=4 if cohort==.
{txt}(14 real changes made)
{com}. drop _merge
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta saved
{com}. {c )-}
. 
. ** KHPS2012
. {c -(}
. * 変数名の変更
. ** 本人
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\KHPS2012.csv", clear 
{res}{text}(882 vars, 2,865 obs)
{com}. rename (v1 v4 v5 v6 v7 v85 v86 v87 v167 ///
> v187 v188 v189 v190 v193 v194 ///
> v228 v202 ///
> v204 v205 v206 v207 v208 v209 ///
> v214 v215 v216) ///
> (id marital sex byear bmonth head earnif earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 世帯主ダミー作成
. ** 世帯主ですか
. replace head=0 if head!=1
{txt}(1,331 real changes made)
{com}. ** 主たる生計維持者
. replace earnmost=1 if head==1&earnif==2
{txt}(1,350 real changes made)
{com}. replace earnmost=0 if earnmost!=1
{txt}(1,428 real changes made)
{com}. * 使わない変数を落とす
. drop earnif v*
. * idを+20000
. replace id=id+20000
{txt}(2,865 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2012_pr.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2012_pr.dta saved
{com}. 
. ** 配偶者
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\KHPS2012.csv", clear 
{res}{text}(882 vars, 2,865 obs)
{com}. rename (v1 v4  v14 v15 v16 v85 v86 v87 v405 ///
> v425 v426 v427 v428 v431 v432 ///
> v466 v440 ///
> v442 v443 v444 v445 v446 v447 ///
> v452 v453 v454) ///
> (id marital sex byear bmonth head earnif earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 続柄が配偶者のサンプルのみ残す
. keep if marital==1
{txt}(635 observations deleted)
{com}. * 世帯主ダミー作成
. ** 世帯主ですか
. replace head=0 if head!=2
{txt}(1,202 real changes made)
{com}. replace head=1 if head==2
{txt}(1,028 real changes made)
{com}. ** 主たる生計維持者
. replace earnmost=1 if earnmost==2|head==1&earnif==2
{txt}(970 real changes made)
{com}. replace earnmost=0 if earnmost!=1
{txt}(1,210 real changes made)
{com}. * 使わない変数を落とす
. drop earnif v*
. * idを+10000
. replace id=id+30000
{txt}variable {bf}id{sf} was {bf}{res}int{sf}{txt} now {bf}{res}long{sf}
{txt}(2,230 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2012_sp.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2012_sp.dta saved
{com}. 
. ** 本人と配偶者サンプルをバインド
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2012_pr.dta", clear
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2012_sp.dta"
{txt}{p 0 7 2}
(note: variable
id was 
int, now long to accommodate using data's values)
{p_end}
{com}. gen year=2012
. * ageを作成
. mvdecode byear, mv(9999)
       {txt}byear:{res}{col 15}7{txt} missing values generated
{com}. mvdecode bmonth, mv(99)
      {txt}bmonth:{res}{col 15}7{txt} missing values generated
{com}. replace byear=2020 if byear==.
{txt}(7 real changes made)
{com}. replace bmonth=0 if bmonth==.
{txt}(7 real changes made)
{com}. replace bmonth=bmonth+10
{txt}(5,095 real changes made)
{com}. tostring byear bmonth, replace
{txt}byear was {res:int} now {res:str4}
bmonth was {res:byte} now {res:str2}
{com}. gen bday=byear+bmonth+"15"
. destring bday, replace
{txt}bday: all characters numeric; {res}replaced {txt}as {res}long
{com}. replace bday=bday-1000
{txt}(5,095 real changes made)
{com}. gen age=round((20120130-bday)/10000)
. replace age=. if age<0
{txt}(7 real changes made, 7 to missing)
{com}. drop byear bmonth bday
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2012.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2012.dta saved
{com}. 
. * cohort dummy
. keep id
. merge 1:1 id using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          12,749
{txt}{col 9}from master{col 30}{res}              18{txt}  (_merge==1)
{col 9}from using{col 30}{res}          12,731{txt}  (_merge==2)

{col 5}matched{col 30}{res}           5,077{txt}  (_merge==3)
{col 5}{hline 41}
{com}. replace cohort=4 if cohort==.
{txt}(18 real changes made)
{com}. drop _merge
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta saved
{com}. {c )-}
. 
. ** KHPS2012_new
. {c -(}
. * 変数名の変更
. ** 本人
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\KHPS2012_new.csv", clear 
{res}{text}(1,875 vars, 1,012 obs)
{com}. rename (v1 v4 v5 v6 v7 v85 v86 v87 v150 v171 ///
> v218 v219 v220 v221 v224 v225 ///
> v233 v234 v235 ///
> v239 v240 v241 v242 v243 v244 ///
> v249 v250 v251) ///
> (id marital sex byear bmonth head earnif earnmost edbg workstatus ///
> occ owner ind size employed regular ///
> empsinceyear empsincemonth union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. *** 就業履歴データの変数名変更
. **** temporal employee
. for X in num 427/480 \ Y in num 15/68: ///
> rename vX casY

{res}->  rename v427 cas15

->  rename v428 cas16

->  rename v429 cas17

->  rename v430 cas18

->  rename v431 cas19

->  rename v432 cas20

->  rename v433 cas21

->  rename v434 cas22

->  rename v435 cas23

->  rename v436 cas24

->  rename v437 cas25

->  rename v438 cas26

->  rename v439 cas27

->  rename v440 cas28

->  rename v441 cas29

->  rename v442 cas30

->  rename v443 cas31

->  rename v444 cas32

->  rename v445 cas33

->  rename v446 cas34

->  rename v447 cas35

->  rename v448 cas36

->  rename v449 cas37

->  rename v450 cas38

->  rename v451 cas39

->  rename v452 cas40

->  rename v453 cas41

->  rename v454 cas42

->  rename v455 cas43

->  rename v456 cas44

->  rename v457 cas45

->  rename v458 cas46

->  rename v459 cas47

->  rename v460 cas48

->  rename v461 cas49

->  rename v462 cas50

->  rename v463 cas51

->  rename v464 cas52

->  rename v465 cas53

->  rename v466 cas54

->  rename v467 cas55

->  rename v468 cas56

->  rename v469 cas57

->  rename v470 cas58

->  rename v471 cas59

->  rename v472 cas60

->  rename v473 cas61

->  rename v474 cas62

->  rename v475 cas63

->  rename v476 cas64

->  rename v477 cas65

->  rename v478 cas66

->  rename v479 cas67

->  rename v480 cas68
{com}. **** regular employee
. for X in num 481/534 \ Y in num 15/68: ///
> rename vX regY

{res}->  rename v481 reg15

->  rename v482 reg16

->  rename v483 reg17

->  rename v484 reg18

->  rename v485 reg19

->  rename v486 reg20

->  rename v487 reg21

->  rename v488 reg22

->  rename v489 reg23

->  rename v490 reg24

->  rename v491 reg25

->  rename v492 reg26

->  rename v493 reg27

->  rename v494 reg28

->  rename v495 reg29

->  rename v496 reg30

->  rename v497 reg31

->  rename v498 reg32

->  rename v499 reg33

->  rename v500 reg34

->  rename v501 reg35

->  rename v502 reg36

->  rename v503 reg37

->  rename v504 reg38

->  rename v505 reg39

->  rename v506 reg40

->  rename v507 reg41

->  rename v508 reg42

->  rename v509 reg43

->  rename v510 reg44

->  rename v511 reg45

->  rename v512 reg46

->  rename v513 reg47

->  rename v514 reg48

->  rename v515 reg49

->  rename v516 reg50

->  rename v517 reg51

->  rename v518 reg52

->  rename v519 reg53

->  rename v520 reg54

->  rename v521 reg55

->  rename v522 reg56

->  rename v523 reg57

->  rename v524 reg58

->  rename v525 reg59

->  rename v526 reg60

->  rename v527 reg61

->  rename v528 reg62

->  rename v529 reg63

->  rename v530 reg64

->  rename v531 reg65

->  rename v532 reg66

->  rename v533 reg67

->  rename v534 reg68
{com}. **** self employed
. for X in num 535/588 \ Y in num 15/68: ///
> rename vX selfY

{res}->  rename v535 self15

->  rename v536 self16

->  rename v537 self17

->  rename v538 self18

->  rename v539 self19

->  rename v540 self20

->  rename v541 self21

->  rename v542 self22

->  rename v543 self23

->  rename v544 self24

->  rename v545 self25

->  rename v546 self26

->  rename v547 self27

->  rename v548 self28

->  rename v549 self29

->  rename v550 self30

->  rename v551 self31

->  rename v552 self32

->  rename v553 self33

->  rename v554 self34

->  rename v555 self35

->  rename v556 self36

->  rename v557 self37

->  rename v558 self38

->  rename v559 self39

->  rename v560 self40

->  rename v561 self41

->  rename v562 self42

->  rename v563 self43

->  rename v564 self44

->  rename v565 self45

->  rename v566 self46

->  rename v567 self47

->  rename v568 self48

->  rename v569 self49

->  rename v570 self50

->  rename v571 self51

->  rename v572 self52

->  rename v573 self53

->  rename v574 self54

->  rename v575 self55

->  rename v576 self56

->  rename v577 self57

->  rename v578 self58

->  rename v579 self59

->  rename v580 self60

->  rename v581 self61

->  rename v582 self62

->  rename v583 self63

->  rename v584 self64

->  rename v585 self65

->  rename v586 self66

->  rename v587 self67

->  rename v588 self68
{com}. **** 内職
. for X in num 589/642 \ Y in num 15/68: ///
> rename vX sideY

{res}->  rename v589 side15

->  rename v590 side16

->  rename v591 side17

->  rename v592 side18

->  rename v593 side19

->  rename v594 side20

->  rename v595 side21

->  rename v596 side22

->  rename v597 side23

->  rename v598 side24

->  rename v599 side25

->  rename v600 side26

->  rename v601 side27

->  rename v602 side28

->  rename v603 side29

->  rename v604 side30

->  rename v605 side31

->  rename v606 side32

->  rename v607 side33

->  rename v608 side34

->  rename v609 side35

->  rename v610 side36

->  rename v611 side37

->  rename v612 side38

->  rename v613 side39

->  rename v614 side40

->  rename v615 side41

->  rename v616 side42

->  rename v617 side43

->  rename v618 side44

->  rename v619 side45

->  rename v620 side46

->  rename v621 side47

->  rename v622 side48

->  rename v623 side49

->  rename v624 side50

->  rename v625 side51

->  rename v626 side52

->  rename v627 side53

->  rename v628 side54

->  rename v629 side55

->  rename v630 side56

->  rename v631 side57

->  rename v632 side58

->  rename v633 side59

->  rename v634 side60

->  rename v635 side61

->  rename v636 side62

->  rename v637 side63

->  rename v638 side64

->  rename v639 side65

->  rename v640 side66

->  rename v641 side67

->  rename v642 side68
{com}. **** family worker
. for X in num 643/696 \ Y in num 15/68: ///
> rename vX fmwY

{res}->  rename v643 fmw15

->  rename v644 fmw16

->  rename v645 fmw17

->  rename v646 fmw18

->  rename v647 fmw19

->  rename v648 fmw20

->  rename v649 fmw21

->  rename v650 fmw22

->  rename v651 fmw23

->  rename v652 fmw24

->  rename v653 fmw25

->  rename v654 fmw26

->  rename v655 fmw27

->  rename v656 fmw28

->  rename v657 fmw29

->  rename v658 fmw30

->  rename v659 fmw31

->  rename v660 fmw32

->  rename v661 fmw33

->  rename v662 fmw34

->  rename v663 fmw35

->  rename v664 fmw36

->  rename v665 fmw37

->  rename v666 fmw38

->  rename v667 fmw39

->  rename v668 fmw40

->  rename v669 fmw41

->  rename v670 fmw42

->  rename v671 fmw43

->  rename v672 fmw44

->  rename v673 fmw45

->  rename v674 fmw46

->  rename v675 fmw47

->  rename v676 fmw48

->  rename v677 fmw49

->  rename v678 fmw50

->  rename v679 fmw51

->  rename v680 fmw52

->  rename v681 fmw53

->  rename v682 fmw54

->  rename v683 fmw55

->  rename v684 fmw56

->  rename v685 fmw57

->  rename v686 fmw58

->  rename v687 fmw59

->  rename v688 fmw60

->  rename v689 fmw61

->  rename v690 fmw62

->  rename v691 fmw63

->  rename v692 fmw64

->  rename v693 fmw65

->  rename v694 fmw66

->  rename v695 fmw67

->  rename v696 fmw68
{com}. * 世帯主ダミー作成
. ** 世帯主ですか
. replace head=0 if head!=1
{txt}(548 real changes made)
{com}. ** 主たる生計維持者
. replace earnmost=1 if head==1&earnif==2
{txt}(421 real changes made)
{com}. replace earnmost=0 if earnmost!=1
{txt}(544 real changes made)
{com}. * switch dummy
. gen switch=0
. * 使わない変数を落とす
. drop v*
. * idを+40000
. replace id=id+40000
{txt}variable {bf}id{sf} was {bf}{res}int{sf}{txt} now {bf}{res}long{sf}
{txt}(1,012 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2012_new_pr.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2012_new_pr.dta saved
{com}. 
. ** 配偶者
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\KHPS2012_new.csv", clear 
{res}{text}(1,875 vars, 1,012 obs)
{com}. rename (v1 v4 v14 v15 v16 v85 v86 v87 v864 v885 ///
> v932 v933 v934 v935 v938 v939 ///
> v947 v948 v949 ///
> v953 v954 v955 v956 v957 v958 ///
> v963 v964 v965) ///
> (id marital sex byear bmonth head earnif earnmost edbg workstatus ///
> occ owner ind size employed regular ///
> empsinceyear empsincemonth union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 続柄が配偶者のサンプルのみ残す
. keep if marital==1
{txt}(312 observations deleted)
{com}. *** 就業履歴データの変数名変更
. **** temporal employee
. for X in num 1141/1194 \ Y in num 15/68: ///
> rename vX casY

{res}->  rename v1141 cas15

->  rename v1142 cas16

->  rename v1143 cas17

->  rename v1144 cas18

->  rename v1145 cas19

->  rename v1146 cas20

->  rename v1147 cas21

->  rename v1148 cas22

->  rename v1149 cas23

->  rename v1150 cas24

->  rename v1151 cas25

->  rename v1152 cas26

->  rename v1153 cas27

->  rename v1154 cas28

->  rename v1155 cas29

->  rename v1156 cas30

->  rename v1157 cas31

->  rename v1158 cas32

->  rename v1159 cas33

->  rename v1160 cas34

->  rename v1161 cas35

->  rename v1162 cas36

->  rename v1163 cas37

->  rename v1164 cas38

->  rename v1165 cas39

->  rename v1166 cas40

->  rename v1167 cas41

->  rename v1168 cas42

->  rename v1169 cas43

->  rename v1170 cas44

->  rename v1171 cas45

->  rename v1172 cas46

->  rename v1173 cas47

->  rename v1174 cas48

->  rename v1175 cas49

->  rename v1176 cas50

->  rename v1177 cas51

->  rename v1178 cas52

->  rename v1179 cas53

->  rename v1180 cas54

->  rename v1181 cas55

->  rename v1182 cas56

->  rename v1183 cas57

->  rename v1184 cas58

->  rename v1185 cas59

->  rename v1186 cas60

->  rename v1187 cas61

->  rename v1188 cas62

->  rename v1189 cas63

->  rename v1190 cas64

->  rename v1191 cas65

->  rename v1192 cas66

->  rename v1193 cas67

->  rename v1194 cas68
{com}. **** regular employee
. for X in num 1195/1248 \ Y in num 15/68: ///
> rename vX regY

{res}->  rename v1195 reg15

->  rename v1196 reg16

->  rename v1197 reg17

->  rename v1198 reg18

->  rename v1199 reg19

->  rename v1200 reg20

->  rename v1201 reg21

->  rename v1202 reg22

->  rename v1203 reg23

->  rename v1204 reg24

->  rename v1205 reg25

->  rename v1206 reg26

->  rename v1207 reg27

->  rename v1208 reg28

->  rename v1209 reg29

->  rename v1210 reg30

->  rename v1211 reg31

->  rename v1212 reg32

->  rename v1213 reg33

->  rename v1214 reg34

->  rename v1215 reg35

->  rename v1216 reg36

->  rename v1217 reg37

->  rename v1218 reg38

->  rename v1219 reg39

->  rename v1220 reg40

->  rename v1221 reg41

->  rename v1222 reg42

->  rename v1223 reg43

->  rename v1224 reg44

->  rename v1225 reg45

->  rename v1226 reg46

->  rename v1227 reg47

->  rename v1228 reg48

->  rename v1229 reg49

->  rename v1230 reg50

->  rename v1231 reg51

->  rename v1232 reg52

->  rename v1233 reg53

->  rename v1234 reg54

->  rename v1235 reg55

->  rename v1236 reg56

->  rename v1237 reg57

->  rename v1238 reg58

->  rename v1239 reg59

->  rename v1240 reg60

->  rename v1241 reg61

->  rename v1242 reg62

->  rename v1243 reg63

->  rename v1244 reg64

->  rename v1245 reg65

->  rename v1246 reg66

->  rename v1247 reg67

->  rename v1248 reg68
{com}. **** self employed
. for X in num 1249/1302 \ Y in num 15/68: ///
> rename vX selfY

{res}->  rename v1249 self15

->  rename v1250 self16

->  rename v1251 self17

->  rename v1252 self18

->  rename v1253 self19

->  rename v1254 self20

->  rename v1255 self21

->  rename v1256 self22

->  rename v1257 self23

->  rename v1258 self24

->  rename v1259 self25

->  rename v1260 self26

->  rename v1261 self27

->  rename v1262 self28

->  rename v1263 self29

->  rename v1264 self30

->  rename v1265 self31

->  rename v1266 self32

->  rename v1267 self33

->  rename v1268 self34

->  rename v1269 self35

->  rename v1270 self36

->  rename v1271 self37

->  rename v1272 self38

->  rename v1273 self39

->  rename v1274 self40

->  rename v1275 self41

->  rename v1276 self42

->  rename v1277 self43

->  rename v1278 self44

->  rename v1279 self45

->  rename v1280 self46

->  rename v1281 self47

->  rename v1282 self48

->  rename v1283 self49

->  rename v1284 self50

->  rename v1285 self51

->  rename v1286 self52

->  rename v1287 self53

->  rename v1288 self54

->  rename v1289 self55

->  rename v1290 self56

->  rename v1291 self57

->  rename v1292 self58

->  rename v1293 self59

->  rename v1294 self60

->  rename v1295 self61

->  rename v1296 self62

->  rename v1297 self63

->  rename v1298 self64

->  rename v1299 self65

->  rename v1300 self66

->  rename v1301 self67

->  rename v1302 self68
{com}. **** 内職
. for X in num 1303/1356 \ Y in num 15/68: ///
> rename vX sideY

{res}->  rename v1303 side15

->  rename v1304 side16

->  rename v1305 side17

->  rename v1306 side18

->  rename v1307 side19

->  rename v1308 side20

->  rename v1309 side21

->  rename v1310 side22

->  rename v1311 side23

->  rename v1312 side24

->  rename v1313 side25

->  rename v1314 side26

->  rename v1315 side27

->  rename v1316 side28

->  rename v1317 side29

->  rename v1318 side30

->  rename v1319 side31

->  rename v1320 side32

->  rename v1321 side33

->  rename v1322 side34

->  rename v1323 side35

->  rename v1324 side36

->  rename v1325 side37

->  rename v1326 side38

->  rename v1327 side39

->  rename v1328 side40

->  rename v1329 side41

->  rename v1330 side42

->  rename v1331 side43

->  rename v1332 side44

->  rename v1333 side45

->  rename v1334 side46

->  rename v1335 side47

->  rename v1336 side48

->  rename v1337 side49

->  rename v1338 side50

->  rename v1339 side51

->  rename v1340 side52

->  rename v1341 side53

->  rename v1342 side54

->  rename v1343 side55

->  rename v1344 side56

->  rename v1345 side57

->  rename v1346 side58

->  rename v1347 side59

->  rename v1348 side60

->  rename v1349 side61

->  rename v1350 side62

->  rename v1351 side63

->  rename v1352 side64

->  rename v1353 side65

->  rename v1354 side66

->  rename v1355 side67

->  rename v1356 side68
{com}. **** family worker
. for X in num 1357/1410 \ Y in num 15/68: ///
> rename vX fmwY

{res}->  rename v1357 fmw15

->  rename v1358 fmw16

->  rename v1359 fmw17

->  rename v1360 fmw18

->  rename v1361 fmw19

->  rename v1362 fmw20

->  rename v1363 fmw21

->  rename v1364 fmw22

->  rename v1365 fmw23

->  rename v1366 fmw24

->  rename v1367 fmw25

->  rename v1368 fmw26

->  rename v1369 fmw27

->  rename v1370 fmw28

->  rename v1371 fmw29

->  rename v1372 fmw30

->  rename v1373 fmw31

->  rename v1374 fmw32

->  rename v1375 fmw33

->  rename v1376 fmw34

->  rename v1377 fmw35

->  rename v1378 fmw36

->  rename v1379 fmw37

->  rename v1380 fmw38

->  rename v1381 fmw39

->  rename v1382 fmw40

->  rename v1383 fmw41

->  rename v1384 fmw42

->  rename v1385 fmw43

->  rename v1386 fmw44

->  rename v1387 fmw45

->  rename v1388 fmw46

->  rename v1389 fmw47

->  rename v1390 fmw48

->  rename v1391 fmw49

->  rename v1392 fmw50

->  rename v1393 fmw51

->  rename v1394 fmw52

->  rename v1395 fmw53

->  rename v1396 fmw54

->  rename v1397 fmw55

->  rename v1398 fmw56

->  rename v1399 fmw57

->  rename v1400 fmw58

->  rename v1401 fmw59

->  rename v1402 fmw60

->  rename v1403 fmw61

->  rename v1404 fmw62

->  rename v1405 fmw63

->  rename v1406 fmw64

->  rename v1407 fmw65

->  rename v1408 fmw66

->  rename v1409 fmw67

->  rename v1410 fmw68
{com}. * 世帯主ダミー作成
. ** 世帯主ですか
. replace head=0 if head!=2
{txt}(379 real changes made)
{com}. replace head=1 if head==2
{txt}(321 real changes made)
{com}. ** 主たる生計維持者
. replace earnmost=1 if earnmost==2|head==1&earnif==2
{txt}(297 real changes made)
{com}. replace earnmost=0 if earnmost!=1
{txt}(382 real changes made)
{com}. * switch dummy
. gen switch=0
. * 使わない変数を落とす
. drop v*
. * idを+30000
. replace id=id+30000
{txt}variable {bf}id{sf} was {bf}{res}int{sf}{txt} now {bf}{res}long{sf}
{txt}(700 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2012_new_sp.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2012_new_sp.dta saved
{com}. 
. ** 本人と配偶者サンプルをバインド
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2012_new_pr.dta", clear
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2012_new_sp.dta"
. gen year=2012
. * ageを作成
. mvdecode byear, mv(9999)
       {txt}byear:{res}{col 15}5{txt} missing values generated
{com}. mvdecode bmonth, mv(99)
      {txt}bmonth:{res}{col 15}5{txt} missing values generated
{com}. replace byear=2020 if byear==.
{txt}(5 real changes made)
{com}. replace bmonth=0 if bmonth==.
{txt}(5 real changes made)
{com}. replace bmonth=bmonth+10
{txt}(1,712 real changes made)
{com}. tostring byear bmonth, replace
{txt}byear was {res:int} now {res:str4}
bmonth was {res:byte} now {res:str2}
{com}. gen bday=byear+bmonth+"15"
. destring bday, replace
{txt}bday: all characters numeric; {res}replaced {txt}as {res}long
{com}. replace bday=bday-1000
{txt}(1,712 real changes made)
{com}. gen age=round((20120130-bday)/10000)
. replace age=. if age<0
{txt}(5 real changes made, 5 to missing)
{com}. drop byear bmonth bday
. * emptenureを作成
. for num 8888 9999: mvdecode empsinceyear, mv(X)

{res}->  mvdecode empsinceyear, mv(8888)
{txt}empsinceyear:{res}{col 15}445{txt} missing values generated

{res}->  mvdecode empsinceyear, mv(9999)
{txt}empsinceyear:{res}{col 15}57{txt} missing values generated
{com}. for num 88 99: mvdecode empsincemonth, mv(X)

{res}->  mvdecode empsincemonth, mv(88)
{txt}empsincemo~h:{res}{col 15}445{txt} missing values generated

{res}->  mvdecode empsincemonth, mv(99)
{txt}empsincemo~h:{res}{col 15}81{txt} missing values generated
{com}. replace empsinceyear=2020 if empsinceyear==.
{txt}(502 real changes made)
{com}. replace empsincemonth=0 if empsincemonth==.
{txt}(526 real changes made)
{com}. replace empsincemonth=empsincemonth+10
{txt}(1,712 real changes made)
{com}. tostring empsinceyear empsincemonth, replace
{txt}empsinceyear was {res:int} now {res:str4}
empsincemonth was {res:byte} now {res:str2}
{com}. gen eday=empsinceyear+empsincemonth+"15"
. destring eday, replace
{txt}eday: all characters numeric; {res}replaced {txt}as {res}long
{com}. replace eday=eday-1000
{txt}(1,712 real changes made)
{com}. gen emptenure=(20120130-eday)/10000
. replace emptenure=. if emptenure<0
{txt}(504 real changes made, 504 to missing)
{com}. drop empsinceyear empsincemonth eday
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2012_new.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2012_new.dta saved
{com}. 
. * cohort dummy
. keep id
. gen cohort=12
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta"
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta saved
{com}. {c )-}
. 
. ** KHPS2013
. {c -(}
. * 変数名の変更
. ** 本人
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\KHPS2013.csv", clear 
{res}{text}(1,021 vars, 2,702 obs)
{com}. rename (v1 v4 v5 v6 v7 v85 v86 v87 v190 ///
> v210 v211 v212 v213 v216 v217 ///
> v266 v225 ///
> v227 v228 v229 v230 v231 v232 ///
> v246 v247 v248) ///
> (id marital sex byear bmonth head earnif earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 世帯主ダミー作成
. ** 世帯主ですか
. replace head=0 if head!=1
{txt}(1,247 real changes made)
{com}. ** 主たる生計維持者
. replace earnmost=1 if head==1&earnif==2
{txt}(1,285 real changes made)
{com}. replace earnmost=0 if earnmost!=1
{txt}(1,346 real changes made)
{com}. * 使わない変数を落とす
. drop earnif v*
. * idを+20000
. replace id=id+20000
{txt}(2,702 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2013_pr.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2013_pr.dta saved
{com}. 
. ** 配偶者
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\KHPS2013.csv", clear 
{res}{text}(1,021 vars, 2,702 obs)
{com}. rename (v1 v4  v14 v15 v16 v85 v86 v87 v471 ///
> v491 v492 v493 v494 v497 v498 ///
> v547 v506 ///
> v508 v509 v510 v511 v512 v513 ///
> v527 v528 v529) ///
> (id marital sex byear bmonth head earnif earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 続柄が配偶者のサンプルのみ残す
. keep if marital==1
{txt}(598 observations deleted)
{com}. * 世帯主ダミー作成
. * 世帯主ダミー作成
. ** 世帯主ですか
. replace head=0 if head!=2
{txt}(1,131 real changes made)
{com}. replace head=1 if head==2
{txt}(973 real changes made)
{com}. ** 主たる生計維持者
. replace earnmost=1 if earnmost==2|head==1&earnif==2
{txt}(927 real changes made)
{com}. replace earnmost=0 if earnmost!=1
{txt}(1,135 real changes made)
{com}. * 使わない変数を落とす
. drop earnif v*
. * idを+10000
. replace id=id+30000
{txt}variable {bf}id{sf} was {bf}{res}int{sf}{txt} now {bf}{res}long{sf}
{txt}(2,104 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2013_sp.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2013_sp.dta saved
{com}. 
. ** 本人と配偶者サンプルをバインド
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2013_pr.dta", clear
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2013_sp.dta"
{txt}{p 0 7 2}
(note: variable
id was 
int, now long to accommodate using data's values)
{p_end}
{com}. gen year=2013
. * ageを作成
. mvdecode byear, mv(9999)
       {txt}byear:{res}{col 15}1{txt} missing value generated
{com}. mvdecode bmonth, mv(99)
      {txt}bmonth:{res}{col 15}1{txt} missing value generated
{com}. replace byear=2020 if byear==.
{txt}(1 real change made)
{com}. replace bmonth=0 if bmonth==.
{txt}(1 real change made)
{com}. replace bmonth=bmonth+10
{txt}(4,806 real changes made)
{com}. tostring byear bmonth, replace
{txt}byear was {res:int} now {res:str4}
bmonth was {res:byte} now {res:str2}
{com}. gen bday=byear+bmonth+"15"
. destring bday, replace
{txt}bday: all characters numeric; {res}replaced {txt}as {res}long
{com}. replace bday=bday-1000
{txt}(4,806 real changes made)
{com}. gen age=round((20130130-bday)/10000)
. replace age=. if age<0
{txt}(1 real change made, 1 to missing)
{com}. drop byear bmonth bday
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2013.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2013.dta saved
{com}. 
. * cohort dummy
. keep id
. merge 1:1 id using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          14,756
{txt}{col 9}from master{col 30}{res}              12{txt}  (_merge==1)
{col 9}from using{col 30}{res}          14,744{txt}  (_merge==2)

{col 5}matched{col 30}{res}           4,794{txt}  (_merge==3)
{col 5}{hline 41}
{com}. replace cohort=4 if cohort==.
{txt}(12 real changes made)
{com}. drop _merge
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta saved
{com}. {c )-}
. 
. ** KHPS2014
. {c -(}
. * 変数名の変更
. ** 本人
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\KHPS2014.csv", clear 
{res}{text}(957 vars, 3,312 obs)
{com}. rename (v1 v4 v5 v6 v7 v101 v102 v103 v220 ///
> v227 v228 v229 v230 v233 v234 ///
> v265 v242 ///
> v244 v245 v246 v247 v248 v249 ///
> v251 v252 v253) ///
> (id marital sex byear bmonth head earnif earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 世帯主ダミー作成
. ** 世帯主ですか
. replace head=0 if head!=1
{txt}(1,499 real changes made)
{com}. ** 主たる生計維持者
. replace earnmost=1 if head==1&earnif==2
{txt}(1,614 real changes made)
{com}. replace earnmost=0 if earnmost!=1
{txt}(1,608 real changes made)
{com}. * 使わない変数を落とす
. drop earnif v*
. * idを+20000
. replace id=id+20000
{txt}(3,312 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2014_pr.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2014_pr.dta saved
{com}. 
. ** 配偶者
. import delimited "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\OriginalData\KHPS2014.csv", clear 
{res}{text}(957 vars, 3,312 obs)
{com}. rename (v1 v4  v12 v13 v14 v101 v102 v103 v498 ///
> v505 v506 v507 v508 v511 v512 ///
> v543 v520 ///
> v522 v523 v524 v525 v526 v527 ///
> v529 v530 v531) ///
> (id marital sex byear bmonth head earnif earnmost workstatus ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek)
{res}{com}. * 続柄が配偶者のサンプルのみ残す
. keep if marital==1
{txt}(779 observations deleted)
{com}. * 世帯主ダミー作成
. * 世帯主ダミー作成
. ** 世帯主ですか
. replace head=0 if head!=2
{txt}(1,397 real changes made)
{com}. replace head=1 if head==2
{txt}(1,136 real changes made)
{com}. ** 主たる生計維持者
. replace earnmost=1 if earnmost==2|head==1&earnif==2
{txt}(1,081 real changes made)
{com}. replace earnmost=0 if earnmost!=1
{txt}(1,401 real changes made)
{com}. * 使わない変数を落とす
. drop earnif v*
. * idを+10000
. replace id=id+30000
{txt}variable {bf}id{sf} was {bf}{res}int{sf}{txt} now {bf}{res}long{sf}
{txt}(2,533 real changes made)
{com}. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2014_sp.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2014_sp.dta saved
{com}. 
. ** 本人と配偶者サンプルをバインド
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2014_pr.dta", clear
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2014_sp.dta"
{txt}{p 0 7 2}
(note: variable
id was 
int, now long to accommodate using data's values)
{p_end}
{com}. gen year=2014
. * ageを作成
. mvdecode byear, mv(9999)
       {txt}byear:{res}{col 15}1{txt} missing value generated
{com}. mvdecode bmonth, mv(99)
      {txt}bmonth:{res}{col 15}2{txt} missing values generated
{com}. replace byear=2020 if byear==.
{txt}(1 real change made)
{com}. replace bmonth=0 if bmonth==.
{txt}(2 real changes made)
{com}. replace bmonth=bmonth+10
{txt}(5,845 real changes made)
{com}. tostring byear bmonth, replace
{txt}byear was {res:int} now {res:str4}
bmonth was {res:byte} now {res:str2}
{com}. gen bday=byear+bmonth+"15"
. destring bday, replace
{txt}bday: all characters numeric; {res}replaced {txt}as {res}long
{com}. replace bday=bday-1000
{txt}(5,845 real changes made)
{com}. gen age=round((20140130-bday)/10000)
. replace age=. if age<0
{txt}(1 real change made, 1 to missing)
{com}. drop byear bmonth bday
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2014.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2014.dta saved
{com}. 
. * cohort dummy
. keep id
. merge 1:1 id using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          15,281
{txt}{col 9}from master{col 30}{res}             788{txt}  (_merge==1)
{col 9}from using{col 30}{res}          14,493{txt}  (_merge==2)

{col 5}matched{col 30}{res}           5,057{txt}  (_merge==3)
{col 5}{hline 41}
{com}. replace cohort=4 if cohort==.
{txt}(788 real changes made)
{com}. drop _merge
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta saved
{com}. {c )-}
. 
. ** 全ての年に共通の変数のみバインドする
. {c -(}
. *** JHPS
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2009.dta",  clear
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2010.dta"
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2011.dta"
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2012.dta"
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2013.dta"
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2014.dta"
. *** KHPS2004
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2004.dta"
{txt}{p 0 7 2}
(note: variable
id was 
int, now long to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
sex was 
byte, now float to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
head was 
byte, now float to accommodate using data's values)
{p_end}
{com}. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2005.dta"
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2006.dta"
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2007.dta"
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2008.dta"
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2009.dta"
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2010.dta"
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2011.dta"
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2012.dta"
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2013.dta"
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2014.dta"
. *** new cohort
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2007_new.dta"
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2012_new.dta"
. keep id marital sex age head earnmost workstatus year  ///
> occ owner ind size employed regular ///
> switch union ///
> paymethod monthlypaid dailypaid hourlypaid yearlypaid bonus ///
> workdaypermonth workhourperweek overworkperweek
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPSKHPS_2004_2014.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPSKHPS_2004_2014.dta saved
{com}. {c )-}
. {c )-}
{txt}
{com}. 
. * 5--7
. ** 学歴と就業履歴をサンプルにマージする
. {c -(}
. ** idと学歴データを抽出
. {c -(}
. *** JHPSの学歴
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2009.dta", clear
. mvdecode edbg, mv(9)
        {txt}edbg:{res}{col 15}58{txt} missing values generated
{com}. gen schooling=9 if edbg==1
{txt}(6,495 missing values generated)
{com}. replace schooling=12 if edbg==2
{txt}(4,565 real changes made)
{com}. replace schooling=14 if edbg==3 | edbg==6
{txt}(833 real changes made)
{com}. replace schooling=16 if edbg==4 | edbg==5
{txt}(1,039 real changes made)
{com}. keep id schooling
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\SchoolingJHPS.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\SchoolingJHPS.dta saved
{com}. 
. *** KHPSの学歴
. **** old cohort
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2004.dta", clear
. mvdecode edbg, mv(9)
        {txt}edbg:{res}{col 15}9{txt} missing values generated
{com}. gen schooling=9 if edbg==1
{txt}(6,091 missing values generated)
{com}. replace schooling=12 if edbg==2
{txt}(3,377 real changes made)
{com}. replace schooling=14 if edbg==3 | edbg==6
{txt}(1,169 real changes made)
{com}. replace schooling=16 if edbg==4 | edbg==5
{txt}(1,478 real changes made)
{com}. keep id schooling
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\SchoolingKHPS.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\SchoolingKHPS.dta saved
{com}. 
. **** new cohort 2007
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2007_new.dta", clear
. mvdecode edbg, mv(9)
        {txt}edbg:{res}{col 15}8{txt} missing values generated
{com}. gen schooling=9 if edbg==1
{txt}(2,260 missing values generated)
{com}. replace schooling=12 if edbg==2
{txt}(1,108 real changes made)
{com}. replace schooling=14 if edbg==3 | edbg==6
{txt}(532 real changes made)
{com}. replace schooling=16 if edbg==4 | edbg==5
{txt}(612 real changes made)
{com}. keep id schooling
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\SchoolingKHPS_new_2007.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\SchoolingKHPS_new_2007.dta saved
{com}. 
. **** new cohort 2012
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2012_new.dta", clear
. mvdecode edbg, mv(9)
        {txt}edbg:{res}{col 15}11{txt} missing values generated
{com}. gen schooling=9 if edbg==1
{txt}(1,616 missing values generated)
{com}. replace schooling=12 if edbg==2
{txt}(746 real changes made)
{com}. replace schooling=14 if edbg==3 | edbg==6
{txt}(381 real changes made)
{com}. replace schooling=16 if edbg==4 | edbg==5
{txt}(478 real changes made)
{com}. keep id schooling
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\SchoolingKHPS_new_2012.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\SchoolingKHPS_new_2012.dta saved
{com}. 
. *** bind
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\SchoolingJHPS.dta", clear
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\SchoolingKHPS.dta"
{txt}{p 0 7 2}
(note: variable
id was 
int, now long to accommodate using data's values)
{p_end}
{com}. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\SchoolingKHPS_new_2007.dta"
. append using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\SchoolingKHPS_new_2012.dta"
. sort id
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Schooling.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Schooling.dta saved
{com}.  {c )-}
.  
.  ** idと労働経験年数を抽出
. {c -(}
. *** JHPS労働経験年数
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2010.dta", clear
. for num 18/65: gen weX=0

{res}->  gen we18=0

->  gen we19=0

->  gen we20=0

->  gen we21=0

->  gen we22=0

->  gen we23=0

->  gen we24=0

->  gen we25=0

->  gen we26=0

->  gen we27=0

->  gen we28=0

->  gen we29=0

->  gen we30=0

->  gen we31=0

->  gen we32=0

->  gen we33=0

->  gen we34=0

->  gen we35=0

->  gen we36=0

->  gen we37=0

->  gen we38=0

->  gen we39=0

->  gen we40=0

->  gen we41=0

->  gen we42=0

->  gen we43=0

->  gen we44=0

->  gen we45=0

->  gen we46=0

->  gen we47=0

->  gen we48=0

->  gen we49=0

->  gen we50=0

->  gen we51=0

->  gen we52=0

->  gen we53=0

->  gen we54=0

->  gen we55=0

->  gen we56=0

->  gen we57=0

->  gen we58=0

->  gen we59=0

->  gen we60=0

->  gen we61=0

->  gen we62=0

->  gen we63=0

->  gen we64=0

->  gen we65=0
{com}. for num 18/65: mvdecode casX, mv(9)

{res}->  mvdecode cas18, mv(9)
       {txt}cas18:{res}{col 15}5768{txt} missing values generated

{res}->  mvdecode cas19, mv(9)
       {txt}cas19:{res}{col 15}5684{txt} missing values generated

{res}->  mvdecode cas20, mv(9)
       {txt}cas20:{res}{col 15}5668{txt} missing values generated

{res}->  mvdecode cas21, mv(9)
       {txt}cas21:{res}{col 15}5629{txt} missing values generated

{res}->  mvdecode cas22, mv(9)
       {txt}cas22:{res}{col 15}5614{txt} missing values generated

{res}->  mvdecode cas23, mv(9)
       {txt}cas23:{res}{col 15}5595{txt} missing values generated

{res}->  mvdecode cas24, mv(9)
       {txt}cas24:{res}{col 15}5617{txt} missing values generated

{res}->  mvdecode cas25, mv(9)
       {txt}cas25:{res}{col 15}5593{txt} missing values generated

{res}->  mvdecode cas26, mv(9)
       {txt}cas26:{res}{col 15}5637{txt} missing values generated

{res}->  mvdecode cas27, mv(9)
       {txt}cas27:{res}{col 15}5675{txt} missing values generated

{res}->  mvdecode cas28, mv(9)
       {txt}cas28:{res}{col 15}5672{txt} missing values generated

{res}->  mvdecode cas29, mv(9)
       {txt}cas29:{res}{col 15}5673{txt} missing values generated

{res}->  mvdecode cas30, mv(9)
       {txt}cas30:{res}{col 15}5673{txt} missing values generated

{res}->  mvdecode cas31, mv(9)
       {txt}cas31:{res}{col 15}5647{txt} missing values generated

{res}->  mvdecode cas32, mv(9)
       {txt}cas32:{res}{col 15}5639{txt} missing values generated

{res}->  mvdecode cas33, mv(9)
       {txt}cas33:{res}{col 15}5623{txt} missing values generated

{res}->  mvdecode cas34, mv(9)
       {txt}cas34:{res}{col 15}5603{txt} missing values generated

{res}->  mvdecode cas35, mv(9)
       {txt}cas35:{res}{col 15}5561{txt} missing values generated

{res}->  mvdecode cas36, mv(9)
       {txt}cas36:{res}{col 15}5550{txt} missing values generated

{res}->  mvdecode cas37, mv(9)
       {txt}cas37:{res}{col 15}5537{txt} missing values generated

{res}->  mvdecode cas38, mv(9)
       {txt}cas38:{res}{col 15}5510{txt} missing values generated

{res}->  mvdecode cas39, mv(9)
       {txt}cas39:{res}{col 15}5498{txt} missing values generated

{res}->  mvdecode cas40, mv(9)
       {txt}cas40:{res}{col 15}5487{txt} missing values generated

{res}->  mvdecode cas41, mv(9)
       {txt}cas41:{res}{col 15}5495{txt} missing values generated

{res}->  mvdecode cas42, mv(9)
       {txt}cas42:{res}{col 15}5480{txt} missing values generated

{res}->  mvdecode cas43, mv(9)
       {txt}cas43:{res}{col 15}5494{txt} missing values generated

{res}->  mvdecode cas44, mv(9)
       {txt}cas44:{res}{col 15}5494{txt} missing values generated

{res}->  mvdecode cas45, mv(9)
       {txt}cas45:{res}{col 15}5506{txt} missing values generated

{res}->  mvdecode cas46, mv(9)
       {txt}cas46:{res}{col 15}5535{txt} missing values generated

{res}->  mvdecode cas47, mv(9)
       {txt}cas47:{res}{col 15}5554{txt} missing values generated

{res}->  mvdecode cas48, mv(9)
       {txt}cas48:{res}{col 15}5560{txt} missing values generated

{res}->  mvdecode cas49, mv(9)
       {txt}cas49:{res}{col 15}5571{txt} missing values generated

{res}->  mvdecode cas50, mv(9)
       {txt}cas50:{res}{col 15}5595{txt} missing values generated

{res}->  mvdecode cas51, mv(9)
       {txt}cas51:{res}{col 15}5618{txt} missing values generated

{res}->  mvdecode cas52, mv(9)
       {txt}cas52:{res}{col 15}5651{txt} missing values generated

{res}->  mvdecode cas53, mv(9)
       {txt}cas53:{res}{col 15}5670{txt} missing values generated

{res}->  mvdecode cas54, mv(9)
       {txt}cas54:{res}{col 15}5684{txt} missing values generated

{res}->  mvdecode cas55, mv(9)
       {txt}cas55:{res}{col 15}5691{txt} missing values generated

{res}->  mvdecode cas56, mv(9)
       {txt}cas56:{res}{col 15}5702{txt} missing values generated

{res}->  mvdecode cas57, mv(9)
       {txt}cas57:{res}{col 15}5719{txt} missing values generated

{res}->  mvdecode cas58, mv(9)
       {txt}cas58:{res}{col 15}5729{txt} missing values generated

{res}->  mvdecode cas59, mv(9)
       {txt}cas59:{res}{col 15}5741{txt} missing values generated

{res}->  mvdecode cas60, mv(9)
       {txt}cas60:{res}{col 15}5745{txt} missing values generated

{res}->  mvdecode cas61, mv(9)
       {txt}cas61:{res}{col 15}5673{txt} missing values generated

{res}->  mvdecode cas62, mv(9)
       {txt}cas62:{res}{col 15}5705{txt} missing values generated

{res}->  mvdecode cas63, mv(9)
       {txt}cas63:{res}{col 15}5756{txt} missing values generated

{res}->  mvdecode cas64, mv(9)
       {txt}cas64:{res}{col 15}5805{txt} missing values generated

{res}->  mvdecode cas65, mv(9)
       {txt}cas65:{res}{col 15}5823{txt} missing values generated
{com}. for num 18/65: mvdecode regX, mv(9)

{res}->  mvdecode reg18, mv(9)
       {txt}reg18:{res}{col 15}4040{txt} missing values generated

{res}->  mvdecode reg19, mv(9)
       {txt}reg19:{res}{col 15}3492{txt} missing values generated

{res}->  mvdecode reg20, mv(9)
       {txt}reg20:{res}{col 15}3214{txt} missing values generated

{res}->  mvdecode reg21, mv(9)
       {txt}reg21:{res}{col 15}2774{txt} missing values generated

{res}->  mvdecode reg22, mv(9)
       {txt}reg22:{res}{col 15}2490{txt} missing values generated

{res}->  mvdecode reg23, mv(9)
       {txt}reg23:{res}{col 15}2129{txt} missing values generated

{res}->  mvdecode reg24, mv(9)
       {txt}reg24:{res}{col 15}2179{txt} missing values generated

{res}->  mvdecode reg25, mv(9)
       {txt}reg25:{res}{col 15}2365{txt} missing values generated

{res}->  mvdecode reg26, mv(9)
       {txt}reg26:{res}{col 15}2553{txt} missing values generated

{res}->  mvdecode reg27, mv(9)
       {txt}reg27:{res}{col 15}2708{txt} missing values generated

{res}->  mvdecode reg28, mv(9)
       {txt}reg28:{res}{col 15}2865{txt} missing values generated

{res}->  mvdecode reg29, mv(9)
       {txt}reg29:{res}{col 15}2991{txt} missing values generated

{res}->  mvdecode reg30, mv(9)
       {txt}reg30:{res}{col 15}3091{txt} missing values generated

{res}->  mvdecode reg31, mv(9)
       {txt}reg31:{res}{col 15}3206{txt} missing values generated

{res}->  mvdecode reg32, mv(9)
       {txt}reg32:{res}{col 15}3288{txt} missing values generated

{res}->  mvdecode reg33, mv(9)
       {txt}reg33:{res}{col 15}3351{txt} missing values generated

{res}->  mvdecode reg34, mv(9)
       {txt}reg34:{res}{col 15}3423{txt} missing values generated

{res}->  mvdecode reg35, mv(9)
       {txt}reg35:{res}{col 15}3482{txt} missing values generated

{res}->  mvdecode reg36, mv(9)
       {txt}reg36:{res}{col 15}3537{txt} missing values generated

{res}->  mvdecode reg37, mv(9)
       {txt}reg37:{res}{col 15}3608{txt} missing values generated

{res}->  mvdecode reg38, mv(9)
       {txt}reg38:{res}{col 15}3656{txt} missing values generated

{res}->  mvdecode reg39, mv(9)
       {txt}reg39:{res}{col 15}3700{txt} missing values generated

{res}->  mvdecode reg40, mv(9)
       {txt}reg40:{res}{col 15}3773{txt} missing values generated

{res}->  mvdecode reg41, mv(9)
       {txt}reg41:{res}{col 15}3837{txt} missing values generated

{res}->  mvdecode reg42, mv(9)
       {txt}reg42:{res}{col 15}3903{txt} missing values generated

{res}->  mvdecode reg43, mv(9)
       {txt}reg43:{res}{col 15}3952{txt} missing values generated

{res}->  mvdecode reg44, mv(9)
       {txt}reg44:{res}{col 15}4015{txt} missing values generated

{res}->  mvdecode reg45, mv(9)
       {txt}reg45:{res}{col 15}4057{txt} missing values generated

{res}->  mvdecode reg46, mv(9)
       {txt}reg46:{res}{col 15}4113{txt} missing values generated

{res}->  mvdecode reg47, mv(9)
       {txt}reg47:{res}{col 15}4185{txt} missing values generated

{res}->  mvdecode reg48, mv(9)
       {txt}reg48:{res}{col 15}4264{txt} missing values generated

{res}->  mvdecode reg49, mv(9)
       {txt}reg49:{res}{col 15}4323{txt} missing values generated

{res}->  mvdecode reg50, mv(9)
       {txt}reg50:{res}{col 15}4385{txt} missing values generated

{res}->  mvdecode reg51, mv(9)
       {txt}reg51:{res}{col 15}4484{txt} missing values generated

{res}->  mvdecode reg52, mv(9)
       {txt}reg52:{res}{col 15}4541{txt} missing values generated

{res}->  mvdecode reg53, mv(9)
       {txt}reg53:{res}{col 15}4622{txt} missing values generated

{res}->  mvdecode reg54, mv(9)
       {txt}reg54:{res}{col 15}4689{txt} missing values generated

{res}->  mvdecode reg55, mv(9)
       {txt}reg55:{res}{col 15}4762{txt} missing values generated

{res}->  mvdecode reg56, mv(9)
       {txt}reg56:{res}{col 15}4846{txt} missing values generated

{res}->  mvdecode reg57, mv(9)
       {txt}reg57:{res}{col 15}4909{txt} missing values generated

{res}->  mvdecode reg58, mv(9)
       {txt}reg58:{res}{col 15}4979{txt} missing values generated

{res}->  mvdecode reg59, mv(9)
       {txt}reg59:{res}{col 15}5076{txt} missing values generated

{res}->  mvdecode reg60, mv(9)
       {txt}reg60:{res}{col 15}5163{txt} missing values generated

{res}->  mvdecode reg61, mv(9)
       {txt}reg61:{res}{col 15}5581{txt} missing values generated

{res}->  mvdecode reg62, mv(9)
       {txt}reg62:{res}{col 15}5661{txt} missing values generated

{res}->  mvdecode reg63, mv(9)
       {txt}reg63:{res}{col 15}5750{txt} missing values generated

{res}->  mvdecode reg64, mv(9)
       {txt}reg64:{res}{col 15}5805{txt} missing values generated

{res}->  mvdecode reg65, mv(9)
       {txt}reg65:{res}{col 15}5837{txt} missing values generated
{com}. for num 18/65: mvdecode selfX, mv(9)

{res}->  mvdecode self18, mv(9)
      {txt}self18:{res}{col 15}5894{txt} missing values generated

{res}->  mvdecode self19, mv(9)
      {txt}self19:{res}{col 15}5866{txt} missing values generated

{res}->  mvdecode self20, mv(9)
      {txt}self20:{res}{col 15}5847{txt} missing values generated

{res}->  mvdecode self21, mv(9)
      {txt}self21:{res}{col 15}5803{txt} missing values generated

{res}->  mvdecode self22, mv(9)
      {txt}self22:{res}{col 15}5773{txt} missing values generated

{res}->  mvdecode self23, mv(9)
      {txt}self23:{res}{col 15}5732{txt} missing values generated

{res}->  mvdecode self24, mv(9)
      {txt}self24:{res}{col 15}5681{txt} missing values generated

{res}->  mvdecode self25, mv(9)
      {txt}self25:{res}{col 15}5650{txt} missing values generated

{res}->  mvdecode self26, mv(9)
      {txt}self26:{res}{col 15}5622{txt} missing values generated

{res}->  mvdecode self27, mv(9)
      {txt}self27:{res}{col 15}5594{txt} missing values generated

{res}->  mvdecode self28, mv(9)
      {txt}self28:{res}{col 15}5580{txt} missing values generated

{res}->  mvdecode self29, mv(9)
      {txt}self29:{res}{col 15}5548{txt} missing values generated

{res}->  mvdecode self30, mv(9)
      {txt}self30:{res}{col 15}5525{txt} missing values generated

{res}->  mvdecode self31, mv(9)
      {txt}self31:{res}{col 15}5492{txt} missing values generated

{res}->  mvdecode self32, mv(9)
      {txt}self32:{res}{col 15}5483{txt} missing values generated

{res}->  mvdecode self33, mv(9)
      {txt}self33:{res}{col 15}5462{txt} missing values generated

{res}->  mvdecode self34, mv(9)
      {txt}self34:{res}{col 15}5451{txt} missing values generated

{res}->  mvdecode self35, mv(9)
      {txt}self35:{res}{col 15}5444{txt} missing values generated

{res}->  mvdecode self36, mv(9)
      {txt}self36:{res}{col 15}5446{txt} missing values generated

{res}->  mvdecode self37, mv(9)
      {txt}self37:{res}{col 15}5450{txt} missing values generated

{res}->  mvdecode self38, mv(9)
      {txt}self38:{res}{col 15}5453{txt} missing values generated

{res}->  mvdecode self39, mv(9)
      {txt}self39:{res}{col 15}5458{txt} missing values generated

{res}->  mvdecode self40, mv(9)
      {txt}self40:{res}{col 15}5453{txt} missing values generated

{res}->  mvdecode self41, mv(9)
      {txt}self41:{res}{col 15}5454{txt} missing values generated

{res}->  mvdecode self42, mv(9)
      {txt}self42:{res}{col 15}5462{txt} missing values generated

{res}->  mvdecode self43, mv(9)
      {txt}self43:{res}{col 15}5465{txt} missing values generated

{res}->  mvdecode self44, mv(9)
      {txt}self44:{res}{col 15}5459{txt} missing values generated

{res}->  mvdecode self45, mv(9)
      {txt}self45:{res}{col 15}5464{txt} missing values generated

{res}->  mvdecode self46, mv(9)
      {txt}self46:{res}{col 15}5467{txt} missing values generated

{res}->  mvdecode self47, mv(9)
      {txt}self47:{res}{col 15}5475{txt} missing values generated

{res}->  mvdecode self48, mv(9)
      {txt}self48:{res}{col 15}5473{txt} missing values generated

{res}->  mvdecode self49, mv(9)
      {txt}self49:{res}{col 15}5481{txt} missing values generated

{res}->  mvdecode self50, mv(9)
      {txt}self50:{res}{col 15}5482{txt} missing values generated

{res}->  mvdecode self51, mv(9)
      {txt}self51:{res}{col 15}5490{txt} missing values generated

{res}->  mvdecode self52, mv(9)
      {txt}self52:{res}{col 15}5497{txt} missing values generated

{res}->  mvdecode self53, mv(9)
      {txt}self53:{res}{col 15}5514{txt} missing values generated

{res}->  mvdecode self54, mv(9)
      {txt}self54:{res}{col 15}5527{txt} missing values generated

{res}->  mvdecode self55, mv(9)
      {txt}self55:{res}{col 15}5539{txt} missing values generated

{res}->  mvdecode self56, mv(9)
      {txt}self56:{res}{col 15}5561{txt} missing values generated

{res}->  mvdecode self57, mv(9)
      {txt}self57:{res}{col 15}5587{txt} missing values generated

{res}->  mvdecode self58, mv(9)
      {txt}self58:{res}{col 15}5603{txt} missing values generated

{res}->  mvdecode self59, mv(9)
      {txt}self59:{res}{col 15}5622{txt} missing values generated

{res}->  mvdecode self60, mv(9)
      {txt}self60:{res}{col 15}5633{txt} missing values generated

{res}->  mvdecode self61, mv(9)
      {txt}self61:{res}{col 15}5653{txt} missing values generated

{res}->  mvdecode self62, mv(9)
      {txt}self62:{res}{col 15}5682{txt} missing values generated

{res}->  mvdecode self63, mv(9)
      {txt}self63:{res}{col 15}5728{txt} missing values generated

{res}->  mvdecode self64, mv(9)
      {txt}self64:{res}{col 15}5759{txt} missing values generated

{res}->  mvdecode self65, mv(9)
      {txt}self65:{res}{col 15}5780{txt} missing values generated
{com}. for num 18/65: mvdecode sideX, mv(9)

{res}->  mvdecode side18, mv(9)
      {txt}side18:{res}{col 15}6001{txt} missing values generated

{res}->  mvdecode side19, mv(9)
      {txt}side19:{res}{col 15}6000{txt} missing values generated

{res}->  mvdecode side20, mv(9)
      {txt}side20:{res}{col 15}5998{txt} missing values generated

{res}->  mvdecode side21, mv(9)
      {txt}side21:{res}{col 15}5992{txt} missing values generated

{res}->  mvdecode side22, mv(9)
      {txt}side22:{res}{col 15}5982{txt} missing values generated

{res}->  mvdecode side23, mv(9)
      {txt}side23:{res}{col 15}5976{txt} missing values generated

{res}->  mvdecode side24, mv(9)
      {txt}side24:{res}{col 15}5966{txt} missing values generated

{res}->  mvdecode side25, mv(9)
      {txt}side25:{res}{col 15}5963{txt} missing values generated

{res}->  mvdecode side26, mv(9)
      {txt}side26:{res}{col 15}5951{txt} missing values generated

{res}->  mvdecode side27, mv(9)
      {txt}side27:{res}{col 15}5943{txt} missing values generated

{res}->  mvdecode side28, mv(9)
      {txt}side28:{res}{col 15}5934{txt} missing values generated

{res}->  mvdecode side29, mv(9)
      {txt}side29:{res}{col 15}5920{txt} missing values generated

{res}->  mvdecode side30, mv(9)
      {txt}side30:{res}{col 15}5917{txt} missing values generated

{res}->  mvdecode side31, mv(9)
      {txt}side31:{res}{col 15}5904{txt} missing values generated

{res}->  mvdecode side32, mv(9)
      {txt}side32:{res}{col 15}5906{txt} missing values generated

{res}->  mvdecode side33, mv(9)
      {txt}side33:{res}{col 15}5903{txt} missing values generated

{res}->  mvdecode side34, mv(9)
      {txt}side34:{res}{col 15}5908{txt} missing values generated

{res}->  mvdecode side35, mv(9)
      {txt}side35:{res}{col 15}5913{txt} missing values generated

{res}->  mvdecode side36, mv(9)
      {txt}side36:{res}{col 15}5924{txt} missing values generated

{res}->  mvdecode side37, mv(9)
      {txt}side37:{res}{col 15}5933{txt} missing values generated

{res}->  mvdecode side38, mv(9)
      {txt}side38:{res}{col 15}5933{txt} missing values generated

{res}->  mvdecode side39, mv(9)
      {txt}side39:{res}{col 15}5939{txt} missing values generated

{res}->  mvdecode side40, mv(9)
      {txt}side40:{res}{col 15}5939{txt} missing values generated

{res}->  mvdecode side41, mv(9)
      {txt}side41:{res}{col 15}5941{txt} missing values generated

{res}->  mvdecode side42, mv(9)
      {txt}side42:{res}{col 15}5942{txt} missing values generated

{res}->  mvdecode side43, mv(9)
      {txt}side43:{res}{col 15}5952{txt} missing values generated

{res}->  mvdecode side44, mv(9)
      {txt}side44:{res}{col 15}5953{txt} missing values generated

{res}->  mvdecode side45, mv(9)
      {txt}side45:{res}{col 15}5955{txt} missing values generated

{res}->  mvdecode side46, mv(9)
      {txt}side46:{res}{col 15}5956{txt} missing values generated

{res}->  mvdecode side47, mv(9)
      {txt}side47:{res}{col 15}5956{txt} missing values generated

{res}->  mvdecode side48, mv(9)
      {txt}side48:{res}{col 15}5955{txt} missing values generated

{res}->  mvdecode side49, mv(9)
      {txt}side49:{res}{col 15}5960{txt} missing values generated

{res}->  mvdecode side50, mv(9)
      {txt}side50:{res}{col 15}5967{txt} missing values generated

{res}->  mvdecode side51, mv(9)
      {txt}side51:{res}{col 15}5972{txt} missing values generated

{res}->  mvdecode side52, mv(9)
      {txt}side52:{res}{col 15}5973{txt} missing values generated

{res}->  mvdecode side53, mv(9)
      {txt}side53:{res}{col 15}5978{txt} missing values generated

{res}->  mvdecode side54, mv(9)
      {txt}side54:{res}{col 15}5979{txt} missing values generated

{res}->  mvdecode side55, mv(9)
      {txt}side55:{res}{col 15}5979{txt} missing values generated

{res}->  mvdecode side56, mv(9)
      {txt}side56:{res}{col 15}5982{txt} missing values generated

{res}->  mvdecode side57, mv(9)
      {txt}side57:{res}{col 15}5983{txt} missing values generated

{res}->  mvdecode side58, mv(9)
      {txt}side58:{res}{col 15}5983{txt} missing values generated

{res}->  mvdecode side59, mv(9)
      {txt}side59:{res}{col 15}5985{txt} missing values generated

{res}->  mvdecode side60, mv(9)
      {txt}side60:{res}{col 15}5991{txt} missing values generated

{res}->  mvdecode side61, mv(9)
      {txt}side61:{res}{col 15}5994{txt} missing values generated

{res}->  mvdecode side62, mv(9)
      {txt}side62:{res}{col 15}5992{txt} missing values generated

{res}->  mvdecode side63, mv(9)
      {txt}side63:{res}{col 15}5992{txt} missing values generated

{res}->  mvdecode side64, mv(9)
      {txt}side64:{res}{col 15}5992{txt} missing values generated

{res}->  mvdecode side65, mv(9)
      {txt}side65:{res}{col 15}5991{txt} missing values generated
{com}. for num 18/65: mvdecode fmwX, mv(9)

{res}->  mvdecode fmw18, mv(9)
       {txt}fmw18:{res}{col 15}5915{txt} missing values generated

{res}->  mvdecode fmw19, mv(9)
       {txt}fmw19:{res}{col 15}5885{txt} missing values generated

{res}->  mvdecode fmw20, mv(9)
       {txt}fmw20:{res}{col 15}5861{txt} missing values generated

{res}->  mvdecode fmw21, mv(9)
       {txt}fmw21:{res}{col 15}5828{txt} missing values generated

{res}->  mvdecode fmw22, mv(9)
       {txt}fmw22:{res}{col 15}5798{txt} missing values generated

{res}->  mvdecode fmw23, mv(9)
       {txt}fmw23:{res}{col 15}5752{txt} missing values generated

{res}->  mvdecode fmw24, mv(9)
       {txt}fmw24:{res}{col 15}5709{txt} missing values generated

{res}->  mvdecode fmw25, mv(9)
       {txt}fmw25:{res}{col 15}5679{txt} missing values generated

{res}->  mvdecode fmw26, mv(9)
       {txt}fmw26:{res}{col 15}5655{txt} missing values generated

{res}->  mvdecode fmw27, mv(9)
       {txt}fmw27:{res}{col 15}5630{txt} missing values generated

{res}->  mvdecode fmw28, mv(9)
       {txt}fmw28:{res}{col 15}5621{txt} missing values generated

{res}->  mvdecode fmw29, mv(9)
       {txt}fmw29:{res}{col 15}5616{txt} missing values generated

{res}->  mvdecode fmw30, mv(9)
       {txt}fmw30:{res}{col 15}5616{txt} missing values generated

{res}->  mvdecode fmw31, mv(9)
       {txt}fmw31:{res}{col 15}5618{txt} missing values generated

{res}->  mvdecode fmw32, mv(9)
       {txt}fmw32:{res}{col 15}5611{txt} missing values generated

{res}->  mvdecode fmw33, mv(9)
       {txt}fmw33:{res}{col 15}5618{txt} missing values generated

{res}->  mvdecode fmw34, mv(9)
       {txt}fmw34:{res}{col 15}5622{txt} missing values generated

{res}->  mvdecode fmw35, mv(9)
       {txt}fmw35:{res}{col 15}5631{txt} missing values generated

{res}->  mvdecode fmw36, mv(9)
       {txt}fmw36:{res}{col 15}5641{txt} missing values generated

{res}->  mvdecode fmw37, mv(9)
       {txt}fmw37:{res}{col 15}5653{txt} missing values generated

{res}->  mvdecode fmw38, mv(9)
       {txt}fmw38:{res}{col 15}5661{txt} missing values generated

{res}->  mvdecode fmw39, mv(9)
       {txt}fmw39:{res}{col 15}5673{txt} missing values generated

{res}->  mvdecode fmw40, mv(9)
       {txt}fmw40:{res}{col 15}5689{txt} missing values generated

{res}->  mvdecode fmw41, mv(9)
       {txt}fmw41:{res}{col 15}5703{txt} missing values generated

{res}->  mvdecode fmw42, mv(9)
       {txt}fmw42:{res}{col 15}5718{txt} missing values generated

{res}->  mvdecode fmw43, mv(9)
       {txt}fmw43:{res}{col 15}5730{txt} missing values generated

{res}->  mvdecode fmw44, mv(9)
       {txt}fmw44:{res}{col 15}5734{txt} missing values generated

{res}->  mvdecode fmw45, mv(9)
       {txt}fmw45:{res}{col 15}5742{txt} missing values generated

{res}->  mvdecode fmw46, mv(9)
       {txt}fmw46:{res}{col 15}5749{txt} missing values generated

{res}->  mvdecode fmw47, mv(9)
       {txt}fmw47:{res}{col 15}5751{txt} missing values generated

{res}->  mvdecode fmw48, mv(9)
       {txt}fmw48:{res}{col 15}5761{txt} missing values generated

{res}->  mvdecode fmw49, mv(9)
       {txt}fmw49:{res}{col 15}5769{txt} missing values generated

{res}->  mvdecode fmw50, mv(9)
       {txt}fmw50:{res}{col 15}5774{txt} missing values generated

{res}->  mvdecode fmw51, mv(9)
       {txt}fmw51:{res}{col 15}5780{txt} missing values generated

{res}->  mvdecode fmw52, mv(9)
       {txt}fmw52:{res}{col 15}5786{txt} missing values generated

{res}->  mvdecode fmw53, mv(9)
       {txt}fmw53:{res}{col 15}5796{txt} missing values generated

{res}->  mvdecode fmw54, mv(9)
       {txt}fmw54:{res}{col 15}5803{txt} missing values generated

{res}->  mvdecode fmw55, mv(9)
       {txt}fmw55:{res}{col 15}5817{txt} missing values generated

{res}->  mvdecode fmw56, mv(9)
       {txt}fmw56:{res}{col 15}5830{txt} missing values generated

{res}->  mvdecode fmw57, mv(9)
       {txt}fmw57:{res}{col 15}5832{txt} missing values generated

{res}->  mvdecode fmw58, mv(9)
       {txt}fmw58:{res}{col 15}5843{txt} missing values generated

{res}->  mvdecode fmw59, mv(9)
       {txt}fmw59:{res}{col 15}5850{txt} missing values generated

{res}->  mvdecode fmw60, mv(9)
       {txt}fmw60:{res}{col 15}5856{txt} missing values generated

{res}->  mvdecode fmw61, mv(9)
       {txt}fmw61:{res}{col 15}5859{txt} missing values generated

{res}->  mvdecode fmw62, mv(9)
       {txt}fmw62:{res}{col 15}5876{txt} missing values generated

{res}->  mvdecode fmw63, mv(9)
       {txt}fmw63:{res}{col 15}5895{txt} missing values generated

{res}->  mvdecode fmw64, mv(9)
       {txt}fmw64:{res}{col 15}5905{txt} missing values generated

{res}->  mvdecode fmw65, mv(9)
       {txt}fmw65:{res}{col 15}5911{txt} missing values generated
{com}. for num 18/65: replace weX=1 if casX!=. | regX!=. | selfX!=. | sideX!=. | fmwX!=. 

{res}->  replace we18=1 if cas18!=. | reg18!=. | self18!=. | side18!=. | fmw18!=.
{txt}(2,424 real changes made)

{res}->  replace we19=1 if cas19!=. | reg19!=. | self19!=. | side19!=. | fmw19!=.
{txt}(3,103 real changes made)

{res}->  replace we20=1 if cas20!=. | reg20!=. | self20!=. | side20!=. | fmw20!=.
{txt}(3,444 real changes made)

{res}->  replace we21=1 if cas21!=. | reg21!=. | self21!=. | side21!=. | fmw21!=.
{txt}(4,004 real changes made)

{res}->  replace we22=1 if cas22!=. | reg22!=. | self22!=. | side22!=. | fmw22!=.
{txt}(4,359 real changes made)

{res}->  replace we23=1 if cas23!=. | reg23!=. | self23!=. | side23!=. | fmw23!=.
{txt}(4,832 real changes made)

{res}->  replace we24=1 if cas24!=. | reg24!=. | self24!=. | side24!=. | fmw24!=.
{txt}(4,859 real changes made)

{res}->  replace we25=1 if cas25!=. | reg25!=. | self25!=. | side25!=. | fmw25!=.
{txt}(4,761 real changes made)

{res}->  replace we26=1 if cas26!=. | reg26!=. | self26!=. | side26!=. | fmw26!=.
{txt}(4,601 real changes made)

{res}->  replace we27=1 if cas27!=. | reg27!=. | self27!=. | side27!=. | fmw27!=.
{txt}(4,469 real changes made)

{res}->  replace we28=1 if cas28!=. | reg28!=. | self28!=. | side28!=. | fmw28!=.
{txt}(4,349 real changes made)

{res}->  replace we29=1 if cas29!=. | reg29!=. | self29!=. | side29!=. | fmw29!=.
{txt}(4,281 real changes made)

{res}->  replace we30=1 if cas30!=. | reg30!=. | self30!=. | side30!=. | fmw30!=.
{txt}(4,203 real changes made)

{res}->  replace we31=1 if cas31!=. | reg31!=. | self31!=. | side31!=. | fmw31!=.
{txt}(4,157 real changes made)

{res}->  replace we32=1 if cas32!=. | reg32!=. | self32!=. | side32!=. | fmw32!=.
{txt}(4,097 real changes made)

{res}->  replace we33=1 if cas33!=. | reg33!=. | self33!=. | side33!=. | fmw33!=.
{txt}(4,057 real changes made)

{res}->  replace we34=1 if cas34!=. | reg34!=. | self34!=. | side34!=. | fmw34!=.
{txt}(4,014 real changes made)

{res}->  replace we35=1 if cas35!=. | reg35!=. | self35!=. | side35!=. | fmw35!=.
{txt}(3,989 real changes made)

{res}->  replace we36=1 if cas36!=. | reg36!=. | self36!=. | side36!=. | fmw36!=.
{txt}(3,925 real changes made)

{res}->  replace we37=1 if cas37!=. | reg37!=. | self37!=. | side37!=. | fmw37!=.
{txt}(3,846 real changes made)

{res}->  replace we38=1 if cas38!=. | reg38!=. | self38!=. | side38!=. | fmw38!=.
{txt}(3,807 real changes made)

{res}->  replace we39=1 if cas39!=. | reg39!=. | self39!=. | side39!=. | fmw39!=.
{txt}(3,758 real changes made)

{res}->  replace we40=1 if cas40!=. | reg40!=. | self40!=. | side40!=. | fmw40!=.
{txt}(3,685 real changes made)

{res}->  replace we41=1 if cas41!=. | reg41!=. | self41!=. | side41!=. | fmw41!=.
{txt}(3,599 real changes made)

{res}->  replace we42=1 if cas42!=. | reg42!=. | self42!=. | side42!=. | fmw42!=.
{txt}(3,523 real changes made)

{res}->  replace we43=1 if cas43!=. | reg43!=. | self43!=. | side43!=. | fmw43!=.
{txt}(3,438 real changes made)

{res}->  replace we44=1 if cas44!=. | reg44!=. | self44!=. | side44!=. | fmw44!=.
{txt}(3,373 real changes made)

{res}->  replace we45=1 if cas45!=. | reg45!=. | self45!=. | side45!=. | fmw45!=.
{txt}(3,307 real changes made)

{res}->  replace we46=1 if cas46!=. | reg46!=. | self46!=. | side46!=. | fmw46!=.
{txt}(3,212 real changes made)

{res}->  replace we47=1 if cas47!=. | reg47!=. | self47!=. | side47!=. | fmw47!=.
{txt}(3,109 real changes made)

{res}->  replace we48=1 if cas48!=. | reg48!=. | self48!=. | side48!=. | fmw48!=.
{txt}(3,014 real changes made)

{res}->  replace we49=1 if cas49!=. | reg49!=. | self49!=. | side49!=. | fmw49!=.
{txt}(2,923 real changes made)

{res}->  replace we50=1 if cas50!=. | reg50!=. | self50!=. | side50!=. | fmw50!=.
{txt}(2,827 real changes made)

{res}->  replace we51=1 if cas51!=. | reg51!=. | self51!=. | side51!=. | fmw51!=.
{txt}(2,686 real changes made)

{res}->  replace we52=1 if cas52!=. | reg52!=. | self52!=. | side52!=. | fmw52!=.
{txt}(2,580 real changes made)

{res}->  replace we53=1 if cas53!=. | reg53!=. | self53!=. | side53!=. | fmw53!=.
{txt}(2,452 real changes made)

{res}->  replace we54=1 if cas54!=. | reg54!=. | self54!=. | side54!=. | fmw54!=.
{txt}(2,349 real changes made)

{res}->  replace we55=1 if cas55!=. | reg55!=. | self55!=. | side55!=. | fmw55!=.
{txt}(2,243 real changes made)

{res}->  replace we56=1 if cas56!=. | reg56!=. | self56!=. | side56!=. | fmw56!=.
{txt}(2,113 real changes made)

{res}->  replace we57=1 if cas57!=. | reg57!=. | self57!=. | side57!=. | fmw57!=.
{txt}(2,002 real changes made)

{res}->  replace we58=1 if cas58!=. | reg58!=. | self58!=. | side58!=. | fmw58!=.
{txt}(1,895 real changes made)

{res}->  replace we59=1 if cas59!=. | reg59!=. | self59!=. | side59!=. | fmw59!=.
{txt}(1,762 real changes made)

{res}->  replace we60=1 if cas60!=. | reg60!=. | self60!=. | side60!=. | fmw60!=.
{txt}(1,646 real changes made)

{res}->  replace we61=1 if cas61!=. | reg61!=. | self61!=. | side61!=. | fmw61!=.
{txt}(1,280 real changes made)

{res}->  replace we62=1 if cas62!=. | reg62!=. | self62!=. | side62!=. | fmw62!=.
{txt}(1,126 real changes made)

{res}->  replace we63=1 if cas63!=. | reg63!=. | self63!=. | side63!=. | fmw63!=.
{txt}(922 real changes made)

{res}->  replace we64=1 if cas64!=. | reg64!=. | self64!=. | side64!=. | fmw64!=.
{txt}(779 real changes made)

{res}->  replace we65=1 if cas65!=. | reg65!=. | self65!=. | side65!=. | fmw65!=.
{txt}(701 real changes made)
{com}. egen workexp2010=rowtotal(we18-we65)
. keep id workexp2010 year
. sort id
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\WorkexpJHPS.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\WorkexpJHPS.dta saved
{com}. 
. *** KHPS労働経験年数
. ***** old cohort
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2004.dta", clear
. for num 18/65: gen weX=0

{res}->  gen we18=0

->  gen we19=0

->  gen we20=0

->  gen we21=0

->  gen we22=0

->  gen we23=0

->  gen we24=0

->  gen we25=0

->  gen we26=0

->  gen we27=0

->  gen we28=0

->  gen we29=0

->  gen we30=0

->  gen we31=0

->  gen we32=0

->  gen we33=0

->  gen we34=0

->  gen we35=0

->  gen we36=0

->  gen we37=0

->  gen we38=0

->  gen we39=0

->  gen we40=0

->  gen we41=0

->  gen we42=0

->  gen we43=0

->  gen we44=0

->  gen we45=0

->  gen we46=0

->  gen we47=0

->  gen we48=0

->  gen we49=0

->  gen we50=0

->  gen we51=0

->  gen we52=0

->  gen we53=0

->  gen we54=0

->  gen we55=0

->  gen we56=0

->  gen we57=0

->  gen we58=0

->  gen we59=0

->  gen we60=0

->  gen we61=0

->  gen we62=0

->  gen we63=0

->  gen we64=0

->  gen we65=0
{com}. for num 18/65: mvdecode casX, mv(9)

{res}->  mvdecode cas18, mv(9)
       {txt}cas18:{res}{col 15}6601{txt} missing values generated

{res}->  mvdecode cas19, mv(9)
       {txt}cas19:{res}{col 15}6529{txt} missing values generated

{res}->  mvdecode cas20, mv(9)
       {txt}cas20:{res}{col 15}6506{txt} missing values generated

{res}->  mvdecode cas21, mv(9)
       {txt}cas21:{res}{col 15}6497{txt} missing values generated

{res}->  mvdecode cas22, mv(9)
       {txt}cas22:{res}{col 15}6493{txt} missing values generated

{res}->  mvdecode cas23, mv(9)
       {txt}cas23:{res}{col 15}6465{txt} missing values generated

{res}->  mvdecode cas24, mv(9)
       {txt}cas24:{res}{col 15}6482{txt} missing values generated

{res}->  mvdecode cas25, mv(9)
       {txt}cas25:{res}{col 15}6515{txt} missing values generated

{res}->  mvdecode cas26, mv(9)
       {txt}cas26:{res}{col 15}6517{txt} missing values generated

{res}->  mvdecode cas27, mv(9)
       {txt}cas27:{res}{col 15}6529{txt} missing values generated

{res}->  mvdecode cas28, mv(9)
       {txt}cas28:{res}{col 15}6554{txt} missing values generated

{res}->  mvdecode cas29, mv(9)
       {txt}cas29:{res}{col 15}6557{txt} missing values generated

{res}->  mvdecode cas30, mv(9)
       {txt}cas30:{res}{col 15}6580{txt} missing values generated

{res}->  mvdecode cas31, mv(9)
       {txt}cas31:{res}{col 15}6578{txt} missing values generated

{res}->  mvdecode cas32, mv(9)
       {txt}cas32:{res}{col 15}6558{txt} missing values generated

{res}->  mvdecode cas33, mv(9)
       {txt}cas33:{res}{col 15}6547{txt} missing values generated

{res}->  mvdecode cas34, mv(9)
       {txt}cas34:{res}{col 15}6538{txt} missing values generated

{res}->  mvdecode cas35, mv(9)
       {txt}cas35:{res}{col 15}6539{txt} missing values generated

{res}->  mvdecode cas36, mv(9)
       {txt}cas36:{res}{col 15}6528{txt} missing values generated

{res}->  mvdecode cas37, mv(9)
       {txt}cas37:{res}{col 15}6514{txt} missing values generated

{res}->  mvdecode cas38, mv(9)
       {txt}cas38:{res}{col 15}6490{txt} missing values generated

{res}->  mvdecode cas39, mv(9)
       {txt}cas39:{res}{col 15}6482{txt} missing values generated

{res}->  mvdecode cas40, mv(9)
       {txt}cas40:{res}{col 15}6463{txt} missing values generated

{res}->  mvdecode cas41, mv(9)
       {txt}cas41:{res}{col 15}6454{txt} missing values generated

{res}->  mvdecode cas42, mv(9)
       {txt}cas42:{res}{col 15}6448{txt} missing values generated

{res}->  mvdecode cas43, mv(9)
       {txt}cas43:{res}{col 15}6453{txt} missing values generated

{res}->  mvdecode cas44, mv(9)
       {txt}cas44:{res}{col 15}6475{txt} missing values generated

{res}->  mvdecode cas45, mv(9)
       {txt}cas45:{res}{col 15}6471{txt} missing values generated

{res}->  mvdecode cas46, mv(9)
       {txt}cas46:{res}{col 15}6479{txt} missing values generated

{res}->  mvdecode cas47, mv(9)
       {txt}cas47:{res}{col 15}6499{txt} missing values generated

{res}->  mvdecode cas48, mv(9)
       {txt}cas48:{res}{col 15}6518{txt} missing values generated

{res}->  mvdecode cas49, mv(9)
       {txt}cas49:{res}{col 15}6533{txt} missing values generated

{res}->  mvdecode cas50, mv(9)
       {txt}cas50:{res}{col 15}6565{txt} missing values generated

{res}->  mvdecode cas51, mv(9)
       {txt}cas51:{res}{col 15}6590{txt} missing values generated

{res}->  mvdecode cas52, mv(9)
       {txt}cas52:{res}{col 15}6617{txt} missing values generated

{res}->  mvdecode cas53, mv(9)
       {txt}cas53:{res}{col 15}6651{txt} missing values generated

{res}->  mvdecode cas54, mv(9)
       {txt}cas54:{res}{col 15}6681{txt} missing values generated

{res}->  mvdecode cas55, mv(9)
       {txt}cas55:{res}{col 15}6699{txt} missing values generated

{res}->  mvdecode cas56, mv(9)
       {txt}cas56:{res}{col 15}6731{txt} missing values generated

{res}->  mvdecode cas57, mv(9)
       {txt}cas57:{res}{col 15}6755{txt} missing values generated

{res}->  mvdecode cas58, mv(9)
       {txt}cas58:{res}{col 15}6765{txt} missing values generated

{res}->  mvdecode cas59, mv(9)
       {txt}cas59:{res}{col 15}6785{txt} missing values generated

{res}->  mvdecode cas60, mv(9)
       {txt}cas60:{res}{col 15}6795{txt} missing values generated

{res}->  mvdecode cas61, mv(9)
       {txt}cas61:{res}{col 15}6794{txt} missing values generated

{res}->  mvdecode cas62, mv(9)
       {txt}cas62:{res}{col 15}6807{txt} missing values generated

{res}->  mvdecode cas63, mv(9)
       {txt}cas63:{res}{col 15}6824{txt} missing values generated

{res}->  mvdecode cas64, mv(9)
       {txt}cas64:{res}{col 15}6840{txt} missing values generated

{res}->  mvdecode cas65, mv(9)
       {txt}cas65:{res}{col 15}6866{txt} missing values generated
{com}. for num 18/65: mvdecode regX, mv(9)

{res}->  mvdecode reg18, mv(9)
       {txt}reg18:{res}{col 15}4391{txt} missing values generated

{res}->  mvdecode reg19, mv(9)
       {txt}reg19:{res}{col 15}3830{txt} missing values generated

{res}->  mvdecode reg20, mv(9)
       {txt}reg20:{res}{col 15}3536{txt} missing values generated

{res}->  mvdecode reg21, mv(9)
       {txt}reg21:{res}{col 15}3102{txt} missing values generated

{res}->  mvdecode reg22, mv(9)
       {txt}reg22:{res}{col 15}2895{txt} missing values generated

{res}->  mvdecode reg23, mv(9)
       {txt}reg23:{res}{col 15}2556{txt} missing values generated

{res}->  mvdecode reg24, mv(9)
       {txt}reg24:{res}{col 15}2686{txt} missing values generated

{res}->  mvdecode reg25, mv(9)
       {txt}reg25:{res}{col 15}2900{txt} missing values generated

{res}->  mvdecode reg26, mv(9)
       {txt}reg26:{res}{col 15}3131{txt} missing values generated

{res}->  mvdecode reg27, mv(9)
       {txt}reg27:{res}{col 15}3336{txt} missing values generated

{res}->  mvdecode reg28, mv(9)
       {txt}reg28:{res}{col 15}3544{txt} missing values generated

{res}->  mvdecode reg29, mv(9)
       {txt}reg29:{res}{col 15}3705{txt} missing values generated

{res}->  mvdecode reg30, mv(9)
       {txt}reg30:{res}{col 15}3812{txt} missing values generated

{res}->  mvdecode reg31, mv(9)
       {txt}reg31:{res}{col 15}3961{txt} missing values generated

{res}->  mvdecode reg32, mv(9)
       {txt}reg32:{res}{col 15}4043{txt} missing values generated

{res}->  mvdecode reg33, mv(9)
       {txt}reg33:{res}{col 15}4139{txt} missing values generated

{res}->  mvdecode reg34, mv(9)
       {txt}reg34:{res}{col 15}4208{txt} missing values generated

{res}->  mvdecode reg35, mv(9)
       {txt}reg35:{res}{col 15}4267{txt} missing values generated

{res}->  mvdecode reg36, mv(9)
       {txt}reg36:{res}{col 15}4354{txt} missing values generated

{res}->  mvdecode reg37, mv(9)
       {txt}reg37:{res}{col 15}4429{txt} missing values generated

{res}->  mvdecode reg38, mv(9)
       {txt}reg38:{res}{col 15}4486{txt} missing values generated

{res}->  mvdecode reg39, mv(9)
       {txt}reg39:{res}{col 15}4553{txt} missing values generated

{res}->  mvdecode reg40, mv(9)
       {txt}reg40:{res}{col 15}4622{txt} missing values generated

{res}->  mvdecode reg41, mv(9)
       {txt}reg41:{res}{col 15}4731{txt} missing values generated

{res}->  mvdecode reg42, mv(9)
       {txt}reg42:{res}{col 15}4799{txt} missing values generated

{res}->  mvdecode reg43, mv(9)
       {txt}reg43:{res}{col 15}4869{txt} missing values generated

{res}->  mvdecode reg44, mv(9)
       {txt}reg44:{res}{col 15}4929{txt} missing values generated

{res}->  mvdecode reg45, mv(9)
       {txt}reg45:{res}{col 15}4991{txt} missing values generated

{res}->  mvdecode reg46, mv(9)
       {txt}reg46:{res}{col 15}5087{txt} missing values generated

{res}->  mvdecode reg47, mv(9)
       {txt}reg47:{res}{col 15}5155{txt} missing values generated

{res}->  mvdecode reg48, mv(9)
       {txt}reg48:{res}{col 15}5243{txt} missing values generated

{res}->  mvdecode reg49, mv(9)
       {txt}reg49:{res}{col 15}5322{txt} missing values generated

{res}->  mvdecode reg50, mv(9)
       {txt}reg50:{res}{col 15}5396{txt} missing values generated

{res}->  mvdecode reg51, mv(9)
       {txt}reg51:{res}{col 15}5513{txt} missing values generated

{res}->  mvdecode reg52, mv(9)
       {txt}reg52:{res}{col 15}5584{txt} missing values generated

{res}->  mvdecode reg53, mv(9)
       {txt}reg53:{res}{col 15}5693{txt} missing values generated

{res}->  mvdecode reg54, mv(9)
       {txt}reg54:{res}{col 15}5760{txt} missing values generated

{res}->  mvdecode reg55, mv(9)
       {txt}reg55:{res}{col 15}5887{txt} missing values generated

{res}->  mvdecode reg56, mv(9)
       {txt}reg56:{res}{col 15}6002{txt} missing values generated

{res}->  mvdecode reg57, mv(9)
       {txt}reg57:{res}{col 15}6089{txt} missing values generated

{res}->  mvdecode reg58, mv(9)
       {txt}reg58:{res}{col 15}6161{txt} missing values generated

{res}->  mvdecode reg59, mv(9)
       {txt}reg59:{res}{col 15}6247{txt} missing values generated

{res}->  mvdecode reg60, mv(9)
       {txt}reg60:{res}{col 15}6308{txt} missing values generated

{res}->  mvdecode reg61, mv(9)
       {txt}reg61:{res}{col 15}6604{txt} missing values generated

{res}->  mvdecode reg62, mv(9)
       {txt}reg62:{res}{col 15}6662{txt} missing values generated

{res}->  mvdecode reg63, mv(9)
       {txt}reg63:{res}{col 15}6726{txt} missing values generated

{res}->  mvdecode reg64, mv(9)
       {txt}reg64:{res}{col 15}6784{txt} missing values generated

{res}->  mvdecode reg65, mv(9)
       {txt}reg65:{res}{col 15}6810{txt} missing values generated
{com}. for num 18/65: mvdecode selfX, mv(9)

{res}->  mvdecode self18, mv(9)
      {txt}self18:{res}{col 15}6739{txt} missing values generated

{res}->  mvdecode self19, mv(9)
      {txt}self19:{res}{col 15}6701{txt} missing values generated

{res}->  mvdecode self20, mv(9)
      {txt}self20:{res}{col 15}6664{txt} missing values generated

{res}->  mvdecode self21, mv(9)
      {txt}self21:{res}{col 15}6611{txt} missing values generated

{res}->  mvdecode self22, mv(9)
      {txt}self22:{res}{col 15}6559{txt} missing values generated

{res}->  mvdecode self23, mv(9)
      {txt}self23:{res}{col 15}6499{txt} missing values generated

{res}->  mvdecode self24, mv(9)
      {txt}self24:{res}{col 15}6457{txt} missing values generated

{res}->  mvdecode self25, mv(9)
      {txt}self25:{res}{col 15}6415{txt} missing values generated

{res}->  mvdecode self26, mv(9)
      {txt}self26:{res}{col 15}6382{txt} missing values generated

{res}->  mvdecode self27, mv(9)
      {txt}self27:{res}{col 15}6358{txt} missing values generated

{res}->  mvdecode self28, mv(9)
      {txt}self28:{res}{col 15}6332{txt} missing values generated

{res}->  mvdecode self29, mv(9)
      {txt}self29:{res}{col 15}6307{txt} missing values generated

{res}->  mvdecode self30, mv(9)
      {txt}self30:{res}{col 15}6284{txt} missing values generated

{res}->  mvdecode self31, mv(9)
      {txt}self31:{res}{col 15}6267{txt} missing values generated

{res}->  mvdecode self32, mv(9)
      {txt}self32:{res}{col 15}6262{txt} missing values generated

{res}->  mvdecode self33, mv(9)
      {txt}self33:{res}{col 15}6261{txt} missing values generated

{res}->  mvdecode self34, mv(9)
      {txt}self34:{res}{col 15}6250{txt} missing values generated

{res}->  mvdecode self35, mv(9)
      {txt}self35:{res}{col 15}6251{txt} missing values generated

{res}->  mvdecode self36, mv(9)
      {txt}self36:{res}{col 15}6249{txt} missing values generated

{res}->  mvdecode self37, mv(9)
      {txt}self37:{res}{col 15}6251{txt} missing values generated

{res}->  mvdecode self38, mv(9)
      {txt}self38:{res}{col 15}6255{txt} missing values generated

{res}->  mvdecode self39, mv(9)
      {txt}self39:{res}{col 15}6259{txt} missing values generated

{res}->  mvdecode self40, mv(9)
      {txt}self40:{res}{col 15}6259{txt} missing values generated

{res}->  mvdecode self41, mv(9)
      {txt}self41:{res}{col 15}6261{txt} missing values generated

{res}->  mvdecode self42, mv(9)
      {txt}self42:{res}{col 15}6261{txt} missing values generated

{res}->  mvdecode self43, mv(9)
      {txt}self43:{res}{col 15}6268{txt} missing values generated

{res}->  mvdecode self44, mv(9)
      {txt}self44:{res}{col 15}6284{txt} missing values generated

{res}->  mvdecode self45, mv(9)
      {txt}self45:{res}{col 15}6290{txt} missing values generated

{res}->  mvdecode self46, mv(9)
      {txt}self46:{res}{col 15}6327{txt} missing values generated

{res}->  mvdecode self47, mv(9)
      {txt}self47:{res}{col 15}6339{txt} missing values generated

{res}->  mvdecode self48, mv(9)
      {txt}self48:{res}{col 15}6357{txt} missing values generated

{res}->  mvdecode self49, mv(9)
      {txt}self49:{res}{col 15}6366{txt} missing values generated

{res}->  mvdecode self50, mv(9)
      {txt}self50:{res}{col 15}6390{txt} missing values generated

{res}->  mvdecode self51, mv(9)
      {txt}self51:{res}{col 15}6422{txt} missing values generated

{res}->  mvdecode self52, mv(9)
      {txt}self52:{res}{col 15}6446{txt} missing values generated

{res}->  mvdecode self53, mv(9)
      {txt}self53:{res}{col 15}6467{txt} missing values generated

{res}->  mvdecode self54, mv(9)
      {txt}self54:{res}{col 15}6506{txt} missing values generated

{res}->  mvdecode self55, mv(9)
      {txt}self55:{res}{col 15}6533{txt} missing values generated

{res}->  mvdecode self56, mv(9)
      {txt}self56:{res}{col 15}6568{txt} missing values generated

{res}->  mvdecode self57, mv(9)
      {txt}self57:{res}{col 15}6606{txt} missing values generated

{res}->  mvdecode self58, mv(9)
      {txt}self58:{res}{col 15}6634{txt} missing values generated

{res}->  mvdecode self59, mv(9)
      {txt}self59:{res}{col 15}6642{txt} missing values generated

{res}->  mvdecode self60, mv(9)
      {txt}self60:{res}{col 15}6654{txt} missing values generated

{res}->  mvdecode self61, mv(9)
      {txt}self61:{res}{col 15}6699{txt} missing values generated

{res}->  mvdecode self62, mv(9)
      {txt}self62:{res}{col 15}6733{txt} missing values generated

{res}->  mvdecode self63, mv(9)
      {txt}self63:{res}{col 15}6758{txt} missing values generated

{res}->  mvdecode self64, mv(9)
      {txt}self64:{res}{col 15}6782{txt} missing values generated

{res}->  mvdecode self65, mv(9)
      {txt}self65:{res}{col 15}6803{txt} missing values generated
{com}. for num 18/65: mvdecode sideX, mv(9)

{res}->  mvdecode side18, mv(9)
      {txt}side18:{res}{col 15}6908{txt} missing values generated

{res}->  mvdecode side19, mv(9)
      {txt}side19:{res}{col 15}6904{txt} missing values generated

{res}->  mvdecode side20, mv(9)
      {txt}side20:{res}{col 15}6899{txt} missing values generated

{res}->  mvdecode side21, mv(9)
      {txt}side21:{res}{col 15}6892{txt} missing values generated

{res}->  mvdecode side22, mv(9)
      {txt}side22:{res}{col 15}6886{txt} missing values generated

{res}->  mvdecode side23, mv(9)
      {txt}side23:{res}{col 15}6870{txt} missing values generated

{res}->  mvdecode side24, mv(9)
      {txt}side24:{res}{col 15}6852{txt} missing values generated

{res}->  mvdecode side25, mv(9)
      {txt}side25:{res}{col 15}6839{txt} missing values generated

{res}->  mvdecode side26, mv(9)
      {txt}side26:{res}{col 15}6817{txt} missing values generated

{res}->  mvdecode side27, mv(9)
      {txt}side27:{res}{col 15}6822{txt} missing values generated

{res}->  mvdecode side28, mv(9)
      {txt}side28:{res}{col 15}6814{txt} missing values generated

{res}->  mvdecode side29, mv(9)
      {txt}side29:{res}{col 15}6803{txt} missing values generated

{res}->  mvdecode side30, mv(9)
      {txt}side30:{res}{col 15}6790{txt} missing values generated

{res}->  mvdecode side31, mv(9)
      {txt}side31:{res}{col 15}6792{txt} missing values generated

{res}->  mvdecode side32, mv(9)
      {txt}side32:{res}{col 15}6782{txt} missing values generated

{res}->  mvdecode side33, mv(9)
      {txt}side33:{res}{col 15}6779{txt} missing values generated

{res}->  mvdecode side34, mv(9)
      {txt}side34:{res}{col 15}6788{txt} missing values generated

{res}->  mvdecode side35, mv(9)
      {txt}side35:{res}{col 15}6788{txt} missing values generated

{res}->  mvdecode side36, mv(9)
      {txt}side36:{res}{col 15}6783{txt} missing values generated

{res}->  mvdecode side37, mv(9)
      {txt}side37:{res}{col 15}6796{txt} missing values generated

{res}->  mvdecode side38, mv(9)
      {txt}side38:{res}{col 15}6805{txt} missing values generated

{res}->  mvdecode side39, mv(9)
      {txt}side39:{res}{col 15}6814{txt} missing values generated

{res}->  mvdecode side40, mv(9)
      {txt}side40:{res}{col 15}6819{txt} missing values generated

{res}->  mvdecode side41, mv(9)
      {txt}side41:{res}{col 15}6831{txt} missing values generated

{res}->  mvdecode side42, mv(9)
      {txt}side42:{res}{col 15}6832{txt} missing values generated

{res}->  mvdecode side43, mv(9)
      {txt}side43:{res}{col 15}6829{txt} missing values generated

{res}->  mvdecode side44, mv(9)
      {txt}side44:{res}{col 15}6835{txt} missing values generated

{res}->  mvdecode side45, mv(9)
      {txt}side45:{res}{col 15}6839{txt} missing values generated

{res}->  mvdecode side46, mv(9)
      {txt}side46:{res}{col 15}6845{txt} missing values generated

{res}->  mvdecode side47, mv(9)
      {txt}side47:{res}{col 15}6844{txt} missing values generated

{res}->  mvdecode side48, mv(9)
      {txt}side48:{res}{col 15}6848{txt} missing values generated

{res}->  mvdecode side49, mv(9)
      {txt}side49:{res}{col 15}6859{txt} missing values generated

{res}->  mvdecode side50, mv(9)
      {txt}side50:{res}{col 15}6856{txt} missing values generated

{res}->  mvdecode side51, mv(9)
      {txt}side51:{res}{col 15}6861{txt} missing values generated

{res}->  mvdecode side52, mv(9)
      {txt}side52:{res}{col 15}6868{txt} missing values generated

{res}->  mvdecode side53, mv(9)
      {txt}side53:{res}{col 15}6870{txt} missing values generated

{res}->  mvdecode side54, mv(9)
      {txt}side54:{res}{col 15}6879{txt} missing values generated

{res}->  mvdecode side55, mv(9)
      {txt}side55:{res}{col 15}6884{txt} missing values generated

{res}->  mvdecode side56, mv(9)
      {txt}side56:{res}{col 15}6885{txt} missing values generated

{res}->  mvdecode side57, mv(9)
      {txt}side57:{res}{col 15}6889{txt} missing values generated

{res}->  mvdecode side58, mv(9)
      {txt}side58:{res}{col 15}6892{txt} missing values generated

{res}->  mvdecode side59, mv(9)
      {txt}side59:{res}{col 15}6895{txt} missing values generated

{res}->  mvdecode side60, mv(9)
      {txt}side60:{res}{col 15}6901{txt} missing values generated

{res}->  mvdecode side61, mv(9)
      {txt}side61:{res}{col 15}6907{txt} missing values generated

{res}->  mvdecode side62, mv(9)
      {txt}side62:{res}{col 15}6908{txt} missing values generated

{res}->  mvdecode side63, mv(9)
      {txt}side63:{res}{col 15}6913{txt} missing values generated

{res}->  mvdecode side64, mv(9)
      {txt}side64:{res}{col 15}6915{txt} missing values generated

{res}->  mvdecode side65, mv(9)
      {txt}side65:{res}{col 15}6915{txt} missing values generated
{com}. for num 18/65: mvdecode fmwX, mv(9)

{res}->  mvdecode fmw18, mv(9)
       {txt}fmw18:{res}{col 15}6801{txt} missing values generated

{res}->  mvdecode fmw19, mv(9)
       {txt}fmw19:{res}{col 15}6781{txt} missing values generated

{res}->  mvdecode fmw20, mv(9)
       {txt}fmw20:{res}{col 15}6752{txt} missing values generated

{res}->  mvdecode fmw21, mv(9)
       {txt}fmw21:{res}{col 15}6709{txt} missing values generated

{res}->  mvdecode fmw22, mv(9)
       {txt}fmw22:{res}{col 15}6678{txt} missing values generated

{res}->  mvdecode fmw23, mv(9)
       {txt}fmw23:{res}{col 15}6640{txt} missing values generated

{res}->  mvdecode fmw24, mv(9)
       {txt}fmw24:{res}{col 15}6589{txt} missing values generated

{res}->  mvdecode fmw25, mv(9)
       {txt}fmw25:{res}{col 15}6567{txt} missing values generated

{res}->  mvdecode fmw26, mv(9)
       {txt}fmw26:{res}{col 15}6543{txt} missing values generated

{res}->  mvdecode fmw27, mv(9)
       {txt}fmw27:{res}{col 15}6530{txt} missing values generated

{res}->  mvdecode fmw28, mv(9)
       {txt}fmw28:{res}{col 15}6523{txt} missing values generated

{res}->  mvdecode fmw29, mv(9)
       {txt}fmw29:{res}{col 15}6518{txt} missing values generated

{res}->  mvdecode fmw30, mv(9)
       {txt}fmw30:{res}{col 15}6519{txt} missing values generated

{res}->  mvdecode fmw31, mv(9)
       {txt}fmw31:{res}{col 15}6523{txt} missing values generated

{res}->  mvdecode fmw32, mv(9)
       {txt}fmw32:{res}{col 15}6536{txt} missing values generated

{res}->  mvdecode fmw33, mv(9)
       {txt}fmw33:{res}{col 15}6546{txt} missing values generated

{res}->  mvdecode fmw34, mv(9)
       {txt}fmw34:{res}{col 15}6550{txt} missing values generated

{res}->  mvdecode fmw35, mv(9)
       {txt}fmw35:{res}{col 15}6561{txt} missing values generated

{res}->  mvdecode fmw36, mv(9)
       {txt}fmw36:{res}{col 15}6572{txt} missing values generated

{res}->  mvdecode fmw37, mv(9)
       {txt}fmw37:{res}{col 15}6584{txt} missing values generated

{res}->  mvdecode fmw38, mv(9)
       {txt}fmw38:{res}{col 15}6596{txt} missing values generated

{res}->  mvdecode fmw39, mv(9)
       {txt}fmw39:{res}{col 15}6614{txt} missing values generated

{res}->  mvdecode fmw40, mv(9)
       {txt}fmw40:{res}{col 15}6625{txt} missing values generated

{res}->  mvdecode fmw41, mv(9)
       {txt}fmw41:{res}{col 15}6639{txt} missing values generated

{res}->  mvdecode fmw42, mv(9)
       {txt}fmw42:{res}{col 15}6653{txt} missing values generated

{res}->  mvdecode fmw43, mv(9)
       {txt}fmw43:{res}{col 15}6662{txt} missing values generated

{res}->  mvdecode fmw44, mv(9)
       {txt}fmw44:{res}{col 15}6675{txt} missing values generated

{res}->  mvdecode fmw45, mv(9)
       {txt}fmw45:{res}{col 15}6685{txt} missing values generated

{res}->  mvdecode fmw46, mv(9)
       {txt}fmw46:{res}{col 15}6689{txt} missing values generated

{res}->  mvdecode fmw47, mv(9)
       {txt}fmw47:{res}{col 15}6697{txt} missing values generated

{res}->  mvdecode fmw48, mv(9)
       {txt}fmw48:{res}{col 15}6705{txt} missing values generated

{res}->  mvdecode fmw49, mv(9)
       {txt}fmw49:{res}{col 15}6711{txt} missing values generated

{res}->  mvdecode fmw50, mv(9)
       {txt}fmw50:{res}{col 15}6715{txt} missing values generated

{res}->  mvdecode fmw51, mv(9)
       {txt}fmw51:{res}{col 15}6724{txt} missing values generated

{res}->  mvdecode fmw52, mv(9)
       {txt}fmw52:{res}{col 15}6738{txt} missing values generated

{res}->  mvdecode fmw53, mv(9)
       {txt}fmw53:{res}{col 15}6754{txt} missing values generated

{res}->  mvdecode fmw54, mv(9)
       {txt}fmw54:{res}{col 15}6769{txt} missing values generated

{res}->  mvdecode fmw55, mv(9)
       {txt}fmw55:{res}{col 15}6789{txt} missing values generated

{res}->  mvdecode fmw56, mv(9)
       {txt}fmw56:{res}{col 15}6802{txt} missing values generated

{res}->  mvdecode fmw57, mv(9)
       {txt}fmw57:{res}{col 15}6821{txt} missing values generated

{res}->  mvdecode fmw58, mv(9)
       {txt}fmw58:{res}{col 15}6826{txt} missing values generated

{res}->  mvdecode fmw59, mv(9)
       {txt}fmw59:{res}{col 15}6832{txt} missing values generated

{res}->  mvdecode fmw60, mv(9)
       {txt}fmw60:{res}{col 15}6836{txt} missing values generated

{res}->  mvdecode fmw61, mv(9)
       {txt}fmw61:{res}{col 15}6840{txt} missing values generated

{res}->  mvdecode fmw62, mv(9)
       {txt}fmw62:{res}{col 15}6853{txt} missing values generated

{res}->  mvdecode fmw63, mv(9)
       {txt}fmw63:{res}{col 15}6865{txt} missing values generated

{res}->  mvdecode fmw64, mv(9)
       {txt}fmw64:{res}{col 15}6875{txt} missing values generated

{res}->  mvdecode fmw65, mv(9)
       {txt}fmw65:{res}{col 15}6886{txt} missing values generated
{com}. for num 18/65: replace weX=1 if casX!=. | regX!=. | selfX!=. | sideX!=. | fmwX!=. 

{res}->  replace we18=1 if cas18!=. | reg18!=. | self18!=. | side18!=. | fmw18!=.
{txt}(3,151 real changes made)

{res}->  replace we19=1 if cas19!=. | reg19!=. | self19!=. | side19!=. | fmw19!=.
{txt}(3,838 real changes made)

{res}->  replace we20=1 if cas20!=. | reg20!=. | self20!=. | side20!=. | fmw20!=.
{txt}(4,215 real changes made)

{res}->  replace we21=1 if cas21!=. | reg21!=. | self21!=. | side21!=. | fmw21!=.
{txt}(4,765 real changes made)

{res}->  replace we22=1 if cas22!=. | reg22!=. | self22!=. | side22!=. | fmw22!=.
{txt}(5,049 real changes made)

{res}->  replace we23=1 if cas23!=. | reg23!=. | self23!=. | side23!=. | fmw23!=.
{txt}(5,531 real changes made)

{res}->  replace we24=1 if cas24!=. | reg24!=. | self24!=. | side24!=. | fmw24!=.
{txt}(5,488 real changes made)

{res}->  replace we25=1 if cas25!=. | reg25!=. | self25!=. | side25!=. | fmw25!=.
{txt}(5,324 real changes made)

{res}->  replace we26=1 if cas26!=. | reg26!=. | self26!=. | side26!=. | fmw26!=.
{txt}(5,166 real changes made)

{res}->  replace we27=1 if cas27!=. | reg27!=. | self27!=. | side27!=. | fmw27!=.
{txt}(4,988 real changes made)

{res}->  replace we28=1 if cas28!=. | reg28!=. | self28!=. | side28!=. | fmw28!=.
{txt}(4,811 real changes made)

{res}->  replace we29=1 if cas29!=. | reg29!=. | self29!=. | side29!=. | fmw29!=.
{txt}(4,686 real changes made)

{res}->  replace we30=1 if cas30!=. | reg30!=. | self30!=. | side30!=. | fmw30!=.
{txt}(4,587 real changes made)

{res}->  replace we31=1 if cas31!=. | reg31!=. | self31!=. | side31!=. | fmw31!=.
{txt}(4,450 real changes made)

{res}->  replace we32=1 if cas32!=. | reg32!=. | self32!=. | side32!=. | fmw32!=.
{txt}(4,388 real changes made)

{res}->  replace we33=1 if cas33!=. | reg33!=. | self33!=. | side33!=. | fmw33!=.
{txt}(4,306 real changes made)

{res}->  replace we34=1 if cas34!=. | reg34!=. | self34!=. | side34!=. | fmw34!=.
{txt}(4,239 real changes made)

{res}->  replace we35=1 if cas35!=. | reg35!=. | self35!=. | side35!=. | fmw35!=.
{txt}(4,167 real changes made)

{res}->  replace we36=1 if cas36!=. | reg36!=. | self36!=. | side36!=. | fmw36!=.
{txt}(4,087 real changes made)

{res}->  replace we37=1 if cas37!=. | reg37!=. | self37!=. | side37!=. | fmw37!=.
{txt}(3,992 real changes made)

{res}->  replace we38=1 if cas38!=. | reg38!=. | self38!=. | side38!=. | fmw38!=.
{txt}(3,937 real changes made)

{res}->  replace we39=1 if cas39!=. | reg39!=. | self39!=. | side39!=. | fmw39!=.
{txt}(3,847 real changes made)

{res}->  replace we40=1 if cas40!=. | reg40!=. | self40!=. | side40!=. | fmw40!=.
{txt}(3,777 real changes made)

{res}->  replace we41=1 if cas41!=. | reg41!=. | self41!=. | side41!=. | fmw41!=.
{txt}(3,657 real changes made)

{res}->  replace we42=1 if cas42!=. | reg42!=. | self42!=. | side42!=. | fmw42!=.
{txt}(3,578 real changes made)

{res}->  replace we43=1 if cas43!=. | reg43!=. | self43!=. | side43!=. | fmw43!=.
{txt}(3,492 real changes made)

{res}->  replace we44=1 if cas44!=. | reg44!=. | self44!=. | side44!=. | fmw44!=.
{txt}(3,379 real changes made)

{res}->  replace we45=1 if cas45!=. | reg45!=. | self45!=. | side45!=. | fmw45!=.
{txt}(3,289 real changes made)

{res}->  replace we46=1 if cas46!=. | reg46!=. | self46!=. | side46!=. | fmw46!=.
{txt}(3,140 real changes made)

{res}->  replace we47=1 if cas47!=. | reg47!=. | self47!=. | side47!=. | fmw47!=.
{txt}(3,033 real changes made)

{res}->  replace we48=1 if cas48!=. | reg48!=. | self48!=. | side48!=. | fmw48!=.
{txt}(2,899 real changes made)

{res}->  replace we49=1 if cas49!=. | reg49!=. | self49!=. | side49!=. | fmw49!=.
{txt}(2,785 real changes made)

{res}->  replace we50=1 if cas50!=. | reg50!=. | self50!=. | side50!=. | fmw50!=.
{txt}(2,649 real changes made)

{res}->  replace we51=1 if cas51!=. | reg51!=. | self51!=. | side51!=. | fmw51!=.
{txt}(2,464 real changes made)

{res}->  replace we52=1 if cas52!=. | reg52!=. | self52!=. | side52!=. | fmw52!=.
{txt}(2,323 real changes made)

{res}->  replace we53=1 if cas53!=. | reg53!=. | self53!=. | side53!=. | fmw53!=.
{txt}(2,141 real changes made)

{res}->  replace we54=1 if cas54!=. | reg54!=. | self54!=. | side54!=. | fmw54!=.
{txt}(1,981 real changes made)

{res}->  replace we55=1 if cas55!=. | reg55!=. | self55!=. | side55!=. | fmw55!=.
{txt}(1,780 real changes made)

{res}->  replace we56=1 if cas56!=. | reg56!=. | self56!=. | side56!=. | fmw56!=.
{txt}(1,591 real changes made)

{res}->  replace we57=1 if cas57!=. | reg57!=. | self57!=. | side57!=. | fmw57!=.
{txt}(1,426 real changes made)

{res}->  replace we58=1 if cas58!=. | reg58!=. | self58!=. | side58!=. | fmw58!=.
{txt}(1,309 real changes made)

{res}->  replace we59=1 if cas59!=. | reg59!=. | self59!=. | side59!=. | fmw59!=.
{txt}(1,193 real changes made)

{res}->  replace we60=1 if cas60!=. | reg60!=. | self60!=. | side60!=. | fmw60!=.
{txt}(1,095 real changes made)

{res}->  replace we61=1 if cas61!=. | reg61!=. | self61!=. | side61!=. | fmw61!=.
{txt}(750 real changes made)

{res}->  replace we62=1 if cas62!=. | reg62!=. | self62!=. | side62!=. | fmw62!=.
{txt}(633 real changes made)

{res}->  replace we63=1 if cas63!=. | reg63!=. | self63!=. | side63!=. | fmw63!=.
{txt}(514 real changes made)

{res}->  replace we64=1 if cas64!=. | reg64!=. | self64!=. | side64!=. | fmw64!=.
{txt}(405 real changes made)

{res}->  replace we65=1 if cas65!=. | reg65!=. | self65!=. | side65!=. | fmw65!=.
{txt}(322 real changes made)
{com}. egen workexp2004=rowtotal(we18-we65)
. keep id workexp2004 year
. sort id
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\WorkexpKHPS.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\WorkexpKHPS.dta saved
{com}. 
. ***** new cohort 2007
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2007_new.dta", clear
. for num 18/65: gen weX=0

{res}->  gen we18=0

->  gen we19=0

->  gen we20=0

->  gen we21=0

->  gen we22=0

->  gen we23=0

->  gen we24=0

->  gen we25=0

->  gen we26=0

->  gen we27=0

->  gen we28=0

->  gen we29=0

->  gen we30=0

->  gen we31=0

->  gen we32=0

->  gen we33=0

->  gen we34=0

->  gen we35=0

->  gen we36=0

->  gen we37=0

->  gen we38=0

->  gen we39=0

->  gen we40=0

->  gen we41=0

->  gen we42=0

->  gen we43=0

->  gen we44=0

->  gen we45=0

->  gen we46=0

->  gen we47=0

->  gen we48=0

->  gen we49=0

->  gen we50=0

->  gen we51=0

->  gen we52=0

->  gen we53=0

->  gen we54=0

->  gen we55=0

->  gen we56=0

->  gen we57=0

->  gen we58=0

->  gen we59=0

->  gen we60=0

->  gen we61=0

->  gen we62=0

->  gen we63=0

->  gen we64=0

->  gen we65=0
{com}. for num 18/65: mvdecode casX, mv(9)

{res}->  mvdecode cas18, mv(9)
       {txt}cas18:{res}{col 15}2391{txt} missing values generated

{res}->  mvdecode cas19, mv(9)
       {txt}cas19:{res}{col 15}2334{txt} missing values generated

{res}->  mvdecode cas20, mv(9)
       {txt}cas20:{res}{col 15}2316{txt} missing values generated

{res}->  mvdecode cas21, mv(9)
       {txt}cas21:{res}{col 15}2301{txt} missing values generated

{res}->  mvdecode cas22, mv(9)
       {txt}cas22:{res}{col 15}2313{txt} missing values generated

{res}->  mvdecode cas23, mv(9)
       {txt}cas23:{res}{col 15}2306{txt} missing values generated

{res}->  mvdecode cas24, mv(9)
       {txt}cas24:{res}{col 15}2309{txt} missing values generated

{res}->  mvdecode cas25, mv(9)
       {txt}cas25:{res}{col 15}2300{txt} missing values generated

{res}->  mvdecode cas26, mv(9)
       {txt}cas26:{res}{col 15}2297{txt} missing values generated

{res}->  mvdecode cas27, mv(9)
       {txt}cas27:{res}{col 15}2309{txt} missing values generated

{res}->  mvdecode cas28, mv(9)
       {txt}cas28:{res}{col 15}2312{txt} missing values generated

{res}->  mvdecode cas29, mv(9)
       {txt}cas29:{res}{col 15}2323{txt} missing values generated

{res}->  mvdecode cas30, mv(9)
       {txt}cas30:{res}{col 15}2315{txt} missing values generated

{res}->  mvdecode cas31, mv(9)
       {txt}cas31:{res}{col 15}2325{txt} missing values generated

{res}->  mvdecode cas32, mv(9)
       {txt}cas32:{res}{col 15}2321{txt} missing values generated

{res}->  mvdecode cas33, mv(9)
       {txt}cas33:{res}{col 15}2314{txt} missing values generated

{res}->  mvdecode cas34, mv(9)
       {txt}cas34:{res}{col 15}2303{txt} missing values generated

{res}->  mvdecode cas35, mv(9)
       {txt}cas35:{res}{col 15}2287{txt} missing values generated

{res}->  mvdecode cas36, mv(9)
       {txt}cas36:{res}{col 15}2279{txt} missing values generated

{res}->  mvdecode cas37, mv(9)
       {txt}cas37:{res}{col 15}2283{txt} missing values generated

{res}->  mvdecode cas38, mv(9)
       {txt}cas38:{res}{col 15}2283{txt} missing values generated

{res}->  mvdecode cas39, mv(9)
       {txt}cas39:{res}{col 15}2277{txt} missing values generated

{res}->  mvdecode cas40, mv(9)
       {txt}cas40:{res}{col 15}2279{txt} missing values generated

{res}->  mvdecode cas41, mv(9)
       {txt}cas41:{res}{col 15}2272{txt} missing values generated

{res}->  mvdecode cas42, mv(9)
       {txt}cas42:{res}{col 15}2271{txt} missing values generated

{res}->  mvdecode cas43, mv(9)
       {txt}cas43:{res}{col 15}2262{txt} missing values generated

{res}->  mvdecode cas44, mv(9)
       {txt}cas44:{res}{col 15}2269{txt} missing values generated

{res}->  mvdecode cas45, mv(9)
       {txt}cas45:{res}{col 15}2280{txt} missing values generated

{res}->  mvdecode cas46, mv(9)
       {txt}cas46:{res}{col 15}2291{txt} missing values generated

{res}->  mvdecode cas47, mv(9)
       {txt}cas47:{res}{col 15}2301{txt} missing values generated

{res}->  mvdecode cas48, mv(9)
       {txt}cas48:{res}{col 15}2305{txt} missing values generated

{res}->  mvdecode cas49, mv(9)
       {txt}cas49:{res}{col 15}2303{txt} missing values generated

{res}->  mvdecode cas50, mv(9)
       {txt}cas50:{res}{col 15}2312{txt} missing values generated

{res}->  mvdecode cas51, mv(9)
       {txt}cas51:{res}{col 15}2325{txt} missing values generated

{res}->  mvdecode cas52, mv(9)
       {txt}cas52:{res}{col 15}2347{txt} missing values generated

{res}->  mvdecode cas53, mv(9)
       {txt}cas53:{res}{col 15}2354{txt} missing values generated

{res}->  mvdecode cas54, mv(9)
       {txt}cas54:{res}{col 15}2364{txt} missing values generated

{res}->  mvdecode cas55, mv(9)
       {txt}cas55:{res}{col 15}2369{txt} missing values generated

{res}->  mvdecode cas56, mv(9)
       {txt}cas56:{res}{col 15}2380{txt} missing values generated

{res}->  mvdecode cas57, mv(9)
       {txt}cas57:{res}{col 15}2382{txt} missing values generated

{res}->  mvdecode cas58, mv(9)
       {txt}cas58:{res}{col 15}2392{txt} missing values generated

{res}->  mvdecode cas59, mv(9)
       {txt}cas59:{res}{col 15}2397{txt} missing values generated

{res}->  mvdecode cas60, mv(9)
       {txt}cas60:{res}{col 15}2400{txt} missing values generated

{res}->  mvdecode cas61, mv(9)
       {txt}cas61:{res}{col 15}2398{txt} missing values generated

{res}->  mvdecode cas62, mv(9)
       {txt}cas62:{res}{col 15}2407{txt} missing values generated

{res}->  mvdecode cas63, mv(9)
       {txt}cas63:{res}{col 15}2413{txt} missing values generated

{res}->  mvdecode cas64, mv(9)
       {txt}cas64:{res}{col 15}2428{txt} missing values generated

{res}->  mvdecode cas65, mv(9)
       {txt}cas65:{res}{col 15}2433{txt} missing values generated
{com}. for num 18/65: mvdecode regX, mv(9)

{res}->  mvdecode reg18, mv(9)
       {txt}reg18:{res}{col 15}1994{txt} missing values generated

{res}->  mvdecode reg19, mv(9)
       {txt}reg19:{res}{col 15}1430{txt} missing values generated

{res}->  mvdecode reg20, mv(9)
       {txt}reg20:{res}{col 15}1336{txt} missing values generated

{res}->  mvdecode reg21, mv(9)
       {txt}reg21:{res}{col 15}1095{txt} missing values generated

{res}->  mvdecode reg22, mv(9)
       {txt}reg22:{res}{col 15}1002{txt} missing values generated

{res}->  mvdecode reg23, mv(9)
       {txt}reg23:{res}{col 15}856{txt} missing values generated

{res}->  mvdecode reg24, mv(9)
       {txt}reg24:{res}{col 15}897{txt} missing values generated

{res}->  mvdecode reg25, mv(9)
       {txt}reg25:{res}{col 15}973{txt} missing values generated

{res}->  mvdecode reg26, mv(9)
       {txt}reg26:{res}{col 15}1075{txt} missing values generated

{res}->  mvdecode reg27, mv(9)
       {txt}reg27:{res}{col 15}1149{txt} missing values generated

{res}->  mvdecode reg28, mv(9)
       {txt}reg28:{res}{col 15}1205{txt} missing values generated

{res}->  mvdecode reg29, mv(9)
       {txt}reg29:{res}{col 15}1254{txt} missing values generated

{res}->  mvdecode reg30, mv(9)
       {txt}reg30:{res}{col 15}1297{txt} missing values generated

{res}->  mvdecode reg31, mv(9)
       {txt}reg31:{res}{col 15}1344{txt} missing values generated

{res}->  mvdecode reg32, mv(9)
       {txt}reg32:{res}{col 15}1385{txt} missing values generated

{res}->  mvdecode reg33, mv(9)
       {txt}reg33:{res}{col 15}1399{txt} missing values generated

{res}->  mvdecode reg34, mv(9)
       {txt}reg34:{res}{col 15}1430{txt} missing values generated

{res}->  mvdecode reg35, mv(9)
       {txt}reg35:{res}{col 15}1466{txt} missing values generated

{res}->  mvdecode reg36, mv(9)
       {txt}reg36:{res}{col 15}1506{txt} missing values generated

{res}->  mvdecode reg37, mv(9)
       {txt}reg37:{res}{col 15}1543{txt} missing values generated

{res}->  mvdecode reg38, mv(9)
       {txt}reg38:{res}{col 15}1559{txt} missing values generated

{res}->  mvdecode reg39, mv(9)
       {txt}reg39:{res}{col 15}1594{txt} missing values generated

{res}->  mvdecode reg40, mv(9)
       {txt}reg40:{res}{col 15}1607{txt} missing values generated

{res}->  mvdecode reg41, mv(9)
       {txt}reg41:{res}{col 15}1623{txt} missing values generated

{res}->  mvdecode reg42, mv(9)
       {txt}reg42:{res}{col 15}1656{txt} missing values generated

{res}->  mvdecode reg43, mv(9)
       {txt}reg43:{res}{col 15}1694{txt} missing values generated

{res}->  mvdecode reg44, mv(9)
       {txt}reg44:{res}{col 15}1710{txt} missing values generated

{res}->  mvdecode reg45, mv(9)
       {txt}reg45:{res}{col 15}1740{txt} missing values generated

{res}->  mvdecode reg46, mv(9)
       {txt}reg46:{res}{col 15}1785{txt} missing values generated

{res}->  mvdecode reg47, mv(9)
       {txt}reg47:{res}{col 15}1812{txt} missing values generated

{res}->  mvdecode reg48, mv(9)
       {txt}reg48:{res}{col 15}1827{txt} missing values generated

{res}->  mvdecode reg49, mv(9)
       {txt}reg49:{res}{col 15}1866{txt} missing values generated

{res}->  mvdecode reg50, mv(9)
       {txt}reg50:{res}{col 15}1889{txt} missing values generated

{res}->  mvdecode reg51, mv(9)
       {txt}reg51:{res}{col 15}1919{txt} missing values generated

{res}->  mvdecode reg52, mv(9)
       {txt}reg52:{res}{col 15}1950{txt} missing values generated

{res}->  mvdecode reg53, mv(9)
       {txt}reg53:{res}{col 15}1991{txt} missing values generated

{res}->  mvdecode reg54, mv(9)
       {txt}reg54:{res}{col 15}2015{txt} missing values generated

{res}->  mvdecode reg55, mv(9)
       {txt}reg55:{res}{col 15}2056{txt} missing values generated

{res}->  mvdecode reg56, mv(9)
       {txt}reg56:{res}{col 15}2087{txt} missing values generated

{res}->  mvdecode reg57, mv(9)
       {txt}reg57:{res}{col 15}2124{txt} missing values generated

{res}->  mvdecode reg58, mv(9)
       {txt}reg58:{res}{col 15}2154{txt} missing values generated

{res}->  mvdecode reg59, mv(9)
       {txt}reg59:{res}{col 15}2185{txt} missing values generated

{res}->  mvdecode reg60, mv(9)
       {txt}reg60:{res}{col 15}2249{txt} missing values generated

{res}->  mvdecode reg61, mv(9)
       {txt}reg61:{res}{col 15}2348{txt} missing values generated

{res}->  mvdecode reg62, mv(9)
       {txt}reg62:{res}{col 15}2366{txt} missing values generated

{res}->  mvdecode reg63, mv(9)
       {txt}reg63:{res}{col 15}2386{txt} missing values generated

{res}->  mvdecode reg64, mv(9)
       {txt}reg64:{res}{col 15}2407{txt} missing values generated

{res}->  mvdecode reg65, mv(9)
       {txt}reg65:{res}{col 15}2422{txt} missing values generated
{com}. for num 18/65: mvdecode selfX, mv(9)

{res}->  mvdecode self18, mv(9)
      {txt}self18:{res}{col 15}2429{txt} missing values generated

{res}->  mvdecode self19, mv(9)
      {txt}self19:{res}{col 15}2417{txt} missing values generated

{res}->  mvdecode self20, mv(9)
      {txt}self20:{res}{col 15}2410{txt} missing values generated

{res}->  mvdecode self21, mv(9)
      {txt}self21:{res}{col 15}2395{txt} missing values generated

{res}->  mvdecode self22, mv(9)
      {txt}self22:{res}{col 15}2383{txt} missing values generated

{res}->  mvdecode self23, mv(9)
      {txt}self23:{res}{col 15}2354{txt} missing values generated

{res}->  mvdecode self24, mv(9)
      {txt}self24:{res}{col 15}2344{txt} missing values generated

{res}->  mvdecode self25, mv(9)
      {txt}self25:{res}{col 15}2325{txt} missing values generated

{res}->  mvdecode self26, mv(9)
      {txt}self26:{res}{col 15}2320{txt} missing values generated

{res}->  mvdecode self27, mv(9)
      {txt}self27:{res}{col 15}2304{txt} missing values generated

{res}->  mvdecode self28, mv(9)
      {txt}self28:{res}{col 15}2300{txt} missing values generated

{res}->  mvdecode self29, mv(9)
      {txt}self29:{res}{col 15}2296{txt} missing values generated

{res}->  mvdecode self30, mv(9)
      {txt}self30:{res}{col 15}2287{txt} missing values generated

{res}->  mvdecode self31, mv(9)
      {txt}self31:{res}{col 15}2274{txt} missing values generated

{res}->  mvdecode self32, mv(9)
      {txt}self32:{res}{col 15}2270{txt} missing values generated

{res}->  mvdecode self33, mv(9)
      {txt}self33:{res}{col 15}2270{txt} missing values generated

{res}->  mvdecode self34, mv(9)
      {txt}self34:{res}{col 15}2266{txt} missing values generated

{res}->  mvdecode self35, mv(9)
      {txt}self35:{res}{col 15}2260{txt} missing values generated

{res}->  mvdecode self36, mv(9)
      {txt}self36:{res}{col 15}2256{txt} missing values generated

{res}->  mvdecode self37, mv(9)
      {txt}self37:{res}{col 15}2256{txt} missing values generated

{res}->  mvdecode self38, mv(9)
      {txt}self38:{res}{col 15}2256{txt} missing values generated

{res}->  mvdecode self39, mv(9)
      {txt}self39:{res}{col 15}2259{txt} missing values generated

{res}->  mvdecode self40, mv(9)
      {txt}self40:{res}{col 15}2262{txt} missing values generated

{res}->  mvdecode self41, mv(9)
      {txt}self41:{res}{col 15}2259{txt} missing values generated

{res}->  mvdecode self42, mv(9)
      {txt}self42:{res}{col 15}2262{txt} missing values generated

{res}->  mvdecode self43, mv(9)
      {txt}self43:{res}{col 15}2269{txt} missing values generated

{res}->  mvdecode self44, mv(9)
      {txt}self44:{res}{col 15}2278{txt} missing values generated

{res}->  mvdecode self45, mv(9)
      {txt}self45:{res}{col 15}2288{txt} missing values generated

{res}->  mvdecode self46, mv(9)
      {txt}self46:{res}{col 15}2297{txt} missing values generated

{res}->  mvdecode self47, mv(9)
      {txt}self47:{res}{col 15}2301{txt} missing values generated

{res}->  mvdecode self48, mv(9)
      {txt}self48:{res}{col 15}2305{txt} missing values generated

{res}->  mvdecode self49, mv(9)
      {txt}self49:{res}{col 15}2309{txt} missing values generated

{res}->  mvdecode self50, mv(9)
      {txt}self50:{res}{col 15}2318{txt} missing values generated

{res}->  mvdecode self51, mv(9)
      {txt}self51:{res}{col 15}2320{txt} missing values generated

{res}->  mvdecode self52, mv(9)
      {txt}self52:{res}{col 15}2325{txt} missing values generated

{res}->  mvdecode self53, mv(9)
      {txt}self53:{res}{col 15}2330{txt} missing values generated

{res}->  mvdecode self54, mv(9)
      {txt}self54:{res}{col 15}2337{txt} missing values generated

{res}->  mvdecode self55, mv(9)
      {txt}self55:{res}{col 15}2343{txt} missing values generated

{res}->  mvdecode self56, mv(9)
      {txt}self56:{res}{col 15}2355{txt} missing values generated

{res}->  mvdecode self57, mv(9)
      {txt}self57:{res}{col 15}2364{txt} missing values generated

{res}->  mvdecode self58, mv(9)
      {txt}self58:{res}{col 15}2374{txt} missing values generated

{res}->  mvdecode self59, mv(9)
      {txt}self59:{res}{col 15}2385{txt} missing values generated

{res}->  mvdecode self60, mv(9)
      {txt}self60:{res}{col 15}2399{txt} missing values generated

{res}->  mvdecode self61, mv(9)
      {txt}self61:{res}{col 15}2408{txt} missing values generated

{res}->  mvdecode self62, mv(9)
      {txt}self62:{res}{col 15}2411{txt} missing values generated

{res}->  mvdecode self63, mv(9)
      {txt}self63:{res}{col 15}2418{txt} missing values generated

{res}->  mvdecode self64, mv(9)
      {txt}self64:{res}{col 15}2428{txt} missing values generated

{res}->  mvdecode self65, mv(9)
      {txt}self65:{res}{col 15}2435{txt} missing values generated
{com}. for num 18/65: mvdecode sideX, mv(9)

{res}->  mvdecode side18, mv(9)
      {txt}side18:{res}{col 15}2460{txt} missing values generated

{res}->  mvdecode side19, mv(9)
      {txt}side19:{res}{col 15}2460{txt} missing values generated

{res}->  mvdecode side20, mv(9)
      {txt}side20:{res}{col 15}2461{txt} missing values generated

{res}->  mvdecode side21, mv(9)
      {txt}side21:{res}{col 15}2458{txt} missing values generated

{res}->  mvdecode side22, mv(9)
      {txt}side22:{res}{col 15}2456{txt} missing values generated

{res}->  mvdecode side23, mv(9)
      {txt}side23:{res}{col 15}2453{txt} missing values generated

{res}->  mvdecode side24, mv(9)
      {txt}side24:{res}{col 15}2452{txt} missing values generated

{res}->  mvdecode side25, mv(9)
      {txt}side25:{res}{col 15}2447{txt} missing values generated

{res}->  mvdecode side26, mv(9)
      {txt}side26:{res}{col 15}2441{txt} missing values generated

{res}->  mvdecode side27, mv(9)
      {txt}side27:{res}{col 15}2434{txt} missing values generated

{res}->  mvdecode side28, mv(9)
      {txt}side28:{res}{col 15}2429{txt} missing values generated

{res}->  mvdecode side29, mv(9)
      {txt}side29:{res}{col 15}2427{txt} missing values generated

{res}->  mvdecode side30, mv(9)
      {txt}side30:{res}{col 15}2427{txt} missing values generated

{res}->  mvdecode side31, mv(9)
      {txt}side31:{res}{col 15}2423{txt} missing values generated

{res}->  mvdecode side32, mv(9)
      {txt}side32:{res}{col 15}2421{txt} missing values generated

{res}->  mvdecode side33, mv(9)
      {txt}side33:{res}{col 15}2422{txt} missing values generated

{res}->  mvdecode side34, mv(9)
      {txt}side34:{res}{col 15}2423{txt} missing values generated

{res}->  mvdecode side35, mv(9)
      {txt}side35:{res}{col 15}2425{txt} missing values generated

{res}->  mvdecode side36, mv(9)
      {txt}side36:{res}{col 15}2427{txt} missing values generated

{res}->  mvdecode side37, mv(9)
      {txt}side37:{res}{col 15}2425{txt} missing values generated

{res}->  mvdecode side38, mv(9)
      {txt}side38:{res}{col 15}2426{txt} missing values generated

{res}->  mvdecode side39, mv(9)
      {txt}side39:{res}{col 15}2426{txt} missing values generated

{res}->  mvdecode side40, mv(9)
      {txt}side40:{res}{col 15}2429{txt} missing values generated

{res}->  mvdecode side41, mv(9)
      {txt}side41:{res}{col 15}2433{txt} missing values generated

{res}->  mvdecode side42, mv(9)
      {txt}side42:{res}{col 15}2435{txt} missing values generated

{res}->  mvdecode side43, mv(9)
      {txt}side43:{res}{col 15}2438{txt} missing values generated

{res}->  mvdecode side44, mv(9)
      {txt}side44:{res}{col 15}2442{txt} missing values generated

{res}->  mvdecode side45, mv(9)
      {txt}side45:{res}{col 15}2442{txt} missing values generated

{res}->  mvdecode side46, mv(9)
      {txt}side46:{res}{col 15}2440{txt} missing values generated

{res}->  mvdecode side47, mv(9)
      {txt}side47:{res}{col 15}2444{txt} missing values generated

{res}->  mvdecode side48, mv(9)
      {txt}side48:{res}{col 15}2447{txt} missing values generated

{res}->  mvdecode side49, mv(9)
      {txt}side49:{res}{col 15}2450{txt} missing values generated

{res}->  mvdecode side50, mv(9)
      {txt}side50:{res}{col 15}2451{txt} missing values generated

{res}->  mvdecode side51, mv(9)
      {txt}side51:{res}{col 15}2453{txt} missing values generated

{res}->  mvdecode side52, mv(9)
      {txt}side52:{res}{col 15}2454{txt} missing values generated

{res}->  mvdecode side53, mv(9)
      {txt}side53:{res}{col 15}2455{txt} missing values generated

{res}->  mvdecode side54, mv(9)
      {txt}side54:{res}{col 15}2455{txt} missing values generated

{res}->  mvdecode side55, mv(9)
      {txt}side55:{res}{col 15}2454{txt} missing values generated

{res}->  mvdecode side56, mv(9)
      {txt}side56:{res}{col 15}2455{txt} missing values generated

{res}->  mvdecode side57, mv(9)
      {txt}side57:{res}{col 15}2456{txt} missing values generated

{res}->  mvdecode side58, mv(9)
      {txt}side58:{res}{col 15}2457{txt} missing values generated

{res}->  mvdecode side59, mv(9)
      {txt}side59:{res}{col 15}2458{txt} missing values generated

{res}->  mvdecode side60, mv(9)
      {txt}side60:{res}{col 15}2459{txt} missing values generated

{res}->  mvdecode side61, mv(9)
      {txt}side61:{res}{col 15}2459{txt} missing values generated

{res}->  mvdecode side62, mv(9)
      {txt}side62:{res}{col 15}2459{txt} missing values generated

{res}->  mvdecode side63, mv(9)
      {txt}side63:{res}{col 15}2459{txt} missing values generated

{res}->  mvdecode side64, mv(9)
      {txt}side64:{res}{col 15}2459{txt} missing values generated

{res}->  mvdecode side65, mv(9)
      {txt}side65:{res}{col 15}2460{txt} missing values generated
{com}. for num 18/65: mvdecode fmwX, mv(9)

{res}->  mvdecode fmw18, mv(9)
       {txt}fmw18:{res}{col 15}2436{txt} missing values generated

{res}->  mvdecode fmw19, mv(9)
       {txt}fmw19:{res}{col 15}2414{txt} missing values generated

{res}->  mvdecode fmw20, mv(9)
       {txt}fmw20:{res}{col 15}2410{txt} missing values generated

{res}->  mvdecode fmw21, mv(9)
       {txt}fmw21:{res}{col 15}2388{txt} missing values generated

{res}->  mvdecode fmw22, mv(9)
       {txt}fmw22:{res}{col 15}2375{txt} missing values generated

{res}->  mvdecode fmw23, mv(9)
       {txt}fmw23:{res}{col 15}2358{txt} missing values generated

{res}->  mvdecode fmw24, mv(9)
       {txt}fmw24:{res}{col 15}2342{txt} missing values generated

{res}->  mvdecode fmw25, mv(9)
       {txt}fmw25:{res}{col 15}2339{txt} missing values generated

{res}->  mvdecode fmw26, mv(9)
       {txt}fmw26:{res}{col 15}2330{txt} missing values generated

{res}->  mvdecode fmw27, mv(9)
       {txt}fmw27:{res}{col 15}2325{txt} missing values generated

{res}->  mvdecode fmw28, mv(9)
       {txt}fmw28:{res}{col 15}2329{txt} missing values generated

{res}->  mvdecode fmw29, mv(9)
       {txt}fmw29:{res}{col 15}2326{txt} missing values generated

{res}->  mvdecode fmw30, mv(9)
       {txt}fmw30:{res}{col 15}2323{txt} missing values generated

{res}->  mvdecode fmw31, mv(9)
       {txt}fmw31:{res}{col 15}2322{txt} missing values generated

{res}->  mvdecode fmw32, mv(9)
       {txt}fmw32:{res}{col 15}2321{txt} missing values generated

{res}->  mvdecode fmw33, mv(9)
       {txt}fmw33:{res}{col 15}2318{txt} missing values generated

{res}->  mvdecode fmw34, mv(9)
       {txt}fmw34:{res}{col 15}2326{txt} missing values generated

{res}->  mvdecode fmw35, mv(9)
       {txt}fmw35:{res}{col 15}2335{txt} missing values generated

{res}->  mvdecode fmw36, mv(9)
       {txt}fmw36:{res}{col 15}2339{txt} missing values generated

{res}->  mvdecode fmw37, mv(9)
       {txt}fmw37:{res}{col 15}2345{txt} missing values generated

{res}->  mvdecode fmw38, mv(9)
       {txt}fmw38:{res}{col 15}2351{txt} missing values generated

{res}->  mvdecode fmw39, mv(9)
       {txt}fmw39:{res}{col 15}2355{txt} missing values generated

{res}->  mvdecode fmw40, mv(9)
       {txt}fmw40:{res}{col 15}2363{txt} missing values generated

{res}->  mvdecode fmw41, mv(9)
       {txt}fmw41:{res}{col 15}2369{txt} missing values generated

{res}->  mvdecode fmw42, mv(9)
       {txt}fmw42:{res}{col 15}2372{txt} missing values generated

{res}->  mvdecode fmw43, mv(9)
       {txt}fmw43:{res}{col 15}2377{txt} missing values generated

{res}->  mvdecode fmw44, mv(9)
       {txt}fmw44:{res}{col 15}2379{txt} missing values generated

{res}->  mvdecode fmw45, mv(9)
       {txt}fmw45:{res}{col 15}2384{txt} missing values generated

{res}->  mvdecode fmw46, mv(9)
       {txt}fmw46:{res}{col 15}2388{txt} missing values generated

{res}->  mvdecode fmw47, mv(9)
       {txt}fmw47:{res}{col 15}2389{txt} missing values generated

{res}->  mvdecode fmw48, mv(9)
       {txt}fmw48:{res}{col 15}2392{txt} missing values generated

{res}->  mvdecode fmw49, mv(9)
       {txt}fmw49:{res}{col 15}2396{txt} missing values generated

{res}->  mvdecode fmw50, mv(9)
       {txt}fmw50:{res}{col 15}2401{txt} missing values generated

{res}->  mvdecode fmw51, mv(9)
       {txt}fmw51:{res}{col 15}2399{txt} missing values generated

{res}->  mvdecode fmw52, mv(9)
       {txt}fmw52:{res}{col 15}2401{txt} missing values generated

{res}->  mvdecode fmw53, mv(9)
       {txt}fmw53:{res}{col 15}2403{txt} missing values generated

{res}->  mvdecode fmw54, mv(9)
       {txt}fmw54:{res}{col 15}2403{txt} missing values generated

{res}->  mvdecode fmw55, mv(9)
       {txt}fmw55:{res}{col 15}2408{txt} missing values generated

{res}->  mvdecode fmw56, mv(9)
       {txt}fmw56:{res}{col 15}2411{txt} missing values generated

{res}->  mvdecode fmw57, mv(9)
       {txt}fmw57:{res}{col 15}2416{txt} missing values generated

{res}->  mvdecode fmw58, mv(9)
       {txt}fmw58:{res}{col 15}2420{txt} missing values generated

{res}->  mvdecode fmw59, mv(9)
       {txt}fmw59:{res}{col 15}2425{txt} missing values generated

{res}->  mvdecode fmw60, mv(9)
       {txt}fmw60:{res}{col 15}2428{txt} missing values generated

{res}->  mvdecode fmw61, mv(9)
       {txt}fmw61:{res}{col 15}2432{txt} missing values generated

{res}->  mvdecode fmw62, mv(9)
       {txt}fmw62:{res}{col 15}2436{txt} missing values generated

{res}->  mvdecode fmw63, mv(9)
       {txt}fmw63:{res}{col 15}2438{txt} missing values generated

{res}->  mvdecode fmw64, mv(9)
       {txt}fmw64:{res}{col 15}2438{txt} missing values generated

{res}->  mvdecode fmw65, mv(9)
       {txt}fmw65:{res}{col 15}2444{txt} missing values generated
{com}. for num 18/65: replace weX=1 if casX!=. | regX!=. | selfX!=. | sideX!=. | fmwX!=. 

{res}->  replace we18=1 if cas18!=. | reg18!=. | self18!=. | side18!=. | fmw18!=.
{txt}(594 real changes made)

{res}->  replace we19=1 if cas19!=. | reg19!=. | self19!=. | side19!=. | fmw19!=.
{txt}(1,246 real changes made)

{res}->  replace we20=1 if cas20!=. | reg20!=. | self20!=. | side20!=. | fmw20!=.
{txt}(1,365 real changes made)

{res}->  replace we21=1 if cas21!=. | reg21!=. | self21!=. | side21!=. | fmw21!=.
{txt}(1,661 real changes made)

{res}->  replace we22=1 if cas22!=. | reg22!=. | self22!=. | side22!=. | fmw22!=.
{txt}(1,765 real changes made)

{res}->  replace we23=1 if cas23!=. | reg23!=. | self23!=. | side23!=. | fmw23!=.
{txt}(1,965 real changes made)

{res}->  replace we24=1 if cas24!=. | reg24!=. | self24!=. | side24!=. | fmw24!=.
{txt}(1,950 real changes made)

{res}->  replace we25=1 if cas25!=. | reg25!=. | self25!=. | side25!=. | fmw25!=.
{txt}(1,911 real changes made)

{res}->  replace we26=1 if cas26!=. | reg26!=. | self26!=. | side26!=. | fmw26!=.
{txt}(1,832 real changes made)

{res}->  replace we27=1 if cas27!=. | reg27!=. | self27!=. | side27!=. | fmw27!=.
{txt}(1,777 real changes made)

{res}->  replace we28=1 if cas28!=. | reg28!=. | self28!=. | side28!=. | fmw28!=.
{txt}(1,724 real changes made)

{res}->  replace we29=1 if cas29!=. | reg29!=. | self29!=. | side29!=. | fmw29!=.
{txt}(1,679 real changes made)

{res}->  replace we30=1 if cas30!=. | reg30!=. | self30!=. | side30!=. | fmw30!=.
{txt}(1,650 real changes made)

{res}->  replace we31=1 if cas31!=. | reg31!=. | self31!=. | side31!=. | fmw31!=.
{txt}(1,618 real changes made)

{res}->  replace we32=1 if cas32!=. | reg32!=. | self32!=. | side32!=. | fmw32!=.
{txt}(1,587 real changes made)

{res}->  replace we33=1 if cas33!=. | reg33!=. | self33!=. | side33!=. | fmw33!=.
{txt}(1,575 real changes made)

{res}->  replace we34=1 if cas34!=. | reg34!=. | self34!=. | side34!=. | fmw34!=.
{txt}(1,547 real changes made)

{res}->  replace we35=1 if cas35!=. | reg35!=. | self35!=. | side35!=. | fmw35!=.
{txt}(1,527 real changes made)

{res}->  replace we36=1 if cas36!=. | reg36!=. | self36!=. | side36!=. | fmw36!=.
{txt}(1,493 real changes made)

{res}->  replace we37=1 if cas37!=. | reg37!=. | self37!=. | side37!=. | fmw37!=.
{txt}(1,452 real changes made)

{res}->  replace we38=1 if cas38!=. | reg38!=. | self38!=. | side38!=. | fmw38!=.
{txt}(1,427 real changes made)

{res}->  replace we39=1 if cas39!=. | reg39!=. | self39!=. | side39!=. | fmw39!=.
{txt}(1,396 real changes made)

{res}->  replace we40=1 if cas40!=. | reg40!=. | self40!=. | side40!=. | fmw40!=.
{txt}(1,364 real changes made)

{res}->  replace we41=1 if cas41!=. | reg41!=. | self41!=. | side41!=. | fmw41!=.
{txt}(1,346 real changes made)

{res}->  replace we42=1 if cas42!=. | reg42!=. | self42!=. | side42!=. | fmw42!=.
{txt}(1,309 real changes made)

{res}->  replace we43=1 if cas43!=. | reg43!=. | self43!=. | side43!=. | fmw43!=.
{txt}(1,261 real changes made)

{res}->  replace we44=1 if cas44!=. | reg44!=. | self44!=. | side44!=. | fmw44!=.
{txt}(1,221 real changes made)

{res}->  replace we45=1 if cas45!=. | reg45!=. | self45!=. | side45!=. | fmw45!=.
{txt}(1,169 real changes made)

{res}->  replace we46=1 if cas46!=. | reg46!=. | self46!=. | side46!=. | fmw46!=.
{txt}(1,104 real changes made)

{res}->  replace we47=1 if cas47!=. | reg47!=. | self47!=. | side47!=. | fmw47!=.
{txt}(1,059 real changes made)

{res}->  replace we48=1 if cas48!=. | reg48!=. | self48!=. | side48!=. | fmw48!=.
{txt}(1,029 real changes made)

{res}->  replace we49=1 if cas49!=. | reg49!=. | self49!=. | side49!=. | fmw49!=.
{txt}(980 real changes made)

{res}->  replace we50=1 if cas50!=. | reg50!=. | self50!=. | side50!=. | fmw50!=.
{txt}(935 real changes made)

{res}->  replace we51=1 if cas51!=. | reg51!=. | self51!=. | side51!=. | fmw51!=.
{txt}(889 real changes made)

{res}->  replace we52=1 if cas52!=. | reg52!=. | self52!=. | side52!=. | fmw52!=.
{txt}(826 real changes made)

{res}->  replace we53=1 if cas53!=. | reg53!=. | self53!=. | side53!=. | fmw53!=.
{txt}(771 real changes made)

{res}->  replace we54=1 if cas54!=. | reg54!=. | self54!=. | side54!=. | fmw54!=.
{txt}(733 real changes made)

{res}->  replace we55=1 if cas55!=. | reg55!=. | self55!=. | side55!=. | fmw55!=.
{txt}(677 real changes made)

{res}->  replace we56=1 if cas56!=. | reg56!=. | self56!=. | side56!=. | fmw56!=.
{txt}(617 real changes made)

{res}->  replace we57=1 if cas57!=. | reg57!=. | self57!=. | side57!=. | fmw57!=.
{txt}(563 real changes made)

{res}->  replace we58=1 if cas58!=. | reg58!=. | self58!=. | side58!=. | fmw58!=.
{txt}(508 real changes made)

{res}->  replace we59=1 if cas59!=. | reg59!=. | self59!=. | side59!=. | fmw59!=.
{txt}(454 real changes made)

{res}->  replace we60=1 if cas60!=. | reg60!=. | self60!=. | side60!=. | fmw60!=.
{txt}(371 real changes made)

{res}->  replace we61=1 if cas61!=. | reg61!=. | self61!=. | side61!=. | fmw61!=.
{txt}(262 real changes made)

{res}->  replace we62=1 if cas62!=. | reg62!=. | self62!=. | side62!=. | fmw62!=.
{txt}(227 real changes made)

{res}->  replace we63=1 if cas63!=. | reg63!=. | self63!=. | side63!=. | fmw63!=.
{txt}(196 real changes made)

{res}->  replace we64=1 if cas64!=. | reg64!=. | self64!=. | side64!=. | fmw64!=.
{txt}(149 real changes made)

{res}->  replace we65=1 if cas65!=. | reg65!=. | self65!=. | side65!=. | fmw65!=.
{txt}(116 real changes made)
{com}. egen workexp2007=rowtotal(we18-we65)
. keep id workexp2007 year
. sort id
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\WorkexpKHPS_new_2007.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\WorkexpKHPS_new_2007.dta saved
{com}. 
. ***** new cohort 2012
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2012_new.dta", clear
. for num 18/65: gen weX=0

{res}->  gen we18=0

->  gen we19=0

->  gen we20=0

->  gen we21=0

->  gen we22=0

->  gen we23=0

->  gen we24=0

->  gen we25=0

->  gen we26=0

->  gen we27=0

->  gen we28=0

->  gen we29=0

->  gen we30=0

->  gen we31=0

->  gen we32=0

->  gen we33=0

->  gen we34=0

->  gen we35=0

->  gen we36=0

->  gen we37=0

->  gen we38=0

->  gen we39=0

->  gen we40=0

->  gen we41=0

->  gen we42=0

->  gen we43=0

->  gen we44=0

->  gen we45=0

->  gen we46=0

->  gen we47=0

->  gen we48=0

->  gen we49=0

->  gen we50=0

->  gen we51=0

->  gen we52=0

->  gen we53=0

->  gen we54=0

->  gen we55=0

->  gen we56=0

->  gen we57=0

->  gen we58=0

->  gen we59=0

->  gen we60=0

->  gen we61=0

->  gen we62=0

->  gen we63=0

->  gen we64=0

->  gen we65=0
{com}. for num 18/65: mvdecode casX, mv(9)

{res}->  mvdecode cas18, mv(9)
       {txt}cas18:{res}{col 15}1651{txt} missing values generated

{res}->  mvdecode cas19, mv(9)
       {txt}cas19:{res}{col 15}1610{txt} missing values generated

{res}->  mvdecode cas20, mv(9)
       {txt}cas20:{res}{col 15}1597{txt} missing values generated

{res}->  mvdecode cas21, mv(9)
       {txt}cas21:{res}{col 15}1565{txt} missing values generated

{res}->  mvdecode cas22, mv(9)
       {txt}cas22:{res}{col 15}1568{txt} missing values generated

{res}->  mvdecode cas23, mv(9)
       {txt}cas23:{res}{col 15}1563{txt} missing values generated

{res}->  mvdecode cas24, mv(9)
       {txt}cas24:{res}{col 15}1578{txt} missing values generated

{res}->  mvdecode cas25, mv(9)
       {txt}cas25:{res}{col 15}1584{txt} missing values generated

{res}->  mvdecode cas26, mv(9)
       {txt}cas26:{res}{col 15}1599{txt} missing values generated

{res}->  mvdecode cas27, mv(9)
       {txt}cas27:{res}{col 15}1603{txt} missing values generated

{res}->  mvdecode cas28, mv(9)
       {txt}cas28:{res}{col 15}1614{txt} missing values generated

{res}->  mvdecode cas29, mv(9)
       {txt}cas29:{res}{col 15}1613{txt} missing values generated

{res}->  mvdecode cas30, mv(9)
       {txt}cas30:{res}{col 15}1621{txt} missing values generated

{res}->  mvdecode cas31, mv(9)
       {txt}cas31:{res}{col 15}1620{txt} missing values generated

{res}->  mvdecode cas32, mv(9)
       {txt}cas32:{res}{col 15}1610{txt} missing values generated

{res}->  mvdecode cas33, mv(9)
       {txt}cas33:{res}{col 15}1597{txt} missing values generated

{res}->  mvdecode cas34, mv(9)
       {txt}cas34:{res}{col 15}1589{txt} missing values generated

{res}->  mvdecode cas35, mv(9)
       {txt}cas35:{res}{col 15}1584{txt} missing values generated

{res}->  mvdecode cas36, mv(9)
       {txt}cas36:{res}{col 15}1574{txt} missing values generated

{res}->  mvdecode cas37, mv(9)
       {txt}cas37:{res}{col 15}1570{txt} missing values generated

{res}->  mvdecode cas38, mv(9)
       {txt}cas38:{res}{col 15}1562{txt} missing values generated

{res}->  mvdecode cas39, mv(9)
       {txt}cas39:{res}{col 15}1551{txt} missing values generated

{res}->  mvdecode cas40, mv(9)
       {txt}cas40:{res}{col 15}1551{txt} missing values generated

{res}->  mvdecode cas41, mv(9)
       {txt}cas41:{res}{col 15}1554{txt} missing values generated

{res}->  mvdecode cas42, mv(9)
       {txt}cas42:{res}{col 15}1550{txt} missing values generated

{res}->  mvdecode cas43, mv(9)
       {txt}cas43:{res}{col 15}1555{txt} missing values generated

{res}->  mvdecode cas44, mv(9)
       {txt}cas44:{res}{col 15}1567{txt} missing values generated

{res}->  mvdecode cas45, mv(9)
       {txt}cas45:{res}{col 15}1572{txt} missing values generated

{res}->  mvdecode cas46, mv(9)
       {txt}cas46:{res}{col 15}1584{txt} missing values generated

{res}->  mvdecode cas47, mv(9)
       {txt}cas47:{res}{col 15}1582{txt} missing values generated

{res}->  mvdecode cas48, mv(9)
       {txt}cas48:{res}{col 15}1587{txt} missing values generated

{res}->  mvdecode cas49, mv(9)
       {txt}cas49:{res}{col 15}1594{txt} missing values generated

{res}->  mvdecode cas50, mv(9)
       {txt}cas50:{res}{col 15}1594{txt} missing values generated

{res}->  mvdecode cas51, mv(9)
       {txt}cas51:{res}{col 15}1602{txt} missing values generated

{res}->  mvdecode cas52, mv(9)
       {txt}cas52:{res}{col 15}1608{txt} missing values generated

{res}->  mvdecode cas53, mv(9)
       {txt}cas53:{res}{col 15}1625{txt} missing values generated

{res}->  mvdecode cas54, mv(9)
       {txt}cas54:{res}{col 15}1635{txt} missing values generated

{res}->  mvdecode cas55, mv(9)
       {txt}cas55:{res}{col 15}1641{txt} missing values generated

{res}->  mvdecode cas56, mv(9)
       {txt}cas56:{res}{col 15}1651{txt} missing values generated

{res}->  mvdecode cas57, mv(9)
       {txt}cas57:{res}{col 15}1655{txt} missing values generated

{res}->  mvdecode cas58, mv(9)
       {txt}cas58:{res}{col 15}1659{txt} missing values generated

{res}->  mvdecode cas59, mv(9)
       {txt}cas59:{res}{col 15}1662{txt} missing values generated

{res}->  mvdecode cas60, mv(9)
       {txt}cas60:{res}{col 15}1668{txt} missing values generated

{res}->  mvdecode cas61, mv(9)
       {txt}cas61:{res}{col 15}1658{txt} missing values generated

{res}->  mvdecode cas62, mv(9)
       {txt}cas62:{res}{col 15}1663{txt} missing values generated

{res}->  mvdecode cas63, mv(9)
       {txt}cas63:{res}{col 15}1673{txt} missing values generated

{res}->  mvdecode cas64, mv(9)
       {txt}cas64:{res}{col 15}1679{txt} missing values generated

{res}->  mvdecode cas65, mv(9)
       {txt}cas65:{res}{col 15}1688{txt} missing values generated
{com}. for num 18/65: mvdecode regX, mv(9)

{res}->  mvdecode reg18, mv(9)
       {txt}reg18:{res}{col 15}1397{txt} missing values generated

{res}->  mvdecode reg19, mv(9)
       {txt}reg19:{res}{col 15}1048{txt} missing values generated

{res}->  mvdecode reg20, mv(9)
       {txt}reg20:{res}{col 15}984{txt} missing values generated

{res}->  mvdecode reg21, mv(9)
       {txt}reg21:{res}{col 15}802{txt} missing values generated

{res}->  mvdecode reg22, mv(9)
       {txt}reg22:{res}{col 15}732{txt} missing values generated

{res}->  mvdecode reg23, mv(9)
       {txt}reg23:{res}{col 15}602{txt} missing values generated

{res}->  mvdecode reg24, mv(9)
       {txt}reg24:{res}{col 15}595{txt} missing values generated

{res}->  mvdecode reg25, mv(9)
       {txt}reg25:{res}{col 15}611{txt} missing values generated

{res}->  mvdecode reg26, mv(9)
       {txt}reg26:{res}{col 15}652{txt} missing values generated

{res}->  mvdecode reg27, mv(9)
       {txt}reg27:{res}{col 15}714{txt} missing values generated

{res}->  mvdecode reg28, mv(9)
       {txt}reg28:{res}{col 15}755{txt} missing values generated

{res}->  mvdecode reg29, mv(9)
       {txt}reg29:{res}{col 15}785{txt} missing values generated

{res}->  mvdecode reg30, mv(9)
       {txt}reg30:{res}{col 15}832{txt} missing values generated

{res}->  mvdecode reg31, mv(9)
       {txt}reg31:{res}{col 15}887{txt} missing values generated

{res}->  mvdecode reg32, mv(9)
       {txt}reg32:{res}{col 15}920{txt} missing values generated

{res}->  mvdecode reg33, mv(9)
       {txt}reg33:{res}{col 15}956{txt} missing values generated

{res}->  mvdecode reg34, mv(9)
       {txt}reg34:{res}{col 15}980{txt} missing values generated

{res}->  mvdecode reg35, mv(9)
       {txt}reg35:{res}{col 15}1001{txt} missing values generated

{res}->  mvdecode reg36, mv(9)
       {txt}reg36:{res}{col 15}1024{txt} missing values generated

{res}->  mvdecode reg37, mv(9)
       {txt}reg37:{res}{col 15}1058{txt} missing values generated

{res}->  mvdecode reg38, mv(9)
       {txt}reg38:{res}{col 15}1077{txt} missing values generated

{res}->  mvdecode reg39, mv(9)
       {txt}reg39:{res}{col 15}1100{txt} missing values generated

{res}->  mvdecode reg40, mv(9)
       {txt}reg40:{res}{col 15}1113{txt} missing values generated

{res}->  mvdecode reg41, mv(9)
       {txt}reg41:{res}{col 15}1146{txt} missing values generated

{res}->  mvdecode reg42, mv(9)
       {txt}reg42:{res}{col 15}1170{txt} missing values generated

{res}->  mvdecode reg43, mv(9)
       {txt}reg43:{res}{col 15}1190{txt} missing values generated

{res}->  mvdecode reg44, mv(9)
       {txt}reg44:{res}{col 15}1207{txt} missing values generated

{res}->  mvdecode reg45, mv(9)
       {txt}reg45:{res}{col 15}1224{txt} missing values generated

{res}->  mvdecode reg46, mv(9)
       {txt}reg46:{res}{col 15}1248{txt} missing values generated

{res}->  mvdecode reg47, mv(9)
       {txt}reg47:{res}{col 15}1259{txt} missing values generated

{res}->  mvdecode reg48, mv(9)
       {txt}reg48:{res}{col 15}1278{txt} missing values generated

{res}->  mvdecode reg49, mv(9)
       {txt}reg49:{res}{col 15}1311{txt} missing values generated

{res}->  mvdecode reg50, mv(9)
       {txt}reg50:{res}{col 15}1330{txt} missing values generated

{res}->  mvdecode reg51, mv(9)
       {txt}reg51:{res}{col 15}1344{txt} missing values generated

{res}->  mvdecode reg52, mv(9)
       {txt}reg52:{res}{col 15}1362{txt} missing values generated

{res}->  mvdecode reg53, mv(9)
       {txt}reg53:{res}{col 15}1380{txt} missing values generated

{res}->  mvdecode reg54, mv(9)
       {txt}reg54:{res}{col 15}1394{txt} missing values generated

{res}->  mvdecode reg55, mv(9)
       {txt}reg55:{res}{col 15}1416{txt} missing values generated

{res}->  mvdecode reg56, mv(9)
       {txt}reg56:{res}{col 15}1441{txt} missing values generated

{res}->  mvdecode reg57, mv(9)
       {txt}reg57:{res}{col 15}1459{txt} missing values generated

{res}->  mvdecode reg58, mv(9)
       {txt}reg58:{res}{col 15}1486{txt} missing values generated

{res}->  mvdecode reg59, mv(9)
       {txt}reg59:{res}{col 15}1509{txt} missing values generated

{res}->  mvdecode reg60, mv(9)
       {txt}reg60:{res}{col 15}1527{txt} missing values generated

{res}->  mvdecode reg61, mv(9)
       {txt}reg61:{res}{col 15}1617{txt} missing values generated

{res}->  mvdecode reg62, mv(9)
       {txt}reg62:{res}{col 15}1635{txt} missing values generated

{res}->  mvdecode reg63, mv(9)
       {txt}reg63:{res}{col 15}1658{txt} missing values generated

{res}->  mvdecode reg64, mv(9)
       {txt}reg64:{res}{col 15}1671{txt} missing values generated

{res}->  mvdecode reg65, mv(9)
       {txt}reg65:{res}{col 15}1680{txt} missing values generated
{com}. for num 18/65: mvdecode selfX, mv(9)

{res}->  mvdecode self18, mv(9)
      {txt}self18:{res}{col 15}1695{txt} missing values generated

{res}->  mvdecode self19, mv(9)
      {txt}self19:{res}{col 15}1682{txt} missing values generated

{res}->  mvdecode self20, mv(9)
      {txt}self20:{res}{col 15}1678{txt} missing values generated

{res}->  mvdecode self21, mv(9)
      {txt}self21:{res}{col 15}1671{txt} missing values generated

{res}->  mvdecode self22, mv(9)
      {txt}self22:{res}{col 15}1661{txt} missing values generated

{res}->  mvdecode self23, mv(9)
      {txt}self23:{res}{col 15}1649{txt} missing values generated

{res}->  mvdecode self24, mv(9)
      {txt}self24:{res}{col 15}1636{txt} missing values generated

{res}->  mvdecode self25, mv(9)
      {txt}self25:{res}{col 15}1634{txt} missing values generated

{res}->  mvdecode self26, mv(9)
      {txt}self26:{res}{col 15}1631{txt} missing values generated

{res}->  mvdecode self27, mv(9)
      {txt}self27:{res}{col 15}1627{txt} missing values generated

{res}->  mvdecode self28, mv(9)
      {txt}self28:{res}{col 15}1618{txt} missing values generated

{res}->  mvdecode self29, mv(9)
      {txt}self29:{res}{col 15}1614{txt} missing values generated

{res}->  mvdecode self30, mv(9)
      {txt}self30:{res}{col 15}1612{txt} missing values generated

{res}->  mvdecode self31, mv(9)
      {txt}self31:{res}{col 15}1608{txt} missing values generated

{res}->  mvdecode self32, mv(9)
      {txt}self32:{res}{col 15}1600{txt} missing values generated

{res}->  mvdecode self33, mv(9)
      {txt}self33:{res}{col 15}1600{txt} missing values generated

{res}->  mvdecode self34, mv(9)
      {txt}self34:{res}{col 15}1602{txt} missing values generated

{res}->  mvdecode self35, mv(9)
      {txt}self35:{res}{col 15}1590{txt} missing values generated

{res}->  mvdecode self36, mv(9)
      {txt}self36:{res}{col 15}1591{txt} missing values generated

{res}->  mvdecode self37, mv(9)
      {txt}self37:{res}{col 15}1598{txt} missing values generated

{res}->  mvdecode self38, mv(9)
      {txt}self38:{res}{col 15}1599{txt} missing values generated

{res}->  mvdecode self39, mv(9)
      {txt}self39:{res}{col 15}1597{txt} missing values generated

{res}->  mvdecode self40, mv(9)
      {txt}self40:{res}{col 15}1601{txt} missing values generated

{res}->  mvdecode self41, mv(9)
      {txt}self41:{res}{col 15}1606{txt} missing values generated

{res}->  mvdecode self42, mv(9)
      {txt}self42:{res}{col 15}1608{txt} missing values generated

{res}->  mvdecode self43, mv(9)
      {txt}self43:{res}{col 15}1609{txt} missing values generated

{res}->  mvdecode self44, mv(9)
      {txt}self44:{res}{col 15}1611{txt} missing values generated

{res}->  mvdecode self45, mv(9)
      {txt}self45:{res}{col 15}1614{txt} missing values generated

{res}->  mvdecode self46, mv(9)
      {txt}self46:{res}{col 15}1615{txt} missing values generated

{res}->  mvdecode self47, mv(9)
      {txt}self47:{res}{col 15}1619{txt} missing values generated

{res}->  mvdecode self48, mv(9)
      {txt}self48:{res}{col 15}1623{txt} missing values generated

{res}->  mvdecode self49, mv(9)
      {txt}self49:{res}{col 15}1625{txt} missing values generated

{res}->  mvdecode self50, mv(9)
      {txt}self50:{res}{col 15}1624{txt} missing values generated

{res}->  mvdecode self51, mv(9)
      {txt}self51:{res}{col 15}1628{txt} missing values generated

{res}->  mvdecode self52, mv(9)
      {txt}self52:{res}{col 15}1631{txt} missing values generated

{res}->  mvdecode self53, mv(9)
      {txt}self53:{res}{col 15}1633{txt} missing values generated

{res}->  mvdecode self54, mv(9)
      {txt}self54:{res}{col 15}1637{txt} missing values generated

{res}->  mvdecode self55, mv(9)
      {txt}self55:{res}{col 15}1642{txt} missing values generated

{res}->  mvdecode self56, mv(9)
      {txt}self56:{res}{col 15}1645{txt} missing values generated

{res}->  mvdecode self57, mv(9)
      {txt}self57:{res}{col 15}1647{txt} missing values generated

{res}->  mvdecode self58, mv(9)
      {txt}self58:{res}{col 15}1650{txt} missing values generated

{res}->  mvdecode self59, mv(9)
      {txt}self59:{res}{col 15}1655{txt} missing values generated

{res}->  mvdecode self60, mv(9)
      {txt}self60:{res}{col 15}1660{txt} missing values generated

{res}->  mvdecode self61, mv(9)
      {txt}self61:{res}{col 15}1670{txt} missing values generated

{res}->  mvdecode self62, mv(9)
      {txt}self62:{res}{col 15}1680{txt} missing values generated

{res}->  mvdecode self63, mv(9)
      {txt}self63:{res}{col 15}1688{txt} missing values generated

{res}->  mvdecode self64, mv(9)
      {txt}self64:{res}{col 15}1691{txt} missing values generated

{res}->  mvdecode self65, mv(9)
      {txt}self65:{res}{col 15}1697{txt} missing values generated
{com}. for num 18/65: mvdecode sideX, mv(9)

{res}->  mvdecode side18, mv(9)
      {txt}side18:{res}{col 15}1712{txt} missing values generated

{res}->  mvdecode side19, mv(9)
      {txt}side19:{res}{col 15}1709{txt} missing values generated

{res}->  mvdecode side20, mv(9)
      {txt}side20:{res}{col 15}1709{txt} missing values generated

{res}->  mvdecode side21, mv(9)
      {txt}side21:{res}{col 15}1706{txt} missing values generated

{res}->  mvdecode side22, mv(9)
      {txt}side22:{res}{col 15}1706{txt} missing values generated

{res}->  mvdecode side23, mv(9)
      {txt}side23:{res}{col 15}1702{txt} missing values generated

{res}->  mvdecode side24, mv(9)
      {txt}side24:{res}{col 15}1703{txt} missing values generated

{res}->  mvdecode side25, mv(9)
      {txt}side25:{res}{col 15}1699{txt} missing values generated

{res}->  mvdecode side26, mv(9)
      {txt}side26:{res}{col 15}1695{txt} missing values generated

{res}->  mvdecode side27, mv(9)
      {txt}side27:{res}{col 15}1693{txt} missing values generated

{res}->  mvdecode side28, mv(9)
      {txt}side28:{res}{col 15}1692{txt} missing values generated

{res}->  mvdecode side29, mv(9)
      {txt}side29:{res}{col 15}1691{txt} missing values generated

{res}->  mvdecode side30, mv(9)
      {txt}side30:{res}{col 15}1689{txt} missing values generated

{res}->  mvdecode side31, mv(9)
      {txt}side31:{res}{col 15}1687{txt} missing values generated

{res}->  mvdecode side32, mv(9)
      {txt}side32:{res}{col 15}1688{txt} missing values generated

{res}->  mvdecode side33, mv(9)
      {txt}side33:{res}{col 15}1692{txt} missing values generated

{res}->  mvdecode side34, mv(9)
      {txt}side34:{res}{col 15}1689{txt} missing values generated

{res}->  mvdecode side35, mv(9)
      {txt}side35:{res}{col 15}1690{txt} missing values generated

{res}->  mvdecode side36, mv(9)
      {txt}side36:{res}{col 15}1692{txt} missing values generated

{res}->  mvdecode side37, mv(9)
      {txt}side37:{res}{col 15}1694{txt} missing values generated

{res}->  mvdecode side38, mv(9)
      {txt}side38:{res}{col 15}1696{txt} missing values generated

{res}->  mvdecode side39, mv(9)
      {txt}side39:{res}{col 15}1696{txt} missing values generated

{res}->  mvdecode side40, mv(9)
      {txt}side40:{res}{col 15}1695{txt} missing values generated

{res}->  mvdecode side41, mv(9)
      {txt}side41:{res}{col 15}1701{txt} missing values generated

{res}->  mvdecode side42, mv(9)
      {txt}side42:{res}{col 15}1703{txt} missing values generated

{res}->  mvdecode side43, mv(9)
      {txt}side43:{res}{col 15}1703{txt} missing values generated

{res}->  mvdecode side44, mv(9)
      {txt}side44:{res}{col 15}1705{txt} missing values generated

{res}->  mvdecode side45, mv(9)
      {txt}side45:{res}{col 15}1705{txt} missing values generated

{res}->  mvdecode side46, mv(9)
      {txt}side46:{res}{col 15}1706{txt} missing values generated

{res}->  mvdecode side47, mv(9)
      {txt}side47:{res}{col 15}1705{txt} missing values generated

{res}->  mvdecode side48, mv(9)
      {txt}side48:{res}{col 15}1704{txt} missing values generated

{res}->  mvdecode side49, mv(9)
      {txt}side49:{res}{col 15}1704{txt} missing values generated

{res}->  mvdecode side50, mv(9)
      {txt}side50:{res}{col 15}1705{txt} missing values generated

{res}->  mvdecode side51, mv(9)
      {txt}side51:{res}{col 15}1706{txt} missing values generated

{res}->  mvdecode side52, mv(9)
      {txt}side52:{res}{col 15}1706{txt} missing values generated

{res}->  mvdecode side53, mv(9)
      {txt}side53:{res}{col 15}1706{txt} missing values generated

{res}->  mvdecode side54, mv(9)
      {txt}side54:{res}{col 15}1708{txt} missing values generated

{res}->  mvdecode side55, mv(9)
      {txt}side55:{res}{col 15}1708{txt} missing values generated

{res}->  mvdecode side56, mv(9)
      {txt}side56:{res}{col 15}1709{txt} missing values generated

{res}->  mvdecode side57, mv(9)
      {txt}side57:{res}{col 15}1709{txt} missing values generated

{res}->  mvdecode side58, mv(9)
      {txt}side58:{res}{col 15}1708{txt} missing values generated

{res}->  mvdecode side59, mv(9)
      {txt}side59:{res}{col 15}1711{txt} missing values generated

{res}->  mvdecode side60, mv(9)
      {txt}side60:{res}{col 15}1711{txt} missing values generated

{res}->  mvdecode side61, mv(9)
      {txt}side61:{res}{col 15}1711{txt} missing values generated

{res}->  mvdecode side62, mv(9)
      {txt}side62:{res}{col 15}1710{txt} missing values generated

{res}->  mvdecode side63, mv(9)
      {txt}side63:{res}{col 15}1711{txt} missing values generated

{res}->  mvdecode side64, mv(9)
      {txt}side64:{res}{col 15}1711{txt} missing values generated

{res}->  mvdecode side65, mv(9)
      {txt}side65:{res}{col 15}1711{txt} missing values generated
{com}. for num 18/65: mvdecode fmwX, mv(9)

{res}->  mvdecode fmw18, mv(9)
       {txt}fmw18:{res}{col 15}1710{txt} missing values generated

{res}->  mvdecode fmw19, mv(9)
       {txt}fmw19:{res}{col 15}1698{txt} missing values generated

{res}->  mvdecode fmw20, mv(9)
       {txt}fmw20:{res}{col 15}1696{txt} missing values generated

{res}->  mvdecode fmw21, mv(9)
       {txt}fmw21:{res}{col 15}1685{txt} missing values generated

{res}->  mvdecode fmw22, mv(9)
       {txt}fmw22:{res}{col 15}1677{txt} missing values generated

{res}->  mvdecode fmw23, mv(9)
       {txt}fmw23:{res}{col 15}1669{txt} missing values generated

{res}->  mvdecode fmw24, mv(9)
       {txt}fmw24:{res}{col 15}1654{txt} missing values generated

{res}->  mvdecode fmw25, mv(9)
       {txt}fmw25:{res}{col 15}1655{txt} missing values generated

{res}->  mvdecode fmw26, mv(9)
       {txt}fmw26:{res}{col 15}1651{txt} missing values generated

{res}->  mvdecode fmw27, mv(9)
       {txt}fmw27:{res}{col 15}1647{txt} missing values generated

{res}->  mvdecode fmw28, mv(9)
       {txt}fmw28:{res}{col 15}1647{txt} missing values generated

{res}->  mvdecode fmw29, mv(9)
       {txt}fmw29:{res}{col 15}1643{txt} missing values generated

{res}->  mvdecode fmw30, mv(9)
       {txt}fmw30:{res}{col 15}1641{txt} missing values generated

{res}->  mvdecode fmw31, mv(9)
       {txt}fmw31:{res}{col 15}1641{txt} missing values generated

{res}->  mvdecode fmw32, mv(9)
       {txt}fmw32:{res}{col 15}1642{txt} missing values generated

{res}->  mvdecode fmw33, mv(9)
       {txt}fmw33:{res}{col 15}1643{txt} missing values generated

{res}->  mvdecode fmw34, mv(9)
       {txt}fmw34:{res}{col 15}1641{txt} missing values generated

{res}->  mvdecode fmw35, mv(9)
       {txt}fmw35:{res}{col 15}1645{txt} missing values generated

{res}->  mvdecode fmw36, mv(9)
       {txt}fmw36:{res}{col 15}1648{txt} missing values generated

{res}->  mvdecode fmw37, mv(9)
       {txt}fmw37:{res}{col 15}1647{txt} missing values generated

{res}->  mvdecode fmw38, mv(9)
       {txt}fmw38:{res}{col 15}1647{txt} missing values generated

{res}->  mvdecode fmw39, mv(9)
       {txt}fmw39:{res}{col 15}1647{txt} missing values generated

{res}->  mvdecode fmw40, mv(9)
       {txt}fmw40:{res}{col 15}1645{txt} missing values generated

{res}->  mvdecode fmw41, mv(9)
       {txt}fmw41:{res}{col 15}1656{txt} missing values generated

{res}->  mvdecode fmw42, mv(9)
       {txt}fmw42:{res}{col 15}1656{txt} missing values generated

{res}->  mvdecode fmw43, mv(9)
       {txt}fmw43:{res}{col 15}1661{txt} missing values generated

{res}->  mvdecode fmw44, mv(9)
       {txt}fmw44:{res}{col 15}1667{txt} missing values generated

{res}->  mvdecode fmw45, mv(9)
       {txt}fmw45:{res}{col 15}1670{txt} missing values generated

{res}->  mvdecode fmw46, mv(9)
       {txt}fmw46:{res}{col 15}1670{txt} missing values generated

{res}->  mvdecode fmw47, mv(9)
       {txt}fmw47:{res}{col 15}1674{txt} missing values generated

{res}->  mvdecode fmw48, mv(9)
       {txt}fmw48:{res}{col 15}1675{txt} missing values generated

{res}->  mvdecode fmw49, mv(9)
       {txt}fmw49:{res}{col 15}1676{txt} missing values generated

{res}->  mvdecode fmw50, mv(9)
       {txt}fmw50:{res}{col 15}1677{txt} missing values generated

{res}->  mvdecode fmw51, mv(9)
       {txt}fmw51:{res}{col 15}1680{txt} missing values generated

{res}->  mvdecode fmw52, mv(9)
       {txt}fmw52:{res}{col 15}1682{txt} missing values generated

{res}->  mvdecode fmw53, mv(9)
       {txt}fmw53:{res}{col 15}1685{txt} missing values generated

{res}->  mvdecode fmw54, mv(9)
       {txt}fmw54:{res}{col 15}1687{txt} missing values generated

{res}->  mvdecode fmw55, mv(9)
       {txt}fmw55:{res}{col 15}1688{txt} missing values generated

{res}->  mvdecode fmw56, mv(9)
       {txt}fmw56:{res}{col 15}1690{txt} missing values generated

{res}->  mvdecode fmw57, mv(9)
       {txt}fmw57:{res}{col 15}1691{txt} missing values generated

{res}->  mvdecode fmw58, mv(9)
       {txt}fmw58:{res}{col 15}1693{txt} missing values generated

{res}->  mvdecode fmw59, mv(9)
       {txt}fmw59:{res}{col 15}1693{txt} missing values generated

{res}->  mvdecode fmw60, mv(9)
       {txt}fmw60:{res}{col 15}1698{txt} missing values generated

{res}->  mvdecode fmw61, mv(9)
       {txt}fmw61:{res}{col 15}1701{txt} missing values generated

{res}->  mvdecode fmw62, mv(9)
       {txt}fmw62:{res}{col 15}1702{txt} missing values generated

{res}->  mvdecode fmw63, mv(9)
       {txt}fmw63:{res}{col 15}1704{txt} missing values generated

{res}->  mvdecode fmw64, mv(9)
       {txt}fmw64:{res}{col 15}1708{txt} missing values generated

{res}->  mvdecode fmw65, mv(9)
       {txt}fmw65:{res}{col 15}1709{txt} missing values generated
{com}. for num 18/65: replace weX=1 if casX!=. | regX!=. | selfX!=. | sideX!=. | fmwX!=. 

{res}->  replace we18=1 if cas18!=. | reg18!=. | self18!=. | side18!=. | fmw18!=.
{txt}(393 real changes made)

{res}->  replace we19=1 if cas19!=. | reg19!=. | self19!=. | side19!=. | fmw19!=.
{txt}(810 real changes made)

{res}->  replace we20=1 if cas20!=. | reg20!=. | self20!=. | side20!=. | fmw20!=.
{txt}(888 real changes made)

{res}->  replace we21=1 if cas21!=. | reg21!=. | self21!=. | side21!=. | fmw21!=.
{txt}(1,117 real changes made)

{res}->  replace we22=1 if cas22!=. | reg22!=. | self22!=. | side22!=. | fmw22!=.
{txt}(1,202 real changes made)

{res}->  replace we23=1 if cas23!=. | reg23!=. | self23!=. | side23!=. | fmw23!=.
{txt}(1,362 real changes made)

{res}->  replace we24=1 if cas24!=. | reg24!=. | self24!=. | side24!=. | fmw24!=.
{txt}(1,382 real changes made)

{res}->  replace we25=1 if cas25!=. | reg25!=. | self25!=. | side25!=. | fmw25!=.
{txt}(1,362 real changes made)

{res}->  replace we26=1 if cas26!=. | reg26!=. | self26!=. | side26!=. | fmw26!=.
{txt}(1,322 real changes made)

{res}->  replace we27=1 if cas27!=. | reg27!=. | self27!=. | side27!=. | fmw27!=.
{txt}(1,270 real changes made)

{res}->  replace we28=1 if cas28!=. | reg28!=. | self28!=. | side28!=. | fmw28!=.
{txt}(1,231 real changes made)

{res}->  replace we29=1 if cas29!=. | reg29!=. | self29!=. | side29!=. | fmw29!=.
{txt}(1,205 real changes made)

{res}->  replace we30=1 if cas30!=. | reg30!=. | self30!=. | side30!=. | fmw30!=.
{txt}(1,160 real changes made)

{res}->  replace we31=1 if cas31!=. | reg31!=. | self31!=. | side31!=. | fmw31!=.
{txt}(1,114 real changes made)

{res}->  replace we32=1 if cas32!=. | reg32!=. | self32!=. | side32!=. | fmw32!=.
{txt}(1,096 real changes made)

{res}->  replace we33=1 if cas33!=. | reg33!=. | self33!=. | side33!=. | fmw33!=.
{txt}(1,068 real changes made)

{res}->  replace we34=1 if cas34!=. | reg34!=. | self34!=. | side34!=. | fmw34!=.
{txt}(1,054 real changes made)

{res}->  replace we35=1 if cas35!=. | reg35!=. | self35!=. | side35!=. | fmw35!=.
{txt}(1,044 real changes made)

{res}->  replace we36=1 if cas36!=. | reg36!=. | self36!=. | side36!=. | fmw36!=.
{txt}(1,027 real changes made)

{res}->  replace we37=1 if cas37!=. | reg37!=. | self37!=. | side37!=. | fmw37!=.
{txt}(989 real changes made)

{res}->  replace we38=1 if cas38!=. | reg38!=. | self38!=. | side38!=. | fmw38!=.
{txt}(975 real changes made)

{res}->  replace we39=1 if cas39!=. | reg39!=. | self39!=. | side39!=. | fmw39!=.
{txt}(961 real changes made)

{res}->  replace we40=1 if cas40!=. | reg40!=. | self40!=. | side40!=. | fmw40!=.
{txt}(949 real changes made)

{res}->  replace we41=1 if cas41!=. | reg41!=. | self41!=. | side41!=. | fmw41!=.
{txt}(891 real changes made)

{res}->  replace we42=1 if cas42!=. | reg42!=. | self42!=. | side42!=. | fmw42!=.
{txt}(867 real changes made)

{res}->  replace we43=1 if cas43!=. | reg43!=. | self43!=. | side43!=. | fmw43!=.
{txt}(837 real changes made)

{res}->  replace we44=1 if cas44!=. | reg44!=. | self44!=. | side44!=. | fmw44!=.
{txt}(798 real changes made)

{res}->  replace we45=1 if cas45!=. | reg45!=. | self45!=. | side45!=. | fmw45!=.
{txt}(771 real changes made)

{res}->  replace we46=1 if cas46!=. | reg46!=. | self46!=. | side46!=. | fmw46!=.
{txt}(735 real changes made)

{res}->  replace we47=1 if cas47!=. | reg47!=. | self47!=. | side47!=. | fmw47!=.
{txt}(716 real changes made)

{res}->  replace we48=1 if cas48!=. | reg48!=. | self48!=. | side48!=. | fmw48!=.
{txt}(690 real changes made)

{res}->  replace we49=1 if cas49!=. | reg49!=. | self49!=. | side49!=. | fmw49!=.
{txt}(646 real changes made)

{res}->  replace we50=1 if cas50!=. | reg50!=. | self50!=. | side50!=. | fmw50!=.
{txt}(625 real changes made)

{res}->  replace we51=1 if cas51!=. | reg51!=. | self51!=. | side51!=. | fmw51!=.
{txt}(596 real changes made)

{res}->  replace we52=1 if cas52!=. | reg52!=. | self52!=. | side52!=. | fmw52!=.
{txt}(567 real changes made)

{res}->  replace we53=1 if cas53!=. | reg53!=. | self53!=. | side53!=. | fmw53!=.
{txt}(529 real changes made)

{res}->  replace we54=1 if cas54!=. | reg54!=. | self54!=. | side54!=. | fmw54!=.
{txt}(494 real changes made)

{res}->  replace we55=1 if cas55!=. | reg55!=. | self55!=. | side55!=. | fmw55!=.
{txt}(460 real changes made)

{res}->  replace we56=1 if cas56!=. | reg56!=. | self56!=. | side56!=. | fmw56!=.
{txt}(421 real changes made)

{res}->  replace we57=1 if cas57!=. | reg57!=. | self57!=. | side57!=. | fmw57!=.
{txt}(395 real changes made)

{res}->  replace we58=1 if cas58!=. | reg58!=. | self58!=. | side58!=. | fmw58!=.
{txt}(361 real changes made)

{res}->  replace we59=1 if cas59!=. | reg59!=. | self59!=. | side59!=. | fmw59!=.
{txt}(328 real changes made)

{res}->  replace we60=1 if cas60!=. | reg60!=. | self60!=. | side60!=. | fmw60!=.
{txt}(294 real changes made)

{res}->  replace we61=1 if cas61!=. | reg61!=. | self61!=. | side61!=. | fmw61!=.
{txt}(203 real changes made)

{res}->  replace we62=1 if cas62!=. | reg62!=. | self62!=. | side62!=. | fmw62!=.
{txt}(169 real changes made)

{res}->  replace we63=1 if cas63!=. | reg63!=. | self63!=. | side63!=. | fmw63!=.
{txt}(126 real changes made)

{res}->  replace we64=1 if cas64!=. | reg64!=. | self64!=. | side64!=. | fmw64!=.
{txt}(100 real changes made)

{res}->  replace we65=1 if cas65!=. | reg65!=. | self65!=. | side65!=. | fmw65!=.
{txt}(75 real changes made)
{com}. egen workexp2012=rowtotal(we18-we65)
. keep id workexp2012 year
. sort id
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\WorkexpKHPS_new_2012.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\WorkexpKHPS_new_2012.dta saved
{com}. {c )-}
. 
. ** idと勤続年数を抽出
. {c -(}
. ** JHPS勤続年数
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPS2009.dta", clear
. keep id emptenure
. replace emptenure=. if emptenure<0
{txt}(0 real changes made)
{com}. sort id
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\EmptenJHPS.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\EmptenJHPS.dta saved
{com}. 
. ** KHPS勤続年数
. **** old cohort
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2004.dta", clear
. keep id emptenure
. replace emptenure=. if emptenure<0
{txt}(0 real changes made)
{com}. sort id
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\EmptenKHPS.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\EmptenKHPS.dta saved
{com}. 
. **** new cohort 2007
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2007_new.dta", clear
. keep id emptenure
. replace emptenure=. if emptenure<0
{txt}(0 real changes made)
{com}. sort id
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\EmptenKHPS_new_2007.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\EmptenKHPS_new_2007.dta saved
{com}. 
. **** new cohort 2012
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\KHPS2012_new.dta", clear
. keep id emptenure
. replace emptenure=. if emptenure<0
{txt}(0 real changes made)
{com}. sort id
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\EmptenKHPS_new_2012.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\EmptenKHPS_new_2012.dta saved
{com}. 
. {c )-}
. 
. ** 学歴と就業履歴をサンプルにマージ
. {c -(}
. ** idで学歴データをマージ
. use "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\JHPSKHPS_2004_2014.dta", clear
. sort id year
. merge m:1 id using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Schooling.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}           9,077
{txt}{col 9}from master{col 30}{res}           9,077{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}          88,818{txt}  (_merge==3)
{col 5}{hline 41}
{com}. drop _merge
. 
. ** idでサンプルに入ったときの労働経験をマージ
. merge m:1 id using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\Cohort.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          97,895{txt}  (_merge==3)
{col 5}{hline 41}
{com}. drop _merge
. merge m:1 id using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\WorkexpJHPS.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          67,098
{txt}{col 9}from master{col 30}{res}          67,098{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}          30,797{txt}  (_merge==3)
{col 5}{hline 41}
{com}. drop _merge
. merge m:1 id using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\WorkexpKHPS.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          50,707
{txt}{col 9}from master{col 30}{res}          50,707{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}          47,188{txt}  (_merge==3)
{col 5}{hline 41}
{com}. drop _merge
. merge m:1 id using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\WorkexpKHPS_new_2007.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          90,146
{txt}{col 9}from master{col 30}{res}          90,146{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}           7,749{txt}  (_merge==3)
{col 5}{hline 41}
{com}. drop _merge
. merge m:1 id using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\WorkexpKHPS_new_2012.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          95,658
{txt}{col 9}from master{col 30}{res}          95,658{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}           2,237{txt}  (_merge==3)
{col 5}{hline 41}
{com}. drop _merge
. 
. ** idでサンプルに入ったときの勤続年数をマージ
. merge m:1 id using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\EmptenJHPS.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          66,251
{txt}{col 9}from master{col 30}{res}          66,251{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}          31,644{txt}  (_merge==3)
{col 5}{hline 41}
{com}. drop _merge
. rename emptenure empten2009
{res}{com}. merge m:1 id using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\EmptenKHPS.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          50,707
{txt}{col 9}from master{col 30}{res}          50,707{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}          47,188{txt}  (_merge==3)
{col 5}{hline 41}
{com}. drop _merge
. rename emptenure empten2004
{res}{com}. merge m:1 id using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\EmptenKHPS_new_2007.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          90,146
{txt}{col 9}from master{col 30}{res}          90,146{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}           7,749{txt}  (_merge==3)
{col 5}{hline 41}
{com}. drop _merge
. rename emptenure empten2007
{res}{com}. merge m:1 id using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\EmptenKHPS_new_2012.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          95,658
{txt}{col 9}from master{col 30}{res}          95,658{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}           2,237{txt}  (_merge==3)
{col 5}{hline 41}
{com}. drop _merge
. rename emptenure empten2012
{res}{com}. 
. ** データに入った年のサンプルにのみ労働経験年数を作成(他の年はworkexp=0)
. *** experience
. gen intexp=workexp2004 if workexp2004!=.
{txt}(50,707 missing values generated)
{com}. for num 2007 2010 2012: replace intexp=workexpX if workexpX!=.

{res}->  replace intexp=workexp2007 if workexp2007!=.
{txt}(7,749 real changes made)

{res}->  replace intexp=workexp2010 if workexp2010!=.
{txt}(30,797 real changes made)

{res}->  replace intexp=workexp2012 if workexp2012!=.
{txt}(2,237 real changes made)
{com}. sort id year
. by id: gen workexp = intexp if _n==1&cohort!=9
{txt}(86,800 missing values generated)
{com}. replace workexp=intexp if cohort==9&year==2010
{txt}(6,010 real changes made)
{com}. replace workexp=0 if workexp==.
{txt}(80,790 real changes made)
{com}. 
. *** emptenure
. gen intten=empten2004 if empten2004!=.
{txt}(65,575 missing values generated)
{com}. for num 2007 2009 2012: replace intten=emptenX if emptenX!=.

{res}->  replace intten=empten2007 if empten2007!=.
{txt}(5,377 real changes made)

{res}->  replace intten=empten2009 if empten2009!=.
{txt}(20,178 real changes made)

{res}->  replace intten=empten2012 if empten2012!=.
{txt}(1,575 real changes made)
{com}. sort id year
. by id: gen emptenure = intten if _n==1
{txt}(85,950 missing values generated)
{com}. by id: replace emptenure=0 if emptenure==.&_n>1
{txt}(77557 real changes made)
{com}. 
. *** 年間労働時間 = workhourperweek*52
. gen workinghour=workhourperweek*52
. 
. *** 労働時間800時間以上ダミー作成
. gen morethan800=0 if workinghour<800|workinghour==.
{txt}(88,043 missing values generated)
{com}. replace morethan800=1 if morethan800==.
{txt}(88,043 real changes made)
{com}. 
. *** パネル化
. tsset id year
{res}{txt}{col 8}panel variable:  {res}id (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 2004 to 2014, but with gaps
{txt}{col 17}delta:  {res}1 unit
{com}. 
. *** JHPSは2010の労働経験年数をもとに2009の労働経験年数を作成
. replace workexp=workexp2010-1 if morethan800==1&cohort==9&year==2009
{txt}(6,270 real changes made, 866 to missing)
{com}. replace workexp=workexp2010 if morethan800==0&cohort==9&year==2009
{txt}(603 real changes made, 63 to missing)
{com}. {c )-}
. {c )-}
{txt}
{com}. 
. * 8
. ** データクリーニング/欠損値の修正・賃金データ作成・失業率のマージ
. {c -(}
. ** 欠損値の修正
. {c -(}
. *marital
. replace marital=0 if marital==2
{txt}(13,944 real changes made)
{com}. *empstlmonth　先月の勤務状況 0=仕事してない/1=仕事した
. mvdecode workstatus, mv(9)
  {txt}workstatus:{res}{col 15}571{txt} missing values generated
{com}. replace workstatus=1 if workstatus<=3
{txt}(13,468 real changes made)
{com}. replace workstatus=0 if workstatus>3
{txt}(30,415 real changes made)
{com}. *occ
. for num 88 99: mvdecode occ, mv(X)

{res}->  mvdecode occ, mv(88)
         {txt}occ:{res}{col 15}28770{txt} missing values generated

{res}->  mvdecode occ, mv(99)
         {txt}occ:{res}{col 15}1332{txt} missing values generated
{com}. *owner
. for num 8 9: mvdecode owner, mv(X)

{res}->  mvdecode owner, mv(8)
       {txt}owner:{res}{col 15}28770{txt} missing values generated

{res}->  mvdecode owner, mv(9)
       {txt}owner:{res}{col 15}1226{txt} missing values generated
{com}. *ind
. for num 88 99: mvdecode ind, mv(X)

{res}->  mvdecode ind, mv(88)
         {txt}ind:{res}{col 15}28489{txt} missing values generated

{res}->  mvdecode ind, mv(99)
         {txt}ind:{res}{col 15}934{txt} missing values generated
{com}. *size
. ** 1=1~4, 2=5~29, 3=30~99, 4=100~499, 5=500~, 6: 官公庁
. ** 大企業=500~, 中小企業=~499
. replace size=1 if (size==1|size==2)&(year==2004)
{txt}(847 real changes made)
{com}. replace size=2 if (size==2|size==3)&(year==2004)
{txt}(473 real changes made)
{com}. replace size=3 if (size==5|size==6)&(year==2004)
{txt}(693 real changes made)
{com}. replace size=4 if (size==7|size==8)&(year==2004)
{txt}(775 real changes made)
{com}. replace size=5 if (size==9|size==10)&(year==2004)
{txt}(933 real changes made)
{com}. replace size=6 if (size==11)&(year==2004)
{txt}(275 real changes made)
{com}. replace size=0 if size<5
{txt}(49,058 real changes made)
{com}. replace size=1 if size==5
{txt}(14,035 real changes made)
{com}. for num  8 9 88 99: mvdecode size, mv(X)

{res}->  mvdecode size, mv(8)
        {txt}size:{res}{col 15}27434{txt} missing values generated

{res}->  mvdecode size, mv(9)
        {txt}size:{res}{col 15}1510{txt} missing values generated

{res}->  mvdecode size, mv(88)
        {txt}size:{res}{col 15}1888{txt} missing values generated

{res}->  mvdecode size, mv(99)
        {txt}size:{res}{col 15}140{txt} missing values generated
{com}. *switch
. for num 88 99: mvdecode switch, mv(X)

{res}->  mvdecode switch, mv(88)

->  mvdecode switch, mv(99)
      {txt}switch:{res}{col 15}1757{txt} missing values generated
{com}. replace switch=0 if switch<=3 | switch==7 | switch==8
{txt}(71,367 real changes made)
{com}. replace switch=1 if switch>=4&switch<=6
{txt}(6,765 real changes made)
{com}. replace switch=0 if switch==.
{txt}(1,757 real changes made)
{com}. *employed 1=勤め人
. for num 8 9: mvdecode employed, mv(X)

{res}->  mvdecode employed, mv(8)
    {txt}employed:{res}{col 15}28773{txt} missing values generated

{res}->  mvdecode employed, mv(9)
    {txt}employed:{res}{col 15}870{txt} missing values generated
{com}. replace employed=0 if employed<=4 | employed==6
{txt}(17,059 real changes made)
{com}. replace employed=1 if employed==5
{txt}(51,161 real changes made)
{com}. *regular 0=非正規/1=正規
. for num 8 9: mvdecode regular, mv(X)

{res}->  mvdecode regular, mv(8)
     {txt}regular:{res}{col 15}46721{txt} missing values generated

{res}->  mvdecode regular, mv(9)
     {txt}regular:{res}{col 15}914{txt} missing values generated
{com}. replace regular=0 if regular>=4 & regular!=.
{txt}(18,134 real changes made)
{com}. replace regular=1 if regular!=0 & regular!=.
{txt}(13,287 real changes made)
{com}. *union
. replace union=0 if union<=2 | union==5
{txt}(53,277 real changes made)
{com}. replace union=1 if union>1
{txt}(44,618 real changes made)
{com}. for num 8 9: mvdecode union, mv(X)

{res}->  mvdecode union, mv(8)

->  mvdecode union, mv(9)
{com}. *paymethod
. for num 8 9: mvdecode paymethod, mv(X)

{res}->  mvdecode paymethod, mv(8)
   {txt}paymethod:{res}{col 15}28772{txt} missing values generated

{res}->  mvdecode paymethod, mv(9)
   {txt}paymethod:{res}{col 15}5079{txt} missing values generated
{com}. *monthlypaid
. for num 88888 99999: mvdecode monthlypaid, mv(X)

{res}->  mvdecode monthlypaid, mv(88888)
 {txt}monthlypaid:{res}{col 15}53037{txt} missing values generated

{res}->  mvdecode monthlypaid, mv(99999)
 {txt}monthlypaid:{res}{col 15}1327{txt} missing values generated
{com}. *dailypaid
. for num 888888 999999: mvdecode dailypaid, mv(X)

{res}->  mvdecode dailypaid, mv(888888)
   {txt}dailypaid:{res}{col 15}94429{txt} missing values generated

{res}->  mvdecode dailypaid, mv(999999)
   {txt}dailypaid:{res}{col 15}95{txt} missing values generated
{com}. *hourlypaid
. for num 888888 999999: mvdecode hourlypaid, mv(X)

{res}->  mvdecode hourlypaid, mv(888888)
  {txt}hourlypaid:{res}{col 15}85758{txt} missing values generated

{res}->  mvdecode hourlypaid, mv(999999)
  {txt}hourlypaid:{res}{col 15}109{txt} missing values generated
{com}. *yearlypaid
. for num 88888 99999: mvdecode yearlypaid, mv(X)

{res}->  mvdecode yearlypaid, mv(88888)
  {txt}yearlypaid:{res}{col 15}94308{txt} missing values generated

{res}->  mvdecode yearlypaid, mv(99999)
  {txt}yearlypaid:{res}{col 15}190{txt} missing values generated
{com}. *bonus
. for num 88888 99999: mvdecode bonus, mv(X)

{res}->  mvdecode bonus, mv(88888)
       {txt}bonus:{res}{col 15}28773{txt} missing values generated

{res}->  mvdecode bonus, mv(99999)
       {txt}bonus:{res}{col 15}4990{txt} missing values generated
{com}. *workdaypermonth
. for num 88 99: mvdecode workdaypermonth, mv(X)

{res}->  mvdecode workdaypermonth, mv(88)
{txt}workdayper~h:{res}{col 15}28772{txt} missing values generated

{res}->  mvdecode workdaypermonth, mv(99)
{txt}workdayper~h:{res}{col 15}3395{txt} missing values generated
{com}. *workhourperweek
. for num 888 999: mvdecode workhourperweek, mv(X)

{res}->  mvdecode workhourperweek, mv(888)
{txt}workhourpe~k:{res}{col 15}28772{txt} missing values generated

{res}->  mvdecode workhourperweek, mv(999)
{txt}workhourpe~k:{res}{col 15}5191{txt} missing values generated
{com}. *overworkperweek
. for num 888 999: mvdecode overworkperweek, mv(X)

{res}->  mvdecode overworkperweek, mv(888)
{txt}overworkpe~k:{res}{col 15}28772{txt} missing values generated

{res}->  mvdecode overworkperweek, mv(999)
{txt}overworkpe~k:{res}{col 15}22995{txt} missing values generated
{com}. {c )-}
. 
. ** 賃金データ作成
. {c -(}
. *** 賃金データの単位を合わせる(円)
. replace monthlypaid=monthlypaid*1000
{txt}(43,528 real changes made)
{com}. replace bonus=bonus*10000
{txt}(31,604 real changes made)
{com}. replace yearlypaid=yearlypaid*10000
{txt}(3,391 real changes made)
{com}. 
. ** 働き方に応じた年収を作成
. gen income=0
. *** 月給: monthlypaid*12+bonus
. replace income=monthlypaid*12+bonus if paymethod==1|paymethod==2
{txt}(44,854 real changes made, 2,361 to missing)
{com}. *** 日給: dailypaid*workdaypermonth*12+bonus
. replace income=dailypaid*workdaypermonth*12+bonus if paymethod==3
{txt}(3,465 real changes made, 263 to missing)
{com}. *** 時給: hourlypaid*workhourperweek*52+bonus
. replace income=hourlypaid*workhourperweek*52+bonus if paymethod==4
{txt}(12,136 real changes made, 700 to missing)
{com}. *** 年俸: yearlypaid+bonus
. replace income=yearlypaid+bonus
{txt}(94,565 real changes made, 91,381 to missing)
{com}. *** 支払い方法不明: 4パターンの年収のうちの最大値
. replace income=max(monthlypaid*12+bonus, dailypaid*workdaypermonth*12+bonus, ////
> hourlypaid*workhourperweek*52+bonus, yearlypaid+bonus)
{txt}(57,134 real changes made)
{com}. 
. ** 時給を算出: income/workinghour
. gen wage=income/workinghour
{txt}(37,571 missing values generated)
{com}. 
. ** 時給を実質化+失業率とインフレ率をマージ
. gen realwage=0
. merge m:1 year using "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Intermediate\InflateUnempRate.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}          97,895{txt}  (_merge==3)
{col 5}{hline 41}
{com}. replace realwage=wage/infrate*100
{txt}(97,886 real changes made, 37,571 to missing)
{com}. drop _merge lagunemprate infrate
. *** 時給250円以下を欠損値にする
. replace realwage=. if realwage<250
{txt}(2,716 real changes made, 2,716 to missing)
{com}. *** 実質時給をlog化
. replace realwage=log(realwage)
{txt}(57,608 real changes made)
{com}. {c )-}
. {c )-}
{txt}
{com}. 
. save  "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Input\jhps_hc_TenureCheck.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Input\jhps_hc_TenureCheck.dta saved

{com}. 
. * 9
. ** テニュア変数の作成
. {c -(}
. *** テニュア変数の基準
. **** 労働時間が年間800時間以上&転職していない -> +1
. ***** サンプルが落ちている期間も就業を継続していたと仮定する
. **** 労働時間が年間800時間未満- > stay
. **** 転職した -> 0
. 
. *** パネル化
. tsset id year
{res}{txt}{col 8}panel variable:  {res}id (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 2004 to 2014, but with gaps
{txt}{col 17}delta:  {res}1 unit
{com}. 
. *** emptenure
. forvalues X = 2005(1)2014{c -(} 
{txt}  2{com}.         **** 労働時間800時間以上&転職してない->+1
.         replace emptenure=emptenure[_n-1]+(year-year[_n-1]) ///
>                 if morethan800==1 & switch==0 & year==`X'
{txt}  3{com}.         **** 労働時間800時間未満&転職してない->+-0
.         replace emptenure=emptenure[_n-1] ///
>                 if morethan800==0 & switch==0 & year==`X'
{txt}  4{com}.         **** 転職した->0
.         replace emptenure=0 ///
>                 if switch==1 & year==`X'
{txt}  5{com}.         **** 最初のobservationは変更しない
.         bysort id (year): replace emptenure=intten if _n==1
{txt}  6{com}. {c )-}
{txt}(4,689 real changes made, 1,532 to missing)
(505 real changes made, 74 to missing)
(7 real changes made)
(30 real changes made, 30 to missing)
(4,151 real changes made, 1,246 to missing)
(400 real changes made, 73 to missing)
(2 real changes made)
(21 real changes made, 21 to missing)
(6,001 real changes made, 1,154 to missing)
(614 real changes made, 74 to missing)
(4 real changes made)
(2439 real changes made, 731 to missing)
(5,303 real changes made, 1,213 to missing)
(549 real changes made, 71 to missing)
(140 real changes made)
(1241 real changes made, 1241 to missing)
(11,189 real changes made, 1,980 to missing)
(1,134 real changes made, 177 to missing)
(6 real changes made)
(6922 real changes made, 2580 to missing)
(9,655 real changes made, 3,695 to missing)
(949 real changes made, 207 to missing)
(9 real changes made)
(46 real changes made, 46 to missing)
(9,024 real changes made, 3,254 to missing)
(792 real changes made, 182 to missing)
(9 real changes made)
(32 real changes made, 32 to missing)
(9,850 real changes made, 2,849 to missing)
(927 real changes made, 174 to missing)
(7 real changes made)
(1741 real changes made, 536 to missing)
(7,749 real changes made, 2,545 to missing)
(710 real changes made, 157 to missing)
(3 real changes made)
(23 real changes made, 23 to missing)
(7,599 real changes made, 2,429 to missing)
(736 real changes made, 138 to missing)
(82 real changes made)
(95 real changes made, 95 to missing)
{com}. drop empten2* intten
. 
. *** workexp
. forvalues X = 2005(1)2014{c -(} 
{txt}  2{com}.         **** 労働時間800時間以上->+1
.         bysort id (year): replace workexp=workexp[_n-1]+(year-year[_n-1]) ///
>                 if morethan800==1 & _n!=1 & year==`X'
{txt}  3{com}.         **** 労働時間800時間未満->+-0
.         bysort id (year): replace workexp=workexp[_n-1] ///
>                 if morethan800==0 & _n!=1 & year==`X'
{txt}  4{com}.         **** 最初のobservationは変更しない
.         bysort id (year): replace workexp=intexp if _n==1
{txt}  5{com}. {c )-}
{txt}(5174 real changes made)
(554 real changes made)
(7727 real changes made, 2304 to missing)
(4556 real changes made, 23 to missing)
(493 real changes made, 2 to missing)
(0 real changes made)
(4151 real changes made, 37 to missing)
(482 real changes made, 6 to missing)
(0 real changes made)
(4665 real changes made, 48 to missing)
(563 real changes made, 8 to missing)
(0 real changes made)
(5368 real changes made, 1073 to missing)
(643 real changes made, 130 to missing)
(0 real changes made)
(10475 real changes made, 1013 to missing)
(583 real changes made, 124 to missing)
(0 real changes made)
(9798 real changes made, 996 to missing)
(1034 real changes made, 98 to missing)
(0 real changes made)
(8900 real changes made, 951 to missing)
(1057 real changes made, 116 to missing)
(0 real changes made)
(8338 real changes made, 933 to missing)
(937 real changes made, 112 to missing)
(0 real changes made)
(8176 real changes made, 908 to missing)
(989 real changes made, 113 to missing)
(0 real changes made)
{com}. drop workexp2* intexp
. 
. *** occtenure
. gen occtenure = emptenure if _n==1
{txt}(97,895 missing values generated)
{com}. replace occtenure=0 if occtenure==.
{txt}(97,895 real changes made)
{com}. bysort id (year): gen occswitch=0 if occ==occ[_n-1] | occ==. | occ[_n-1]==. | _n==1
{txt}(10,719 missing values generated)
{com}. replace occswitch=1 if occswitch==.
{txt}(10,719 real changes made)
{com}. 
. forvalues X = 2005(1)2014{c -(} 
{txt}  2{com}.         **** 労働時間800時間以上&転職してない->+1
.         replace occtenure=occtenure[_n-1]+(year-year[_n-1]) ///
>                 if morethan800==1 & occswitch==0 & year==`X'
{txt}  3{com}.         **** 労働時間800時間未満&転職してない->+-0
.         replace occtenure=occtenure[_n-1] ///
>                 if morethan800==0 & occswitch==0 & year==`X' 
{txt}  4{com}.         **** 転職した->0
.         replace occtenure=0 ///
>                 if occswitch==1 & occ!=. & occ[_n-1]!=. & year==`X'
{txt}  5{com}.         **** 最初のobservationは変更しない
.         bysort id (year): replace occtenure=emptenure if _n==1
{txt}  6{com}. {c )-}
{txt}(3,962 real changes made)
(0 real changes made)
(0 real changes made)
(20338 real changes made, 8393 to missing)
(3,824 real changes made, 21 to missing)
(195 real changes made, 2 to missing)
(0 real changes made)
(21 real changes made, 21 to missing)
(5,801 real changes made, 89 to missing)
(505 real changes made, 16 to missing)
(0 real changes made)
(2440 real changes made, 732 to missing)
(5,142 real changes made, 299 to missing)
(500 real changes made, 24 to missing)
(0 real changes made)
(1250 real changes made, 1250 to missing)
(10,939 real changes made, 1,144 to missing)
(1,055 real changes made, 123 to missing)
(0 real changes made)
(6922 real changes made, 2580 to missing)
(9,289 real changes made, 3,060 to missing)
(863 real changes made, 214 to missing)
(0 real changes made)
(48 real changes made, 48 to missing)
(8,687 real changes made, 2,744 to missing)
(723 real changes made, 177 to missing)
(0 real changes made)
(29 real changes made, 29 to missing)
(9,438 real changes made, 2,388 to missing)
(871 real changes made, 192 to missing)
(0 real changes made)
(1739 real changes made, 534 to missing)
(7,424 real changes made, 2,156 to missing)
(660 real changes made, 145 to missing)
(0 real changes made)
(23 real changes made, 23 to missing)
(7,264 real changes made, 2,085 to missing)
(707 real changes made, 162 to missing)
(0 real changes made)
(16 real changes made, 16 to missing)
{com}. 
. /*
> gen indtenure = emptenure
> 
> *** indtenure
> bysort id (year): gen indswitch=0 if ind==ind[_n-1] | ind==. | ind[_n-1]==. | _n==1
> replace indswitch=1 if indswitch==.
> forvalues X = 2005(1)2014{c -(} 
>         **** 労働時間800時間以上&転職してない->+1
>         replace indtenure=indtenure[_n-1]+1 ///
>                 if morethan800==1 & indswitch==0 & year==`X'
>         **** 労働時間800時間未満&転職してない->+-0
>         replace indtenure=indtenure[_n-1] ///
>                 if morethan800==0 & indswitch==0 & year==`X' 
>         **** 転職した->0
>         replace indtenure=0 ///
>                 if indswitch==1 & ind!=. & ind[_n-1]!=. & year==`X'
>         **** 最初のobservationは変更しない
>         bysort id (year): replace indtenure=workexp if _n==1
> {c )-}
> */
. 
. **** Old job dummy
. *gen oj=1 if emptenure>0
. *gen oj=1 if switch==0&emptenure>0
. gen oj=1 if switch==0
{txt}(6,765 missing values generated)
{com}. replace oj=0 if oj==.
{txt}(6,765 real changes made)
{com}. 
. *** empidの作成
. sort id year
. by id: gen empid = 1 if _n==1|switch==1|emptenure<emptenure[_n-1]
{txt}(71,061 missing values generated)
{com}. replace empid=sum(empid)
{txt}(97,894 real changes made)
{com}. {c )-}
{txt}
{com}. 
. save  "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Input\jhps_hc_AllSample.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Input\jhps_hc_AllSample.dta saved

{com}. 
. * 10
. ** サンプルの制限
. {c -(}
. *** 18歳～64歳のみ残す
. keep if age>=18 & age<=64
{txt}(21,459 observations deleted)
{com}. *** 世帯主のみ残す
. **** headは「世帯主はだれか?」に対する回答
. **** earnmostは「家計で1番収入が多い人は?」に対する回答
. * keep if head==1
. keep if earnmost==1
{txt}(39,540 observations deleted)
{com}. *** 女性を落とす
. drop if sex==2
{txt}(5,886 observations deleted)
{com}. drop sex
. *** 雇用されていない人を落とす
. drop if employed==0
{txt}(5,891 observations deleted)
{com}. drop employed
. *** 官公庁を落とす
. drop if size==6
{txt}(2,033 observations deleted)
{com}. keep if owner==1 | owner==2 | owner==3
{txt}(2,181 observations deleted)
{com}. drop owner
. *** テニュア変数がマイナスのもの, 変な値のものを欠損値にする
. replace emptenure=. if emptenure<0| emptenure>workexp
{txt}(886 real changes made, 886 to missing)
{com}. replace workexp=. if workexp<0
{txt}(0 real changes made)
{com}. replace occtenure=. if occtenure<0
{txt}(0 real changes made)
{com}. *** 年間労働時間500時間未満の時給を欠損値にする
. replace realwage=. if workinghour<500
{txt}(578 real changes made, 578 to missing)
{com}. drop paymethod-overworkperweek cohort workinghour-wage
. *** 配偶者サンプルのフラグを作成
. gen sp =1 if (id>=10000&id<20000)|id>=30000
{txt}(10,863 missing values generated)
{com}. replace sp=0 if sp==.
{txt}(10,863 real changes made)
{com}. *** 配偶者を落とす
. drop if sp==1
{txt}(10,042 observations deleted)
{com}. /*
> *** new_cohortのフラグを作成
> gen new =1 if id>=40000
> replace new=0 if new==.
> *** new_cohortを落とす
> drop if new==1
> */
. {c )-}
{txt}
{com}. 
. 
. save "C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Input\jhps_hc.dta", replace
{txt}file C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Input\jhps_hc.dta saved

{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\AyakaNakamura\Dropbox\materials\Works\Master\program\Submittion\Output\DataCorrection.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 5 Oct 2018, 20:23:04
{txt}{.-}
{smcl}
{txt}{sf}{ul off}
